/* automatically generated by rust-bindgen 0.71.1 */

pub const BN_CURRENT_UI_ABI_VERSION: u32 = 12;
pub const BN_MINIMUM_UI_ABI_VERSION: u32 = 12;

pub const BN_CURRENT_CORE_ABI_VERSION: u32 = 152;
pub const BN_MINIMUM_CORE_ABI_VERSION: u32 = 152;
pub const MAX_RELOCATION_SIZE: u32 = 8;
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNPluginLoadOrder {
    EarlyPluginLoadOrder = 0,
    NormalPluginLoadOrder = 1,
    LatePluginLoadOrder = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataBuffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryView {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryViewType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryReader {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryWriter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNKeyValueStore {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSnapshot {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDatabase {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFileMetadata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransform {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransformContext {
    _unused: [u8; 0],
}
#[repr(C)]

    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBaseAddressDetection {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCollaborationChangeset {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRemoteFile {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRemoteFolder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCollaborationGroup {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCollaborationPermission {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRemoteProject {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRemote {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCollaborationSnapshot {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCollaborationUndoEntry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCollaborationUser {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNAnalysisMergeConflict {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNAnalysisMergeConflictSplitter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeArchiveMergeConflict {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCollaborationLazyT {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUndoAction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUndoEntry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDemangler {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFirmwareNinja {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFirmwareNinjaReferenceNode {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFirmwareNinjaRelationship {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLineFormatter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRenderLayer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStringRef {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNConstantRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStringRecognizer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomStringType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRemoteFileSearchMatch {
    pub projectId: *mut ::std::os::raw::c_char,
    pub projectName: *mut ::std::os::raw::c_char,
    pub fileId: *mut ::std::os::raw::c_char,
    pub fileName: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNRemoteFileSearchMatch"][::std::mem::size_of::<BNRemoteFileSearchMatch>() - 32usize];
    ["Alignment of BNRemoteFileSearchMatch"]
        [::std::mem::align_of::<BNRemoteFileSearchMatch>() - 8usize];
    ["Offset of field: BNRemoteFileSearchMatch::projectId"]
        [::std::mem::offset_of!(BNRemoteFileSearchMatch, projectId) - 0usize];
    ["Offset of field: BNRemoteFileSearchMatch::projectName"]
        [::std::mem::offset_of!(BNRemoteFileSearchMatch, projectName) - 8usize];
    ["Offset of field: BNRemoteFileSearchMatch::fileId"]
        [::std::mem::offset_of!(BNRemoteFileSearchMatch, fileId) - 16usize];
    ["Offset of field: BNRemoteFileSearchMatch::fileName"]
        [::std::mem::offset_of!(BNRemoteFileSearchMatch, fileName) - 24usize];
};
impl Default for BNRemoteFileSearchMatch {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type BNProgressFunction = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: usize, arg3: usize) -> bool,
>;
#[repr(u8)]
#[doc = "! Console log levels"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNLogLevel {
    DebugLog = 0,
    #[doc = "! Debug logging level, most verbose logging level"]
    InfoLog = 1,
    #[doc = "! Information logging level, default logging level"]
    WarningLog = 2,
    #[doc = "! Warning logging level, messages show with warning icon in the UI"]
    ErrorLog = 3,
    #[doc = "! Error logging level, messages show with error icon in the UI"]
    AlertLog = 4,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNEndianness {
    LittleEndian = 0,
    BigEndian = 1,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNModificationStatus {
    Original = 0,
    Changed = 1,
    Inserted = 2,
}
#[repr(u16)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTransformType {
    #[doc = " Two-way transform of data, binary input/output"]
    BinaryCodecTransform = 0,
    #[doc = " Two-way transform of data, encoder output is text"]
    TextCodecTransform = 1,
    #[doc = " Two-way transform of data, encoder output is Unicode string (as UTF8)"]
    UnicodeCodecTransform = 2,
    #[doc = " One-way decode only"]
    DecodeTransform = 3,
    #[doc = " One-way encode only, output is binary"]
    BinaryEncodeTransform = 4,
    #[doc = " One-way encode only, output is text"]
    TextEncodeTransform = 5,
    #[doc = " Two-way encryption"]
    EncryptTransform = 6,
    #[doc = " Transform that can be undone by performing twice"]
    InvertingTransform = 7,
    #[doc = " Hash function"]
    HashTransform = 8,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTransformSessionMode {
    #[doc = " Open the root file as-is (no unwrapping)"]
    TransformSessionModeDisabled = 0,
    #[doc = " Discover all paths (build the full context tree)"]
    TransformSessionModeFull = 1,
    #[doc = " Interactively request selection at each level of the container hierarchy"]
    TransformSessionModeInteractive = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTransformResult {
    TransformSuccess = 0,
    TransformNotAttempted = 1,
    TransformFailure = 2,
    TransformRequiresPassword = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNBranchType {
    UnconditionalBranch = 0,
    FalseBranch = 1,
    TrueBranch = 2,
    CallDestination = 3,
    FunctionReturn = 4,
    SystemCall = 5,
    IndirectBranch = 6,
    ExceptionBranch = 7,
    UnresolvedBranch = 127,
    UserDefinedBranch = 128,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNInstructionTextTokenType {
    TextToken = 0,
    InstructionToken = 1,
    OperandSeparatorToken = 2,
    RegisterToken = 3,
    IntegerToken = 4,
    PossibleAddressToken = 5,
    BeginMemoryOperandToken = 6,
    EndMemoryOperandToken = 7,
    FloatingPointToken = 8,
    AnnotationToken = 9,
    CodeRelativeAddressToken = 10,
    ArgumentNameToken = 11,
    HexDumpByteValueToken = 12,
    HexDumpSkippedByteToken = 13,
    HexDumpInvalidByteToken = 14,
    HexDumpTextToken = 15,
    OpcodeToken = 16,
    StringToken = 17,
    CharacterConstantToken = 18,
    KeywordToken = 19,
    TypeNameToken = 20,
    FieldNameToken = 21,
    NameSpaceToken = 22,
    NameSpaceSeparatorToken = 23,
    TagToken = 24,
    StructOffsetToken = 25,
    StructOffsetByteValueToken = 26,
    StructureHexDumpTextToken = 27,
    GotoLabelToken = 28,
    CommentToken = 29,
    PossibleValueToken = 30,
    PossibleValueTypeToken = 31,
    ArrayIndexToken = 32,
    IndentationToken = 33,
    UnknownMemoryToken = 34,
    EnumerationMemberToken = 35,
    OperationToken = 36,
    BaseStructureNameToken = 37,
    BaseStructureSeparatorToken = 38,
    BraceToken = 39,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    CodeSymbolToken = 64,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    DataSymbolToken = 65,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    LocalVariableToken = 66,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    ImportToken = 67,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    AddressDisplayToken = 68,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    IndirectImportToken = 69,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    ExternalSymbolToken = 70,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    StackVariableToken = 71,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    AddressSeparatorToken = 72,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    CollapsedInformationToken = 73,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    CollapseStateIndicatorToken = 74,
    #[doc = " The following are output by the analysis system automatically, these should\n not be used directly by the architecture plugins"]
    NewLineToken = 75,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNInstructionTextTokenContext {
    NoTokenContext = 0,
    LocalVariableTokenContext = 1,
    DataVariableTokenContext = 2,
    FunctionReturnTokenContext = 3,
    InstructionAddressTokenContext = 4,
    ILInstructionIndexTokenContext = 5,
    #[doc = " For Const Data arrays"]
    ConstDataTokenContext = 6,
    #[doc = " For ConstData strings"]
    ConstStringDataTokenContext = 7,
    #[doc = " For References to strings"]
    StringReferenceTokenContext = 8,
    #[doc = " For String DataVariables"]
    StringDataVariableTokenContext = 9,
    #[doc = " For displaying strings which aren't associated with an address"]
    StringDisplayTokenContext = 10,
    ContentCollapsedContext = 11,
    ContentExpandedContext = 12,
    ContentCollapsiblePadding = 13,
    DerivedStringReferenceTokenContext = 14,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNLinearDisassemblyLineType {
    BlankLineType = 0,
    BasicLineType = 1,
    CodeDisassemblyLineType = 2,
    DataVariableLineType = 3,
    HexDumpLineType = 4,
    FunctionHeaderLineType = 5,
    FunctionHeaderStartLineType = 6,
    FunctionHeaderEndLineType = 7,
    FunctionContinuationLineType = 8,
    LocalVariableLineType = 9,
    LocalVariableListEndLineType = 10,
    FunctionEndLineType = 11,
    NoteStartLineType = 12,
    NoteLineType = 13,
    NoteEndLineType = 14,
    SectionStartLineType = 15,
    SectionEndLineType = 16,
    SectionSeparatorLineType = 17,
    NonContiguousSeparatorLineType = 18,
    AnalysisWarningLineType = 19,
    CollapsedFunctionEndLineType = 20,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTokenEscapingType {
    NoTokenEscapingType = 0,
    BackticksTokenEscapingType = 1,
    QuotedStringEscapingType = 2,
    ReplaceInvalidCharsEscapingType = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNSymbolType {
    FunctionSymbol = 0,
    ImportAddressSymbol = 1,
    ImportedFunctionSymbol = 2,
    DataSymbol = 3,
    ImportedDataSymbol = 4,
    ExternalSymbol = 5,
    LibraryFunctionSymbol = 6,
    SymbolicFunctionSymbol = 7,
    LocalLabelSymbol = 8,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNSymbolBinding {
    NoBinding = 0,
    LocalBinding = 1,
    GlobalBinding = 2,
    WeakBinding = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNLowLevelILOperation {
    LLIL_NOP = 0,
    #[doc = " Not valid in SSA form (see LLIL_SET_REG_SSA)"]
    LLIL_SET_REG = 1,
    #[doc = " Not valid in SSA form (see LLIL_SET_REG_SPLIT_SSA)"]
    LLIL_SET_REG_SPLIT = 2,
    #[doc = " Not valid in SSA form (see LLIL_SET_FLAG_SSA)"]
    LLIL_SET_FLAG = 3,
    #[doc = " Not valid in SSA form (see LLIL_SET_REG_STACK_REL_SSA)"]
    LLIL_SET_REG_STACK_REL = 4,
    #[doc = " Not valid in SSA form (expanded)"]
    LLIL_REG_STACK_PUSH = 5,
    LLIL_ASSERT = 6,
    LLIL_FORCE_VER = 7,
    #[doc = " Not valid in SSA form (see LLIL_LOAD_SSA)"]
    LLIL_LOAD = 8,
    #[doc = " Not valid in SSA form (see LLIL_STORE_SSA)"]
    LLIL_STORE = 9,
    #[doc = " Not valid in SSA form (expanded)"]
    LLIL_PUSH = 10,
    #[doc = " Not valid in SSA form (expanded)"]
    LLIL_POP = 11,
    #[doc = " Not valid in SSA form (see LLIL_REG_SSA)"]
    LLIL_REG = 12,
    #[doc = " Not valid in SSA form (see LLIL_REG_SPLIT_SSA)"]
    LLIL_REG_SPLIT = 13,
    #[doc = " Not valid in SSA form (see LLIL_REG_STACK_REL_SSA)"]
    LLIL_REG_STACK_REL = 14,
    #[doc = " Not valid in SSA form (expanded)"]
    LLIL_REG_STACK_POP = 15,
    #[doc = " Not valid in SSA form (see LLIL_REG_STACK_FREE_REL_SSA,\n LLIL_REG_STACK_FREE_ABS_SSA)"]
    LLIL_REG_STACK_FREE_REG = 16,
    #[doc = " Not valid in SSA from (see LLIL_REG_STACK_FREE_REL_SSA)"]
    LLIL_REG_STACK_FREE_REL = 17,
    LLIL_CONST = 18,
    LLIL_CONST_PTR = 19,
    LLIL_EXTERN_PTR = 20,
    LLIL_FLOAT_CONST = 21,
    #[doc = " Not valid in SSA form (see LLIL_FLAG_SSA)"]
    LLIL_FLAG = 22,
    #[doc = " Not valid in SSA form (see LLIL_FLAG_BIT_SSA)"]
    LLIL_FLAG_BIT = 23,
    LLIL_ADD = 24,
    LLIL_ADC = 25,
    LLIL_SUB = 26,
    LLIL_SBB = 27,
    LLIL_AND = 28,
    LLIL_OR = 29,
    LLIL_XOR = 30,
    LLIL_LSL = 31,
    LLIL_LSR = 32,
    LLIL_ASR = 33,
    LLIL_ROL = 34,
    LLIL_RLC = 35,
    LLIL_ROR = 36,
    LLIL_RRC = 37,
    LLIL_MUL = 38,
    LLIL_MULU_DP = 39,
    LLIL_MULS_DP = 40,
    LLIL_DIVU = 41,
    LLIL_DIVU_DP = 42,
    LLIL_DIVS = 43,
    LLIL_DIVS_DP = 44,
    LLIL_MODU = 45,
    LLIL_MODU_DP = 46,
    LLIL_MODS = 47,
    LLIL_MODS_DP = 48,
    LLIL_NEG = 49,
    LLIL_NOT = 50,
    LLIL_SX = 51,
    LLIL_ZX = 52,
    LLIL_LOW_PART = 53,
    LLIL_JUMP = 54,
    LLIL_JUMP_TO = 55,
    LLIL_CALL = 56,
    LLIL_CALL_STACK_ADJUST = 57,
    LLIL_TAILCALL = 58,
    LLIL_RET = 59,
    LLIL_NORET = 60,
    LLIL_IF = 61,
    LLIL_GOTO = 62,
    #[doc = " Valid only in Lifted IL"]
    LLIL_FLAG_COND = 63,
    #[doc = " Valid only in Lifted IL"]
    LLIL_FLAG_GROUP = 64,
    LLIL_CMP_E = 65,
    LLIL_CMP_NE = 66,
    LLIL_CMP_SLT = 67,
    LLIL_CMP_ULT = 68,
    LLIL_CMP_SLE = 69,
    LLIL_CMP_ULE = 70,
    LLIL_CMP_SGE = 71,
    LLIL_CMP_UGE = 72,
    LLIL_CMP_SGT = 73,
    LLIL_CMP_UGT = 74,
    LLIL_TEST_BIT = 75,
    LLIL_BOOL_TO_INT = 76,
    LLIL_ADD_OVERFLOW = 77,
    LLIL_SYSCALL = 78,
    LLIL_BP = 79,
    LLIL_TRAP = 80,
    LLIL_INTRINSIC = 81,
    LLIL_UNDEF = 82,
    LLIL_UNIMPL = 83,
    LLIL_UNIMPL_MEM = 84,
    #[doc = " Floating point"]
    LLIL_FADD = 85,
    #[doc = " Floating point"]
    LLIL_FSUB = 86,
    #[doc = " Floating point"]
    LLIL_FMUL = 87,
    #[doc = " Floating point"]
    LLIL_FDIV = 88,
    #[doc = " Floating point"]
    LLIL_FSQRT = 89,
    #[doc = " Floating point"]
    LLIL_FNEG = 90,
    #[doc = " Floating point"]
    LLIL_FABS = 91,
    #[doc = " Floating point"]
    LLIL_FLOAT_TO_INT = 92,
    #[doc = " Floating point"]
    LLIL_INT_TO_FLOAT = 93,
    #[doc = " Floating point"]
    LLIL_FLOAT_CONV = 94,
    #[doc = " Floating point"]
    LLIL_ROUND_TO_INT = 95,
    #[doc = " Floating point"]
    LLIL_FLOOR = 96,
    #[doc = " Floating point"]
    LLIL_CEIL = 97,
    #[doc = " Floating point"]
    LLIL_FTRUNC = 98,
    #[doc = " Floating point"]
    LLIL_FCMP_E = 99,
    #[doc = " Floating point"]
    LLIL_FCMP_NE = 100,
    #[doc = " Floating point"]
    LLIL_FCMP_LT = 101,
    #[doc = " Floating point"]
    LLIL_FCMP_LE = 102,
    #[doc = " Floating point"]
    LLIL_FCMP_GE = 103,
    #[doc = " Floating point"]
    LLIL_FCMP_GT = 104,
    #[doc = " Floating point"]
    LLIL_FCMP_O = 105,
    #[doc = " Floating point"]
    LLIL_FCMP_UO = 106,
    #[doc = " The following instructions are only used in SSA form"]
    LLIL_SET_REG_SSA = 107,
    #[doc = " The following instructions are only used in SSA form"]
    LLIL_SET_REG_SSA_PARTIAL = 108,
    #[doc = " The following instructions are only used in SSA form"]
    LLIL_SET_REG_SPLIT_SSA = 109,
    #[doc = " The following instructions are only used in SSA form"]
    LLIL_SET_REG_STACK_REL_SSA = 110,
    #[doc = " The following instructions are only used in SSA form"]
    LLIL_SET_REG_STACK_ABS_SSA = 111,
    #[doc = " Only valid within an LLIL_SET_REG_SPLIT_SSA instruction"]
    LLIL_REG_SPLIT_DEST_SSA = 112,
    #[doc = " Only valid within LLIL_SET_REG_STACK_REL_SSA or LLIL_SET_REG_STACK_ABS_SSA"]
    LLIL_REG_STACK_DEST_SSA = 113,
    LLIL_REG_SSA = 114,
    LLIL_REG_SSA_PARTIAL = 115,
    LLIL_REG_SPLIT_SSA = 116,
    LLIL_REG_STACK_REL_SSA = 117,
    LLIL_REG_STACK_ABS_SSA = 118,
    LLIL_REG_STACK_FREE_REL_SSA = 119,
    LLIL_REG_STACK_FREE_ABS_SSA = 120,
    LLIL_SET_FLAG_SSA = 121,
    LLIL_ASSERT_SSA = 122,
    LLIL_FORCE_VER_SSA = 123,
    LLIL_FLAG_SSA = 124,
    LLIL_FLAG_BIT_SSA = 125,
    LLIL_CALL_SSA = 126,
    LLIL_SYSCALL_SSA = 127,
    LLIL_TAILCALL_SSA = 128,
    #[doc = " Only valid within the LLIL_CALL_SSA, LLIL_SYSCALL_SSA, LLIL_INTRINSIC, LLIL_INTRINSIC_SSA,\n LLIL_MEMORY_INTRINSIC_SSA, LLIL_TAILCALL, LLIL_TAILCALL_SSA instructions"]
    LLIL_CALL_PARAM = 129,
    #[doc = " Only valid within the LLIL_CALL_SSA or LLIL_SYSCALL_SSA instructions"]
    LLIL_CALL_STACK_SSA = 130,
    #[doc = " Only valid within the LLIL_CALL_SSA or LLIL_SYSCALL_SSA instructions"]
    LLIL_CALL_OUTPUT_SSA = 131,
    #[doc = " Only valid within the LLIL_CALL_PARAM instruction"]
    LLIL_SEPARATE_PARAM_LIST_SSA = 132,
    #[doc = " Only valid within the LLIL_CALL_PARAM or LLIL_SEPARATE_PARAM_LIST_SSA instructions"]
    LLIL_SHARED_PARAM_SLOT_SSA = 133,
    #[doc = " Only valid within the LLIL_MEMORY_INTRINSIC_SSA instruction"]
    LLIL_MEMORY_INTRINSIC_OUTPUT_SSA = 134,
    LLIL_LOAD_SSA = 135,
    LLIL_STORE_SSA = 136,
    LLIL_INTRINSIC_SSA = 137,
    LLIL_MEMORY_INTRINSIC_SSA = 138,
    LLIL_REG_PHI = 139,
    LLIL_REG_STACK_PHI = 140,
    LLIL_FLAG_PHI = 141,
    LLIL_MEM_PHI = 142,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNLowLevelILFlagCondition {
    LLFC_E = 0,
    LLFC_NE = 1,
    LLFC_SLT = 2,
    LLFC_ULT = 3,
    LLFC_SLE = 4,
    LLFC_ULE = 5,
    LLFC_SGE = 6,
    LLFC_UGE = 7,
    LLFC_SGT = 8,
    LLFC_UGT = 9,
    LLFC_NEG = 10,
    LLFC_POS = 11,
    LLFC_O = 12,
    LLFC_NO = 13,
    LLFC_FE = 14,
    LLFC_FNE = 15,
    LLFC_FLT = 16,
    LLFC_FLE = 17,
    LLFC_FGE = 18,
    LLFC_FGT = 19,
    LLFC_FO = 20,
    LLFC_FUO = 21,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNFlagRole {
    SpecialFlagRole = 0,
    ZeroFlagRole = 1,
    PositiveSignFlagRole = 2,
    NegativeSignFlagRole = 3,
    CarryFlagRole = 4,
    OverflowFlagRole = 5,
    HalfCarryFlagRole = 6,
    EvenParityFlagRole = 7,
    OddParityFlagRole = 8,
    OrderedFlagRole = 9,
    UnorderedFlagRole = 10,
    CarryFlagWithInvertedSubtractRole = 11,
}
#[repr(i8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNFunctionGraphType {
    InvalidILViewType = -1,
    NormalFunctionGraph = 0,
    LowLevelILFunctionGraph = 1,
    LiftedILFunctionGraph = 2,
    LowLevelILSSAFormFunctionGraph = 3,
    MediumLevelILFunctionGraph = 4,
    MediumLevelILSSAFormFunctionGraph = 5,
    MappedMediumLevelILFunctionGraph = 6,
    MappedMediumLevelILSSAFormFunctionGraph = 7,
    HighLevelILFunctionGraph = 8,
    HighLevelILSSAFormFunctionGraph = 9,
    HighLevelLanguageRepresentationFunctionGraph = 10,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFunctionViewType {
    pub type_: BNFunctionGraphType,
    #[doc = " Only used for HighLevelLanguageRepresentationFunctionGraph"]
    pub name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNFunctionViewType"][::std::mem::size_of::<BNFunctionViewType>() - 16usize];
    ["Alignment of BNFunctionViewType"][::std::mem::align_of::<BNFunctionViewType>() - 8usize];
    ["Offset of field: BNFunctionViewType::type_"]
        [::std::mem::offset_of!(BNFunctionViewType, type_) - 0usize];
    ["Offset of field: BNFunctionViewType::name"]
        [::std::mem::offset_of!(BNFunctionViewType, name) - 8usize];
};
impl Default for BNFunctionViewType {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNDisassemblyOption {
    ShowAddress = 0,
    ShowOpcode = 1,
    ExpandLongOpcode = 2,
    ShowVariablesAtTopOfGraph = 3,
    ShowVariableTypesWhenAssigned = 4,
    ShowRegisterHighlight = 7,
    ShowFunctionAddress = 8,
    ShowFunctionHeader = 9,
    ShowTypeCasts = 10,
    #[doc = " Linear disassembly options"]
    GroupLinearDisassemblyFunctions = 64,
    #[doc = " Linear disassembly options"]
    HighLevelILLinearDisassembly = 65,
    #[doc = " Linear disassembly options"]
    WaitForIL = 66,
    #[doc = " Linear disassembly options"]
    IndentHLILBody = 67,
    #[doc = " Linear disassembly options"]
    DisableLineFormatting = 68,
    #[doc = " Debugging options"]
    ShowFlagUsage = 128,
    #[doc = " Debugging options"]
    ShowStackPointer = 129,
    #[doc = " Debugging options"]
    ShowILTypes = 130,
    #[doc = " Debugging options"]
    ShowILOpcodes = 131,
    #[doc = " Debugging options"]
    ShowCollapseIndicators = 132,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNDisassemblyAddressMode {
    AbsoluteDisassemblyAddressMode = 0,
    RelativeToBinaryStartDisassemblyAddressMode = 1,
    RelativeToSegmentStartDisassemblyAddressMode = 2,
    RelativeToSectionStartDisassemblyAddressMode = 3,
    RelativeToFunctionStartDisassemblyAddressMode = 4,
    RelativeToAddressBaseOffsetDisassemblyAddressMode = 5,
    RelativeToDataStartDisassemblyAddressMode = 6,
    DisassemblyAddressModeMask = 65535,
    IncludeNameDisassemblyAddressModeFlag = 65536,
    DecimalDisassemblyAddressModeFlag = 131072,
    DisassemblyAddressModeFlagsMask = 4294901760,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNDisassemblyCallParameterHints {
    NeverShowMatchingParameterHints = 0,
    AlwaysShowParameterHints = 1,
    NeverShowParameterHints = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNDisassemblyBlockLabels {
    NeverShowDefaultBlockLabels = 0,
    AlwaysShowBlockLabels = 1,
    NeverShowBlockLabels = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTypeClass {
    VoidTypeClass = 0,
    BoolTypeClass = 1,
    IntegerTypeClass = 2,
    FloatTypeClass = 3,
    StructureTypeClass = 4,
    EnumerationTypeClass = 5,
    PointerTypeClass = 6,
    ArrayTypeClass = 7,
    FunctionTypeClass = 8,
    VarArgsTypeClass = 9,
    ValueTypeClass = 10,
    NamedTypeReferenceClass = 11,
    WideCharTypeClass = 12,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNNamedTypeReferenceClass {
    UnknownNamedTypeClass = 0,
    TypedefNamedTypeClass = 1,
    ClassNamedTypeClass = 2,
    StructNamedTypeClass = 3,
    UnionNamedTypeClass = 4,
    EnumNamedTypeClass = 5,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNStructureVariant {
    ClassStructureType = 0,
    StructStructureType = 1,
    UnionStructureType = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNMemberScope {
    NoScope = 0,
    StaticScope = 1,
    VirtualScope = 2,
    ThunkScope = 3,
    FriendScope = 4,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNMemberAccess {
    NoAccess = 0,
    PrivateAccess = 1,
    ProtectedAccess = 2,
    PublicAccess = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNReferenceType {
    PointerReferenceType = 0,
    ReferenceReferenceType = 1,
    RValueReferenceType = 2,
    NoReference = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNPointerSuffix {
    Ptr64Suffix = 0,
    UnalignedSuffix = 1,
    RestrictSuffix = 2,
    ReferenceSuffix = 3,
    LvalueSuffix = 4,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNPointerBaseType {
    AbsolutePointerBaseType = 0,
    RelativeToConstantPointerBaseType = 1,
    RelativeToBinaryStartPointerBaseType = 2,
    RelativeToVariableAddressPointerBaseType = 3,
}
#[repr(u8)]
#[doc = " Caution: these enumeration values are used a lookups into the static NameTypeStrings in the core\n if you modify this you must also modify the string lookups as well"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNNameType {
    NoNameType = 0,
    ConstructorNameType = 1,
    DestructorNameType = 2,
    OperatorNewNameType = 3,
    OperatorDeleteNameType = 4,
    OperatorAssignNameType = 5,
    OperatorRightShiftNameType = 6,
    OperatorLeftShiftNameType = 7,
    OperatorNotNameType = 8,
    OperatorEqualNameType = 9,
    OperatorNotEqualNameType = 10,
    OperatorArrayNameType = 11,
    OperatorArrowNameType = 12,
    OperatorStarNameType = 13,
    OperatorIncrementNameType = 14,
    OperatorDecrementNameType = 15,
    OperatorMinusNameType = 16,
    OperatorPlusNameType = 17,
    OperatorBitAndNameType = 18,
    OperatorArrowStarNameType = 19,
    OperatorDivideNameType = 20,
    OperatorModulusNameType = 21,
    OperatorLessThanNameType = 22,
    OperatorLessThanEqualNameType = 23,
    OperatorGreaterThanNameType = 24,
    OperatorGreaterThanEqualNameType = 25,
    OperatorCommaNameType = 26,
    OperatorParenthesesNameType = 27,
    OperatorTildeNameType = 28,
    OperatorXorNameType = 29,
    OperatorBitOrNameType = 30,
    OperatorLogicalAndNameType = 31,
    OperatorLogicalOrNameType = 32,
    OperatorStarEqualNameType = 33,
    OperatorPlusEqualNameType = 34,
    OperatorMinusEqualNameType = 35,
    OperatorDivideEqualNameType = 36,
    OperatorModulusEqualNameType = 37,
    OperatorRightShiftEqualNameType = 38,
    OperatorLeftShiftEqualNameType = 39,
    OperatorAndEqualNameType = 40,
    OperatorOrEqualNameType = 41,
    OperatorXorEqualNameType = 42,
    VFTableNameType = 43,
    VBTableNameType = 44,
    VCallNameType = 45,
    TypeofNameType = 46,
    LocalStaticGuardNameType = 47,
    StringNameType = 48,
    VBaseDestructorNameType = 49,
    VectorDeletingDestructorNameType = 50,
    DefaultConstructorClosureNameType = 51,
    ScalarDeletingDestructorNameType = 52,
    VectorConstructorIteratorNameType = 53,
    VectorDestructorIteratorNameType = 54,
    VectorVBaseConstructorIteratorNameType = 55,
    VirtualDisplacementMapNameType = 56,
    EHVectorConstructorIteratorNameType = 57,
    EHVectorDestructorIteratorNameType = 58,
    EHVectorVBaseConstructorIteratorNameType = 59,
    CopyConstructorClosureNameType = 60,
    UDTReturningNameType = 61,
    LocalVFTableNameType = 62,
    LocalVFTableConstructorClosureNameType = 63,
    OperatorNewArrayNameType = 64,
    OperatorDeleteArrayNameType = 65,
    PlacementDeleteClosureNameType = 66,
    PlacementDeleteClosureArrayNameType = 67,
    OperatorReturnTypeNameType = 68,
    RttiTypeDescriptor = 69,
    RttiBaseClassDescriptor = 70,
    RttiBaseClassArray = 71,
    RttiClassHierarchyDescriptor = 72,
    RttiCompleteObjectLocator = 73,
    OperatorUnaryMinusNameType = 74,
    OperatorUnaryPlusNameType = 75,
    OperatorUnaryBitAndNameType = 76,
    OperatorUnaryStarNameType = 77,
    OmniCallSigNameType = 78,
    ManagedVectorConstructorIteratorNameType = 79,
    ManagedVectorDestructorIteratorNameType = 80,
    EHVectorCopyConstructorIteratorNameType = 81,
    EHVectorVBaseCopyConstructorIteratorNameType = 82,
    DynamicInitializerNameType = 83,
    DynamicAtExitDestructorNameType = 84,
    VectorCopyConstructorIteratorNameType = 85,
    VectorVBaseCopyConstructorIteratorNameType = 86,
    ManagedVectorCopyConstructorIteratorNameType = 87,
    LocalStaticThreadGuardNameType = 88,
    UserDefinedLiteralOperatorNameType = 89,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNCallingConventionName {
    NoCallingConvention = 0,
    CdeclCallingConvention = 1,
    PascalCallingConvention = 2,
    ThisCallCallingConvention = 3,
    STDCallCallingConvention = 4,
    FastcallCallingConvention = 5,
    CLRCallCallingConvention = 6,
    EabiCallCallingConvention = 7,
    VectorCallCallingConvention = 8,
    SwiftCallingConvention = 9,
    SwiftAsyncCallingConvention = 10,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNStringType {
    AsciiString = 0,
    Utf16String = 1,
    Utf32String = 2,
    Utf8String = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNIntegerDisplayType {
    DefaultIntegerDisplayType = 0,
    BinaryDisplayType = 1,
    SignedOctalDisplayType = 2,
    UnsignedOctalDisplayType = 3,
    SignedDecimalDisplayType = 4,
    UnsignedDecimalDisplayType = 5,
    SignedHexadecimalDisplayType = 6,
    UnsignedHexadecimalDisplayType = 7,
    CharacterConstantDisplayType = 8,
    PointerDisplayType = 9,
    FloatDisplayType = 10,
    DoubleDisplayType = 11,
    EnumerationDisplayType = 12,
    InvertedCharacterConstantDisplayType = 13,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNFlowGraphOption {
    FlowGraphUsesBlockHighlights = 0,
    FlowGraphUsesInstructionHighlights = 1,
    FlowGraphIncludesUserComments = 2,
    FlowGraphAllowsPatching = 3,
    FlowGraphAllowsInlineInstructionEditing = 4,
    FlowGraphShowsSecondaryRegisterHighlighting = 5,
    FlowGraphIsAddressable = 6,
    FlowGraphIsWorkflowGraph = 7,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNIntrinsicClass {
    GeneralIntrinsicClass = 0,
    MemoryIntrinsicClass = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLowLevelILInstruction {
    pub operation: BNLowLevelILOperation,
    pub attributes: u32,
    pub size: usize,
    pub flags: u32,
    pub sourceOperand: u32,
    pub operands: [u64; 4usize],
    pub address: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNLowLevelILInstruction"][::std::mem::size_of::<BNLowLevelILInstruction>() - 64usize];
    ["Alignment of BNLowLevelILInstruction"]
        [::std::mem::align_of::<BNLowLevelILInstruction>() - 8usize];
    ["Offset of field: BNLowLevelILInstruction::operation"]
        [::std::mem::offset_of!(BNLowLevelILInstruction, operation) - 0usize];
    ["Offset of field: BNLowLevelILInstruction::attributes"]
        [::std::mem::offset_of!(BNLowLevelILInstruction, attributes) - 4usize];
    ["Offset of field: BNLowLevelILInstruction::size"]
        [::std::mem::offset_of!(BNLowLevelILInstruction, size) - 8usize];
    ["Offset of field: BNLowLevelILInstruction::flags"]
        [::std::mem::offset_of!(BNLowLevelILInstruction, flags) - 16usize];
    ["Offset of field: BNLowLevelILInstruction::sourceOperand"]
        [::std::mem::offset_of!(BNLowLevelILInstruction, sourceOperand) - 20usize];
    ["Offset of field: BNLowLevelILInstruction::operands"]
        [::std::mem::offset_of!(BNLowLevelILInstruction, operands) - 24usize];
    ["Offset of field: BNLowLevelILInstruction::address"]
        [::std::mem::offset_of!(BNLowLevelILInstruction, address) - 56usize];
};
impl Default for BNLowLevelILInstruction {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BNLowLevelILLabel {
    pub resolved: bool,
    pub ref_: usize,
    pub operand: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNLowLevelILLabel"][::std::mem::size_of::<BNLowLevelILLabel>() - 24usize];
    ["Alignment of BNLowLevelILLabel"][::std::mem::align_of::<BNLowLevelILLabel>() - 8usize];
    ["Offset of field: BNLowLevelILLabel::resolved"]
        [::std::mem::offset_of!(BNLowLevelILLabel, resolved) - 0usize];
    ["Offset of field: BNLowLevelILLabel::ref_"]
        [::std::mem::offset_of!(BNLowLevelILLabel, ref_) - 8usize];
    ["Offset of field: BNLowLevelILLabel::operand"]
        [::std::mem::offset_of!(BNLowLevelILLabel, operand) - 16usize];
};
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNImplicitRegisterExtend {
    NoExtend = 0,
    ZeroExtendToFullWidth = 1,
    SignExtendToFullWidth = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterInfo {
    pub fullWidthRegister: u32,
    pub offset: usize,
    pub size: usize,
    pub extend: BNImplicitRegisterExtend,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNRegisterInfo"][::std::mem::size_of::<BNRegisterInfo>() - 32usize];
    ["Alignment of BNRegisterInfo"][::std::mem::align_of::<BNRegisterInfo>() - 8usize];
    ["Offset of field: BNRegisterInfo::fullWidthRegister"]
        [::std::mem::offset_of!(BNRegisterInfo, fullWidthRegister) - 0usize];
    ["Offset of field: BNRegisterInfo::offset"]
        [::std::mem::offset_of!(BNRegisterInfo, offset) - 8usize];
    ["Offset of field: BNRegisterInfo::size"]
        [::std::mem::offset_of!(BNRegisterInfo, size) - 16usize];
    ["Offset of field: BNRegisterInfo::extend"]
        [::std::mem::offset_of!(BNRegisterInfo, extend) - 24usize];
};
impl Default for BNRegisterInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BNRegisterStackInfo {
    pub firstStorageReg: u32,
    pub firstTopRelativeReg: u32,
    pub storageCount: u32,
    pub topRelativeCount: u32,
    pub stackTopReg: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNRegisterStackInfo"][::std::mem::size_of::<BNRegisterStackInfo>() - 20usize];
    ["Alignment of BNRegisterStackInfo"][::std::mem::align_of::<BNRegisterStackInfo>() - 4usize];
    ["Offset of field: BNRegisterStackInfo::firstStorageReg"]
        [::std::mem::offset_of!(BNRegisterStackInfo, firstStorageReg) - 0usize];
    ["Offset of field: BNRegisterStackInfo::firstTopRelativeReg"]
        [::std::mem::offset_of!(BNRegisterStackInfo, firstTopRelativeReg) - 4usize];
    ["Offset of field: BNRegisterStackInfo::storageCount"]
        [::std::mem::offset_of!(BNRegisterStackInfo, storageCount) - 8usize];
    ["Offset of field: BNRegisterStackInfo::topRelativeCount"]
        [::std::mem::offset_of!(BNRegisterStackInfo, topRelativeCount) - 12usize];
    ["Offset of field: BNRegisterStackInfo::stackTopReg"]
        [::std::mem::offset_of!(BNRegisterStackInfo, stackTopReg) - 16usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNRegisterValueType {
    UndeterminedValue = 0,
    EntryValue = 1,
    ConstantValue = 2,
    ConstantPointerValue = 3,
    ExternalPointerValue = 4,
    StackFrameOffset = 5,
    ReturnAddressValue = 6,
    ImportedAddressValue = 7,
    #[doc = " The following are only valid in BNPossibleValueSet"]
    SignedRangeValue = 8,
    #[doc = " The following are only valid in BNPossibleValueSet"]
    UnsignedRangeValue = 9,
    #[doc = " The following are only valid in BNPossibleValueSet"]
    LookupTableValue = 10,
    #[doc = " The following are only valid in BNPossibleValueSet"]
    InSetOfValues = 11,
    #[doc = " The following are only valid in BNPossibleValueSet"]
    NotInSetOfValues = 12,
    #[doc = " The following support constant data and values larger than 8 bytes"]
    ConstantDataValue = 32768,
    #[doc = " The following support constant data and values larger than 8 bytes"]
    ConstantDataZeroExtendValue = 32769,
    #[doc = " The following support constant data and values larger than 8 bytes"]
    ConstantDataSignExtendValue = 32770,
    #[doc = " The following support constant data and values larger than 8 bytes"]
    ConstantDataAggregateValue = 32771,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNDataFlowQueryOption {
    #[doc = " Use addresses instead of index in the from list within\n LookupTableValue results"]
    FromAddressesInLookupTableQueryOption = 0,
    AllowReadingWritableMemoryQueryOption = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNPluginStatus {
    NotInstalledPluginStatus = 0,
    InstalledPluginStatus = 1,
    EnabledPluginStatus = 2,
    UpdateAvailablePluginStatus = 16,
    DeletePendingPluginStatus = 32,
    UpdatePendingPluginStatus = 64,
    DisablePendingPluginStatus = 128,
    PendingRestartPluginStatus = 512,
    BeingUpdatedPluginStatus = 1024,
    BeingDeletedPluginStatus = 2048,
    DependenciesBeingInstalledStatus = 4096,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNPluginType {
    CorePluginType = 0,
    UiPluginType = 1,
    ArchitecturePluginType = 2,
    BinaryViewPluginType = 3,
    HelperPluginType = 4,
    SyncPluginType = 5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLookupTableEntry {
    pub fromValues: *mut i64,
    pub fromCount: usize,
    pub toValue: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNLookupTableEntry"][::std::mem::size_of::<BNLookupTableEntry>() - 24usize];
    ["Alignment of BNLookupTableEntry"][::std::mem::align_of::<BNLookupTableEntry>() - 8usize];
    ["Offset of field: BNLookupTableEntry::fromValues"]
        [::std::mem::offset_of!(BNLookupTableEntry, fromValues) - 0usize];
    ["Offset of field: BNLookupTableEntry::fromCount"]
        [::std::mem::offset_of!(BNLookupTableEntry, fromCount) - 8usize];
    ["Offset of field: BNLookupTableEntry::toValue"]
        [::std::mem::offset_of!(BNLookupTableEntry, toValue) - 16usize];
};
impl Default for BNLookupTableEntry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterValue {
    pub state: BNRegisterValueType,
    pub value: i64,
    pub offset: i64,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNRegisterValue"][::std::mem::size_of::<BNRegisterValue>() - 32usize];
    ["Alignment of BNRegisterValue"][::std::mem::align_of::<BNRegisterValue>() - 8usize];
    ["Offset of field: BNRegisterValue::state"]
        [::std::mem::offset_of!(BNRegisterValue, state) - 0usize];
    ["Offset of field: BNRegisterValue::value"]
        [::std::mem::offset_of!(BNRegisterValue, value) - 8usize];
    ["Offset of field: BNRegisterValue::offset"]
        [::std::mem::offset_of!(BNRegisterValue, offset) - 16usize];
    ["Offset of field: BNRegisterValue::size"]
        [::std::mem::offset_of!(BNRegisterValue, size) - 24usize];
};
impl Default for BNRegisterValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterValueWithConfidence {
    pub value: BNRegisterValue,
    pub confidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNRegisterValueWithConfidence"]
        [::std::mem::size_of::<BNRegisterValueWithConfidence>() - 40usize];
    ["Alignment of BNRegisterValueWithConfidence"]
        [::std::mem::align_of::<BNRegisterValueWithConfidence>() - 8usize];
    ["Offset of field: BNRegisterValueWithConfidence::value"]
        [::std::mem::offset_of!(BNRegisterValueWithConfidence, value) - 0usize];
    ["Offset of field: BNRegisterValueWithConfidence::confidence"]
        [::std::mem::offset_of!(BNRegisterValueWithConfidence, confidence) - 32usize];
};
impl Default for BNRegisterValueWithConfidence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BNValueRange {
    pub start: u64,
    pub end: u64,
    pub step: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNValueRange"][::std::mem::size_of::<BNValueRange>() - 24usize];
    ["Alignment of BNValueRange"][::std::mem::align_of::<BNValueRange>() - 8usize];
    ["Offset of field: BNValueRange::start"][::std::mem::offset_of!(BNValueRange, start) - 0usize];
    ["Offset of field: BNValueRange::end"][::std::mem::offset_of!(BNValueRange, end) - 8usize];
    ["Offset of field: BNValueRange::step"][::std::mem::offset_of!(BNValueRange, step) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPossibleValueSet {
    pub state: BNRegisterValueType,
    pub value: i64,
    pub offset: i64,
    pub size: usize,
    pub ranges: *mut BNValueRange,
    pub valueSet: *mut i64,
    pub table: *mut BNLookupTableEntry,
    pub count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNPossibleValueSet"][::std::mem::size_of::<BNPossibleValueSet>() - 64usize];
    ["Alignment of BNPossibleValueSet"][::std::mem::align_of::<BNPossibleValueSet>() - 8usize];
    ["Offset of field: BNPossibleValueSet::state"]
        [::std::mem::offset_of!(BNPossibleValueSet, state) - 0usize];
    ["Offset of field: BNPossibleValueSet::value"]
        [::std::mem::offset_of!(BNPossibleValueSet, value) - 8usize];
    ["Offset of field: BNPossibleValueSet::offset"]
        [::std::mem::offset_of!(BNPossibleValueSet, offset) - 16usize];
    ["Offset of field: BNPossibleValueSet::size"]
        [::std::mem::offset_of!(BNPossibleValueSet, size) - 24usize];
    ["Offset of field: BNPossibleValueSet::ranges"]
        [::std::mem::offset_of!(BNPossibleValueSet, ranges) - 32usize];
    ["Offset of field: BNPossibleValueSet::valueSet"]
        [::std::mem::offset_of!(BNPossibleValueSet, valueSet) - 40usize];
    ["Offset of field: BNPossibleValueSet::table"]
        [::std::mem::offset_of!(BNPossibleValueSet, table) - 48usize];
    ["Offset of field: BNPossibleValueSet::count"]
        [::std::mem::offset_of!(BNPossibleValueSet, count) - 56usize];
};
impl Default for BNPossibleValueSet {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BNRegisterOrConstant {
    pub constant: bool,
    pub reg: u32,
    pub value: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNRegisterOrConstant"][::std::mem::size_of::<BNRegisterOrConstant>() - 16usize];
    ["Alignment of BNRegisterOrConstant"][::std::mem::align_of::<BNRegisterOrConstant>() - 8usize];
    ["Offset of field: BNRegisterOrConstant::constant"]
        [::std::mem::offset_of!(BNRegisterOrConstant, constant) - 0usize];
    ["Offset of field: BNRegisterOrConstant::reg"]
        [::std::mem::offset_of!(BNRegisterOrConstant, reg) - 4usize];
    ["Offset of field: BNRegisterOrConstant::value"]
        [::std::mem::offset_of!(BNRegisterOrConstant, value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataVariable {
    pub address: u64,
    pub type_: *mut BNType,
    pub autoDiscovered: bool,
    pub typeConfidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDataVariable"][::std::mem::size_of::<BNDataVariable>() - 24usize];
    ["Alignment of BNDataVariable"][::std::mem::align_of::<BNDataVariable>() - 8usize];
    ["Offset of field: BNDataVariable::address"]
        [::std::mem::offset_of!(BNDataVariable, address) - 0usize];
    ["Offset of field: BNDataVariable::type_"]
        [::std::mem::offset_of!(BNDataVariable, type_) - 8usize];
    ["Offset of field: BNDataVariable::autoDiscovered"]
        [::std::mem::offset_of!(BNDataVariable, autoDiscovered) - 16usize];
    ["Offset of field: BNDataVariable::typeConfidence"]
        [::std::mem::offset_of!(BNDataVariable, typeConfidence) - 17usize];
};
impl Default for BNDataVariable {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataVariableAndName {
    pub address: u64,
    pub type_: *mut BNType,
    pub name: *mut ::std::os::raw::c_char,
    pub autoDiscovered: bool,
    pub typeConfidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDataVariableAndName"][::std::mem::size_of::<BNDataVariableAndName>() - 32usize];
    ["Alignment of BNDataVariableAndName"]
        [::std::mem::align_of::<BNDataVariableAndName>() - 8usize];
    ["Offset of field: BNDataVariableAndName::address"]
        [::std::mem::offset_of!(BNDataVariableAndName, address) - 0usize];
    ["Offset of field: BNDataVariableAndName::type_"]
        [::std::mem::offset_of!(BNDataVariableAndName, type_) - 8usize];
    ["Offset of field: BNDataVariableAndName::name"]
        [::std::mem::offset_of!(BNDataVariableAndName, name) - 16usize];
    ["Offset of field: BNDataVariableAndName::autoDiscovered"]
        [::std::mem::offset_of!(BNDataVariableAndName, autoDiscovered) - 24usize];
    ["Offset of field: BNDataVariableAndName::typeConfidence"]
        [::std::mem::offset_of!(BNDataVariableAndName, typeConfidence) - 25usize];
};
impl Default for BNDataVariableAndName {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataVariableAndNameAndDebugParser {
    pub address: u64,
    pub type_: *mut BNType,
    pub name: *mut ::std::os::raw::c_char,
    pub parser: *mut ::std::os::raw::c_char,
    pub autoDiscovered: bool,
    pub typeConfidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDataVariableAndNameAndDebugParser"]
        [::std::mem::size_of::<BNDataVariableAndNameAndDebugParser>() - 40usize];
    ["Alignment of BNDataVariableAndNameAndDebugParser"]
        [::std::mem::align_of::<BNDataVariableAndNameAndDebugParser>() - 8usize];
    ["Offset of field: BNDataVariableAndNameAndDebugParser::address"]
        [::std::mem::offset_of!(BNDataVariableAndNameAndDebugParser, address) - 0usize];
    ["Offset of field: BNDataVariableAndNameAndDebugParser::type_"]
        [::std::mem::offset_of!(BNDataVariableAndNameAndDebugParser, type_) - 8usize];
    ["Offset of field: BNDataVariableAndNameAndDebugParser::name"]
        [::std::mem::offset_of!(BNDataVariableAndNameAndDebugParser, name) - 16usize];
    ["Offset of field: BNDataVariableAndNameAndDebugParser::parser"]
        [::std::mem::offset_of!(BNDataVariableAndNameAndDebugParser, parser) - 24usize];
    ["Offset of field: BNDataVariableAndNameAndDebugParser::autoDiscovered"]
        [::std::mem::offset_of!(BNDataVariableAndNameAndDebugParser, autoDiscovered) - 32usize];
    ["Offset of field: BNDataVariableAndNameAndDebugParser::typeConfidence"]
        [::std::mem::offset_of!(BNDataVariableAndNameAndDebugParser, typeConfidence) - 33usize];
};
impl Default for BNDataVariableAndNameAndDebugParser {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNMediumLevelILOperation {
    MLIL_NOP = 0,
    #[doc = " Not valid in SSA form (see MLIL_SET_VAR_SSA)"]
    MLIL_SET_VAR = 1,
    #[doc = " Not valid in SSA form (see MLIL_SET_VAR_FIELD)"]
    MLIL_SET_VAR_FIELD = 2,
    #[doc = " Not valid in SSA form (see MLIL_SET_VAR_SPLIT_SSA)"]
    MLIL_SET_VAR_SPLIT = 3,
    MLIL_ASSERT = 4,
    MLIL_FORCE_VER = 5,
    #[doc = " Not valid in SSA form (see MLIL_LOAD_SSA)"]
    MLIL_LOAD = 6,
    #[doc = " Not valid in SSA form (see MLIL_LOAD_STRUCT_SSA)"]
    MLIL_LOAD_STRUCT = 7,
    #[doc = " Not valid in SSA form (see MLIL_STORE_SSA)"]
    MLIL_STORE = 8,
    #[doc = " Not valid in SSA form (see MLIL_STORE_STRUCT_SSA)"]
    MLIL_STORE_STRUCT = 9,
    #[doc = " Not valid in SSA form (see MLIL_VAR_SSA)"]
    MLIL_VAR = 10,
    #[doc = " Not valid in SSA form (see MLIL_VAR_SSA_FIELD)"]
    MLIL_VAR_FIELD = 11,
    #[doc = " Not valid in SSA form (see MLIL_VAR_SPLIT_SSA)"]
    MLIL_VAR_SPLIT = 12,
    MLIL_ADDRESS_OF = 13,
    MLIL_ADDRESS_OF_FIELD = 14,
    MLIL_CONST = 15,
    MLIL_CONST_DATA = 16,
    MLIL_CONST_PTR = 17,
    MLIL_EXTERN_PTR = 18,
    MLIL_FLOAT_CONST = 19,
    MLIL_IMPORT = 20,
    MLIL_ADD = 21,
    MLIL_ADC = 22,
    MLIL_SUB = 23,
    MLIL_SBB = 24,
    MLIL_AND = 25,
    MLIL_OR = 26,
    MLIL_XOR = 27,
    MLIL_LSL = 28,
    MLIL_LSR = 29,
    MLIL_ASR = 30,
    MLIL_ROL = 31,
    MLIL_RLC = 32,
    MLIL_ROR = 33,
    MLIL_RRC = 34,
    MLIL_MUL = 35,
    MLIL_MULU_DP = 36,
    MLIL_MULS_DP = 37,
    MLIL_DIVU = 38,
    MLIL_DIVU_DP = 39,
    MLIL_DIVS = 40,
    MLIL_DIVS_DP = 41,
    MLIL_MODU = 42,
    MLIL_MODU_DP = 43,
    MLIL_MODS = 44,
    MLIL_MODS_DP = 45,
    MLIL_NEG = 46,
    MLIL_NOT = 47,
    MLIL_SX = 48,
    MLIL_ZX = 49,
    MLIL_LOW_PART = 50,
    MLIL_JUMP = 51,
    MLIL_JUMP_TO = 52,
    #[doc = " Intermediate stages, does not appear in final forms"]
    MLIL_RET_HINT = 53,
    #[doc = " Not valid in SSA form (see MLIL_CALL_SSA)"]
    MLIL_CALL = 54,
    #[doc = " Not valid in SSA form (see MLIL_CALL_UNTYPED_SSA)"]
    MLIL_CALL_UNTYPED = 55,
    #[doc = " Only valid within MLIL_CALL, MLIL_SYSCALL, MLIL_TAILCALL family instructions"]
    MLIL_CALL_OUTPUT = 56,
    #[doc = " Only valid within MLIL_CALL, MLIL_SYSCALL, MLIL_TAILCALL family instructions"]
    MLIL_CALL_PARAM = 57,
    #[doc = " Only valid within the MLIL_CALL_PARAM or MLIL_CALL_PARAM_SSA instructions inside\n untyped call variants"]
    MLIL_SEPARATE_PARAM_LIST = 58,
    #[doc = " Only valid within the MLIL_CALL_PARAM, MLIL_CALL_PARAM_SSA, or\n MLIL_SEPARATE_PARAM_LIST instructions inside untyped call variants"]
    MLIL_SHARED_PARAM_SLOT = 59,
    MLIL_RET = 60,
    MLIL_NORET = 61,
    MLIL_IF = 62,
    MLIL_GOTO = 63,
    MLIL_CMP_E = 64,
    MLIL_CMP_NE = 65,
    MLIL_CMP_SLT = 66,
    MLIL_CMP_ULT = 67,
    MLIL_CMP_SLE = 68,
    MLIL_CMP_ULE = 69,
    MLIL_CMP_SGE = 70,
    MLIL_CMP_UGE = 71,
    MLIL_CMP_SGT = 72,
    MLIL_CMP_UGT = 73,
    MLIL_TEST_BIT = 74,
    MLIL_BOOL_TO_INT = 75,
    MLIL_ADD_OVERFLOW = 76,
    #[doc = " Not valid in SSA form (see MLIL_SYSCALL_SSA)"]
    MLIL_SYSCALL = 77,
    #[doc = " Not valid in SSA form (see MLIL_SYSCALL_UNTYPED_SSA)"]
    MLIL_SYSCALL_UNTYPED = 78,
    #[doc = " Not valid in SSA form (see MLIL_TAILCALL_SSA)"]
    MLIL_TAILCALL = 79,
    #[doc = " Not valid in SSA form (see MLIL_TAILCALL_UNTYPED_SSA)"]
    MLIL_TAILCALL_UNTYPED = 80,
    #[doc = " Not valid in SSA form (see MLIL_INTRINSIC_SSA)"]
    MLIL_INTRINSIC = 81,
    #[doc = " Not valid in SSA from (see MLIL_FREE_VAR_SLOT_SSA)"]
    MLIL_FREE_VAR_SLOT = 82,
    MLIL_BP = 83,
    MLIL_TRAP = 84,
    MLIL_UNDEF = 85,
    MLIL_UNIMPL = 86,
    MLIL_UNIMPL_MEM = 87,
    #[doc = " Floating point"]
    MLIL_FADD = 88,
    #[doc = " Floating point"]
    MLIL_FSUB = 89,
    #[doc = " Floating point"]
    MLIL_FMUL = 90,
    #[doc = " Floating point"]
    MLIL_FDIV = 91,
    #[doc = " Floating point"]
    MLIL_FSQRT = 92,
    #[doc = " Floating point"]
    MLIL_FNEG = 93,
    #[doc = " Floating point"]
    MLIL_FABS = 94,
    #[doc = " Floating point"]
    MLIL_FLOAT_TO_INT = 95,
    #[doc = " Floating point"]
    MLIL_INT_TO_FLOAT = 96,
    #[doc = " Floating point"]
    MLIL_FLOAT_CONV = 97,
    #[doc = " Floating point"]
    MLIL_ROUND_TO_INT = 98,
    #[doc = " Floating point"]
    MLIL_FLOOR = 99,
    #[doc = " Floating point"]
    MLIL_CEIL = 100,
    #[doc = " Floating point"]
    MLIL_FTRUNC = 101,
    #[doc = " Floating point"]
    MLIL_FCMP_E = 102,
    #[doc = " Floating point"]
    MLIL_FCMP_NE = 103,
    #[doc = " Floating point"]
    MLIL_FCMP_LT = 104,
    #[doc = " Floating point"]
    MLIL_FCMP_LE = 105,
    #[doc = " Floating point"]
    MLIL_FCMP_GE = 106,
    #[doc = " Floating point"]
    MLIL_FCMP_GT = 107,
    #[doc = " Floating point"]
    MLIL_FCMP_O = 108,
    #[doc = " Floating point"]
    MLIL_FCMP_UO = 109,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_SET_VAR_SSA = 110,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_SET_VAR_SSA_FIELD = 111,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_SET_VAR_SPLIT_SSA = 112,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_SET_VAR_ALIASED = 113,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_SET_VAR_ALIASED_FIELD = 114,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_VAR_SSA = 115,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_VAR_SSA_FIELD = 116,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_VAR_ALIASED = 117,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_VAR_ALIASED_FIELD = 118,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_VAR_SPLIT_SSA = 119,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_ASSERT_SSA = 120,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_FORCE_VER_SSA = 121,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_CALL_SSA = 122,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_CALL_UNTYPED_SSA = 123,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_SYSCALL_SSA = 124,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_SYSCALL_UNTYPED_SSA = 125,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_TAILCALL_SSA = 126,
    #[doc = " The following instructions are only used in SSA form"]
    MLIL_TAILCALL_UNTYPED_SSA = 127,
    #[doc = " Only valid within the MLIL_CALL_SSA, MLIL_SYSCALL_SSA, MLIL_TAILCALL_SSA, MLIL_INTRINSIC_SSA family\n instructions"]
    MLIL_CALL_PARAM_SSA = 128,
    #[doc = " Only valid within the MLIL_CALL_SSA or MLIL_SYSCALL_SSA, MLIL_TAILCALL_SSA family\n instructions"]
    MLIL_CALL_OUTPUT_SSA = 129,
    #[doc = " Only valid within the MLIL_MEMORY_INTRINSIC_SSA instruction"]
    MLIL_MEMORY_INTRINSIC_OUTPUT_SSA = 130,
    MLIL_LOAD_SSA = 131,
    MLIL_LOAD_STRUCT_SSA = 132,
    MLIL_STORE_SSA = 133,
    MLIL_STORE_STRUCT_SSA = 134,
    MLIL_INTRINSIC_SSA = 135,
    MLIL_MEMORY_INTRINSIC_SSA = 136,
    MLIL_FREE_VAR_SLOT_SSA = 137,
    MLIL_VAR_PHI = 138,
    MLIL_MEM_PHI = 139,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMediumLevelILInstruction {
    pub operation: BNMediumLevelILOperation,
    pub attributes: u32,
    pub sourceOperand: u32,
    pub size: usize,
    pub operands: [u64; 5usize],
    pub address: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNMediumLevelILInstruction"]
        [::std::mem::size_of::<BNMediumLevelILInstruction>() - 72usize];
    ["Alignment of BNMediumLevelILInstruction"]
        [::std::mem::align_of::<BNMediumLevelILInstruction>() - 8usize];
    ["Offset of field: BNMediumLevelILInstruction::operation"]
        [::std::mem::offset_of!(BNMediumLevelILInstruction, operation) - 0usize];
    ["Offset of field: BNMediumLevelILInstruction::attributes"]
        [::std::mem::offset_of!(BNMediumLevelILInstruction, attributes) - 4usize];
    ["Offset of field: BNMediumLevelILInstruction::sourceOperand"]
        [::std::mem::offset_of!(BNMediumLevelILInstruction, sourceOperand) - 8usize];
    ["Offset of field: BNMediumLevelILInstruction::size"]
        [::std::mem::offset_of!(BNMediumLevelILInstruction, size) - 16usize];
    ["Offset of field: BNMediumLevelILInstruction::operands"]
        [::std::mem::offset_of!(BNMediumLevelILInstruction, operands) - 24usize];
    ["Offset of field: BNMediumLevelILInstruction::address"]
        [::std::mem::offset_of!(BNMediumLevelILInstruction, address) - 64usize];
};
impl Default for BNMediumLevelILInstruction {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BNMediumLevelILLabel {
    pub resolved: bool,
    pub ref_: usize,
    pub operand: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNMediumLevelILLabel"][::std::mem::size_of::<BNMediumLevelILLabel>() - 24usize];
    ["Alignment of BNMediumLevelILLabel"][::std::mem::align_of::<BNMediumLevelILLabel>() - 8usize];
    ["Offset of field: BNMediumLevelILLabel::resolved"]
        [::std::mem::offset_of!(BNMediumLevelILLabel, resolved) - 0usize];
    ["Offset of field: BNMediumLevelILLabel::ref_"]
        [::std::mem::offset_of!(BNMediumLevelILLabel, ref_) - 8usize];
    ["Offset of field: BNMediumLevelILLabel::operand"]
        [::std::mem::offset_of!(BNMediumLevelILLabel, operand) - 16usize];
};
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNVariableSourceType {
    StackVariableSourceType = 0,
    RegisterVariableSourceType = 1,
    FlagVariableSourceType = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNVariable {
    pub type_: BNVariableSourceType,
    pub index: u32,
    pub storage: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNVariable"][::std::mem::size_of::<BNVariable>() - 16usize];
    ["Alignment of BNVariable"][::std::mem::align_of::<BNVariable>() - 8usize];
    ["Offset of field: BNVariable::type_"][::std::mem::offset_of!(BNVariable, type_) - 0usize];
    ["Offset of field: BNVariable::index"][::std::mem::offset_of!(BNVariable, index) - 4usize];
    ["Offset of field: BNVariable::storage"][::std::mem::offset_of!(BNVariable, storage) - 8usize];
};
impl Default for BNVariable {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNHighLevelILOperation {
    HLIL_NOP = 0,
    HLIL_BLOCK = 1,
    HLIL_IF = 2,
    HLIL_WHILE = 3,
    HLIL_DO_WHILE = 4,
    HLIL_FOR = 5,
    HLIL_SWITCH = 6,
    HLIL_CASE = 7,
    HLIL_BREAK = 8,
    HLIL_CONTINUE = 9,
    HLIL_JUMP = 10,
    HLIL_RET = 11,
    HLIL_NORET = 12,
    HLIL_GOTO = 13,
    HLIL_LABEL = 14,
    HLIL_VAR_DECLARE = 15,
    HLIL_VAR_INIT = 16,
    HLIL_ASSIGN = 17,
    HLIL_ASSIGN_UNPACK = 18,
    HLIL_FORCE_VER = 19,
    HLIL_ASSERT = 20,
    HLIL_VAR = 21,
    HLIL_STRUCT_FIELD = 22,
    HLIL_ARRAY_INDEX = 23,
    HLIL_SPLIT = 24,
    HLIL_DEREF = 25,
    HLIL_DEREF_FIELD = 26,
    HLIL_ADDRESS_OF = 27,
    HLIL_CONST = 28,
    HLIL_CONST_DATA = 29,
    HLIL_CONST_PTR = 30,
    HLIL_EXTERN_PTR = 31,
    HLIL_FLOAT_CONST = 32,
    HLIL_IMPORT = 33,
    HLIL_ADD = 34,
    HLIL_ADC = 35,
    HLIL_SUB = 36,
    HLIL_SBB = 37,
    HLIL_AND = 38,
    HLIL_OR = 39,
    HLIL_XOR = 40,
    HLIL_LSL = 41,
    HLIL_LSR = 42,
    HLIL_ASR = 43,
    HLIL_ROL = 44,
    HLIL_RLC = 45,
    HLIL_ROR = 46,
    HLIL_RRC = 47,
    HLIL_MUL = 48,
    HLIL_MULU_DP = 49,
    HLIL_MULS_DP = 50,
    HLIL_DIVU = 51,
    HLIL_DIVU_DP = 52,
    HLIL_DIVS = 53,
    HLIL_DIVS_DP = 54,
    HLIL_MODU = 55,
    HLIL_MODU_DP = 56,
    HLIL_MODS = 57,
    HLIL_MODS_DP = 58,
    HLIL_NEG = 59,
    HLIL_NOT = 60,
    HLIL_SX = 61,
    HLIL_ZX = 62,
    HLIL_LOW_PART = 63,
    HLIL_CALL = 64,
    HLIL_CMP_E = 65,
    HLIL_CMP_NE = 66,
    HLIL_CMP_SLT = 67,
    HLIL_CMP_ULT = 68,
    HLIL_CMP_SLE = 69,
    HLIL_CMP_ULE = 70,
    HLIL_CMP_SGE = 71,
    HLIL_CMP_UGE = 72,
    HLIL_CMP_SGT = 73,
    HLIL_CMP_UGT = 74,
    HLIL_TEST_BIT = 75,
    HLIL_BOOL_TO_INT = 76,
    HLIL_ADD_OVERFLOW = 77,
    HLIL_SYSCALL = 78,
    HLIL_TAILCALL = 79,
    HLIL_INTRINSIC = 80,
    HLIL_BP = 81,
    HLIL_TRAP = 82,
    HLIL_UNDEF = 83,
    HLIL_UNIMPL = 84,
    HLIL_UNIMPL_MEM = 85,
    #[doc = " Floating point"]
    HLIL_FADD = 86,
    #[doc = " Floating point"]
    HLIL_FSUB = 87,
    #[doc = " Floating point"]
    HLIL_FMUL = 88,
    #[doc = " Floating point"]
    HLIL_FDIV = 89,
    #[doc = " Floating point"]
    HLIL_FSQRT = 90,
    #[doc = " Floating point"]
    HLIL_FNEG = 91,
    #[doc = " Floating point"]
    HLIL_FABS = 92,
    #[doc = " Floating point"]
    HLIL_FLOAT_TO_INT = 93,
    #[doc = " Floating point"]
    HLIL_INT_TO_FLOAT = 94,
    #[doc = " Floating point"]
    HLIL_FLOAT_CONV = 95,
    #[doc = " Floating point"]
    HLIL_ROUND_TO_INT = 96,
    #[doc = " Floating point"]
    HLIL_FLOOR = 97,
    #[doc = " Floating point"]
    HLIL_CEIL = 98,
    #[doc = " Floating point"]
    HLIL_FTRUNC = 99,
    #[doc = " Floating point"]
    HLIL_FCMP_E = 100,
    #[doc = " Floating point"]
    HLIL_FCMP_NE = 101,
    #[doc = " Floating point"]
    HLIL_FCMP_LT = 102,
    #[doc = " Floating point"]
    HLIL_FCMP_LE = 103,
    #[doc = " Floating point"]
    HLIL_FCMP_GE = 104,
    #[doc = " Floating point"]
    HLIL_FCMP_GT = 105,
    #[doc = " Floating point"]
    HLIL_FCMP_O = 106,
    #[doc = " Floating point"]
    HLIL_FCMP_UO = 107,
    #[doc = " Unreachable hint, typically used in switch statements that analysis knows\n has an unreachable default."]
    HLIL_UNREACHABLE = 108,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_WHILE_SSA = 109,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_DO_WHILE_SSA = 110,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_FOR_SSA = 111,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_VAR_INIT_SSA = 112,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_ASSIGN_MEM_SSA = 113,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_ASSIGN_UNPACK_MEM_SSA = 114,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_FORCE_VER_SSA = 115,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_ASSERT_SSA = 116,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_VAR_SSA = 117,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_ARRAY_INDEX_SSA = 118,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_DEREF_SSA = 119,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_DEREF_FIELD_SSA = 120,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_CALL_SSA = 121,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_SYSCALL_SSA = 122,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_INTRINSIC_SSA = 123,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_VAR_PHI = 124,
    #[doc = " The following instructions are only used in SSA form"]
    HLIL_MEM_PHI = 125,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNHighLevelILInstruction {
    pub operation: BNHighLevelILOperation,
    pub attributes: u32,
    pub sourceOperand: u32,
    pub size: usize,
    pub operands: [u64; 5usize],
    pub address: u64,
    pub parent: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNHighLevelILInstruction"]
        [::std::mem::size_of::<BNHighLevelILInstruction>() - 80usize];
    ["Alignment of BNHighLevelILInstruction"]
        [::std::mem::align_of::<BNHighLevelILInstruction>() - 8usize];
    ["Offset of field: BNHighLevelILInstruction::operation"]
        [::std::mem::offset_of!(BNHighLevelILInstruction, operation) - 0usize];
    ["Offset of field: BNHighLevelILInstruction::attributes"]
        [::std::mem::offset_of!(BNHighLevelILInstruction, attributes) - 4usize];
    ["Offset of field: BNHighLevelILInstruction::sourceOperand"]
        [::std::mem::offset_of!(BNHighLevelILInstruction, sourceOperand) - 8usize];
    ["Offset of field: BNHighLevelILInstruction::size"]
        [::std::mem::offset_of!(BNHighLevelILInstruction, size) - 16usize];
    ["Offset of field: BNHighLevelILInstruction::operands"]
        [::std::mem::offset_of!(BNHighLevelILInstruction, operands) - 24usize];
    ["Offset of field: BNHighLevelILInstruction::address"]
        [::std::mem::offset_of!(BNHighLevelILInstruction, address) - 64usize];
    ["Offset of field: BNHighLevelILInstruction::parent"]
        [::std::mem::offset_of!(BNHighLevelILInstruction, parent) - 72usize];
};
impl Default for BNHighLevelILInstruction {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Callbacks"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLogListener {
    pub context: *mut ::std::os::raw::c_void,
    pub log: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            sessionId: usize,
            level: BNLogLevel,
            msg: *const ::std::os::raw::c_char,
            logger_name: *const ::std::os::raw::c_char,
            tid: usize,
        ),
    >,
    pub logWithStackTrace: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            sessionId: usize,
            level: BNLogLevel,
            stackTrace: *const ::std::os::raw::c_char,
            msg: *const ::std::os::raw::c_char,
            logger_name: *const ::std::os::raw::c_char,
            tid: usize,
        ),
    >,
    pub close: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub getLogLevel: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNLogLevel,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNLogListener"][::std::mem::size_of::<BNLogListener>() - 40usize];
    ["Alignment of BNLogListener"][::std::mem::align_of::<BNLogListener>() - 8usize];
    ["Offset of field: BNLogListener::context"]
        [::std::mem::offset_of!(BNLogListener, context) - 0usize];
    ["Offset of field: BNLogListener::log"][::std::mem::offset_of!(BNLogListener, log) - 8usize];
    ["Offset of field: BNLogListener::logWithStackTrace"]
        [::std::mem::offset_of!(BNLogListener, logWithStackTrace) - 16usize];
    ["Offset of field: BNLogListener::close"]
        [::std::mem::offset_of!(BNLogListener, close) - 24usize];
    ["Offset of field: BNLogListener::getLogLevel"]
        [::std::mem::offset_of!(BNLogListener, getLogLevel) - 32usize];
};
impl Default for BNLogListener {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNavigationHandler {
    pub context: *mut ::std::os::raw::c_void,
    pub getCurrentView: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_char,
    >,
    pub getCurrentOffset:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub navigate: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *const ::std::os::raw::c_char,
            offset: u64,
        ) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNNavigationHandler"][::std::mem::size_of::<BNNavigationHandler>() - 32usize];
    ["Alignment of BNNavigationHandler"][::std::mem::align_of::<BNNavigationHandler>() - 8usize];
    ["Offset of field: BNNavigationHandler::context"]
        [::std::mem::offset_of!(BNNavigationHandler, context) - 0usize];
    ["Offset of field: BNNavigationHandler::getCurrentView"]
        [::std::mem::offset_of!(BNNavigationHandler, getCurrentView) - 8usize];
    ["Offset of field: BNNavigationHandler::getCurrentOffset"]
        [::std::mem::offset_of!(BNNavigationHandler, getCurrentOffset) - 16usize];
    ["Offset of field: BNNavigationHandler::navigate"]
        [::std::mem::offset_of!(BNNavigationHandler, navigate) - 24usize];
};
impl Default for BNNavigationHandler {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNameSpace {
    pub name: *mut *mut ::std::os::raw::c_char,
    pub join: *mut ::std::os::raw::c_char,
    pub nameCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNNameSpace"][::std::mem::size_of::<BNNameSpace>() - 24usize];
    ["Alignment of BNNameSpace"][::std::mem::align_of::<BNNameSpace>() - 8usize];
    ["Offset of field: BNNameSpace::name"][::std::mem::offset_of!(BNNameSpace, name) - 0usize];
    ["Offset of field: BNNameSpace::join"][::std::mem::offset_of!(BNNameSpace, join) - 8usize];
    ["Offset of field: BNNameSpace::nameCount"]
        [::std::mem::offset_of!(BNNameSpace, nameCount) - 16usize];
};
impl Default for BNNameSpace {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNQualifiedName {
    pub name: *mut *mut ::std::os::raw::c_char,
    pub join: *mut ::std::os::raw::c_char,
    pub nameCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNQualifiedName"][::std::mem::size_of::<BNQualifiedName>() - 24usize];
    ["Alignment of BNQualifiedName"][::std::mem::align_of::<BNQualifiedName>() - 8usize];
    ["Offset of field: BNQualifiedName::name"]
        [::std::mem::offset_of!(BNQualifiedName, name) - 0usize];
    ["Offset of field: BNQualifiedName::join"]
        [::std::mem::offset_of!(BNQualifiedName, join) - 8usize];
    ["Offset of field: BNQualifiedName::nameCount"]
        [::std::mem::offset_of!(BNQualifiedName, nameCount) - 16usize];
};
impl Default for BNQualifiedName {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNDerivedStringLocationType {
    DataBackedStringLocation = 0,
    CodeStringLocation = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDerivedStringLocation {
    pub locationType: BNDerivedStringLocationType,
    pub addr: u64,
    pub len: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDerivedStringLocation"][::std::mem::size_of::<BNDerivedStringLocation>() - 24usize];
    ["Alignment of BNDerivedStringLocation"]
        [::std::mem::align_of::<BNDerivedStringLocation>() - 8usize];
    ["Offset of field: BNDerivedStringLocation::locationType"]
        [::std::mem::offset_of!(BNDerivedStringLocation, locationType) - 0usize];
    ["Offset of field: BNDerivedStringLocation::addr"]
        [::std::mem::offset_of!(BNDerivedStringLocation, addr) - 8usize];
    ["Offset of field: BNDerivedStringLocation::len"]
        [::std::mem::offset_of!(BNDerivedStringLocation, len) - 16usize];
};
impl Default for BNDerivedStringLocation {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDerivedString {
    pub value: *mut BNStringRef,
    pub locationValid: bool,
    pub location: BNDerivedStringLocation,
    pub customType: *mut BNCustomStringType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDerivedString"][::std::mem::size_of::<BNDerivedString>() - 48usize];
    ["Alignment of BNDerivedString"][::std::mem::align_of::<BNDerivedString>() - 8usize];
    ["Offset of field: BNDerivedString::value"]
        [::std::mem::offset_of!(BNDerivedString, value) - 0usize];
    ["Offset of field: BNDerivedString::locationValid"]
        [::std::mem::offset_of!(BNDerivedString, locationValid) - 8usize];
    ["Offset of field: BNDerivedString::location"]
        [::std::mem::offset_of!(BNDerivedString, location) - 16usize];
    ["Offset of field: BNDerivedString::customType"]
        [::std::mem::offset_of!(BNDerivedString, customType) - 40usize];
};
impl Default for BNDerivedString {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryDataNotification {
    pub context: *mut ::std::os::raw::c_void,
    pub notificationBarrier: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNBinaryView) -> u64,
    >,
    pub dataWritten: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: usize,
        ),
    >,
    pub dataInserted: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: usize,
        ),
    >,
    pub dataRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: u64,
        ),
    >,
    pub functionAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionUpdateRequested: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub dataVariableAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataVariableRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataVariableUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataMetadataUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
        ),
    >,
    pub tagTypeUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagType: *mut BNTagType,
        ),
    >,
    pub tagAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub tagRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub tagUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub symbolAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub symbolRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub symbolUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub stringFound: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            type_: BNStringType,
            offset: u64,
            len: usize,
        ),
    >,
    pub stringRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            type_: BNStringType,
            offset: u64,
            len: usize,
        ),
    >,
    pub derivedStringFound: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            str_: *mut BNDerivedString,
        ),
    >,
    pub derivedStringRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            str_: *mut BNDerivedString,
        ),
    >,
    pub typeDefined: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            type_: *mut BNType,
        ),
    >,
    pub typeUndefined: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            type_: *mut BNType,
        ),
    >,
    pub typeReferenceChanged: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            type_: *mut BNType,
        ),
    >,
    pub typeFieldReferenceChanged: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            offset: u64,
        ),
    >,
    pub segmentAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            segment: *mut BNSegment,
        ),
    >,
    pub segmentRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            segment: *mut BNSegment,
        ),
    >,
    pub segmentUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            segment: *mut BNSegment,
        ),
    >,
    pub sectionAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            section: *mut BNSection,
        ),
    >,
    pub sectionRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            section: *mut BNSection,
        ),
    >,
    pub sectionUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            section: *mut BNSection,
        ),
    >,
    pub componentNameUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            previousName: *mut ::std::os::raw::c_char,
            component: *mut BNComponent,
        ),
    >,
    pub componentAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
        ),
    >,
    pub componentMoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            formerParent: *mut BNComponent,
            newParent: *mut BNComponent,
            component: *mut BNComponent,
        ),
    >,
    pub componentRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            formerParent: *mut BNComponent,
            component: *mut BNComponent,
        ),
    >,
    pub componentFunctionAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
            function: *mut BNFunction,
        ),
    >,
    pub componentFunctionRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
            function: *mut BNFunction,
        ),
    >,
    pub componentDataVariableAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
            var: *mut BNDataVariable,
        ),
    >,
    pub componentDataVariableRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
            var: *mut BNDataVariable,
        ),
    >,
    pub externalLibraryAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
            library: *mut BNExternalLibrary,
        ),
    >,
    pub externalLibraryUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
            library: *mut BNExternalLibrary,
        ),
    >,
    pub externalLibraryRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
            library: *mut BNExternalLibrary,
        ),
    >,
    pub externalLocationAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
            location: *mut BNExternalLocation,
        ),
    >,
    pub externalLocationUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
            location: *mut BNExternalLocation,
        ),
    >,
    pub externalLocationRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
            location: *mut BNExternalLocation,
        ),
    >,
    pub typeArchiveAttached: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            id: *const ::std::os::raw::c_char,
            path: *const ::std::os::raw::c_char,
        ),
    >,
    pub typeArchiveDetached: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            id: *const ::std::os::raw::c_char,
            path: *const ::std::os::raw::c_char,
        ),
    >,
    pub typeArchiveConnected: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            archive: *mut BNTypeArchive,
        ),
    >,
    pub typeArchiveDisconnected: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            archive: *mut BNTypeArchive,
        ),
    >,
    pub undoEntryAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            entry: *mut BNUndoEntry,
        ),
    >,
    pub undoEntryTaken: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            entry: *mut BNUndoEntry,
        ),
    >,
    pub redoEntryTaken: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            entry: *mut BNUndoEntry,
        ),
    >,
    pub rebased: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            oldView: *mut BNBinaryView,
            newView: *mut BNBinaryView,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNBinaryDataNotification"]
        [::std::mem::size_of::<BNBinaryDataNotification>() - 448usize];
    ["Alignment of BNBinaryDataNotification"]
        [::std::mem::align_of::<BNBinaryDataNotification>() - 8usize];
    ["Offset of field: BNBinaryDataNotification::context"]
        [::std::mem::offset_of!(BNBinaryDataNotification, context) - 0usize];
    ["Offset of field: BNBinaryDataNotification::notificationBarrier"]
        [::std::mem::offset_of!(BNBinaryDataNotification, notificationBarrier) - 8usize];
    ["Offset of field: BNBinaryDataNotification::dataWritten"]
        [::std::mem::offset_of!(BNBinaryDataNotification, dataWritten) - 16usize];
    ["Offset of field: BNBinaryDataNotification::dataInserted"]
        [::std::mem::offset_of!(BNBinaryDataNotification, dataInserted) - 24usize];
    ["Offset of field: BNBinaryDataNotification::dataRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, dataRemoved) - 32usize];
    ["Offset of field: BNBinaryDataNotification::functionAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, functionAdded) - 40usize];
    ["Offset of field: BNBinaryDataNotification::functionRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, functionRemoved) - 48usize];
    ["Offset of field: BNBinaryDataNotification::functionUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, functionUpdated) - 56usize];
    ["Offset of field: BNBinaryDataNotification::functionUpdateRequested"]
        [::std::mem::offset_of!(BNBinaryDataNotification, functionUpdateRequested) - 64usize];
    ["Offset of field: BNBinaryDataNotification::dataVariableAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, dataVariableAdded) - 72usize];
    ["Offset of field: BNBinaryDataNotification::dataVariableRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, dataVariableRemoved) - 80usize];
    ["Offset of field: BNBinaryDataNotification::dataVariableUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, dataVariableUpdated) - 88usize];
    ["Offset of field: BNBinaryDataNotification::dataMetadataUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, dataMetadataUpdated) - 96usize];
    ["Offset of field: BNBinaryDataNotification::tagTypeUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, tagTypeUpdated) - 104usize];
    ["Offset of field: BNBinaryDataNotification::tagAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, tagAdded) - 112usize];
    ["Offset of field: BNBinaryDataNotification::tagRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, tagRemoved) - 120usize];
    ["Offset of field: BNBinaryDataNotification::tagUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, tagUpdated) - 128usize];
    ["Offset of field: BNBinaryDataNotification::symbolAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, symbolAdded) - 136usize];
    ["Offset of field: BNBinaryDataNotification::symbolRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, symbolRemoved) - 144usize];
    ["Offset of field: BNBinaryDataNotification::symbolUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, symbolUpdated) - 152usize];
    ["Offset of field: BNBinaryDataNotification::stringFound"]
        [::std::mem::offset_of!(BNBinaryDataNotification, stringFound) - 160usize];
    ["Offset of field: BNBinaryDataNotification::stringRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, stringRemoved) - 168usize];
    ["Offset of field: BNBinaryDataNotification::derivedStringFound"]
        [::std::mem::offset_of!(BNBinaryDataNotification, derivedStringFound) - 176usize];
    ["Offset of field: BNBinaryDataNotification::derivedStringRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, derivedStringRemoved) - 184usize];
    ["Offset of field: BNBinaryDataNotification::typeDefined"]
        [::std::mem::offset_of!(BNBinaryDataNotification, typeDefined) - 192usize];
    ["Offset of field: BNBinaryDataNotification::typeUndefined"]
        [::std::mem::offset_of!(BNBinaryDataNotification, typeUndefined) - 200usize];
    ["Offset of field: BNBinaryDataNotification::typeReferenceChanged"]
        [::std::mem::offset_of!(BNBinaryDataNotification, typeReferenceChanged) - 208usize];
    ["Offset of field: BNBinaryDataNotification::typeFieldReferenceChanged"]
        [::std::mem::offset_of!(BNBinaryDataNotification, typeFieldReferenceChanged) - 216usize];
    ["Offset of field: BNBinaryDataNotification::segmentAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, segmentAdded) - 224usize];
    ["Offset of field: BNBinaryDataNotification::segmentRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, segmentRemoved) - 232usize];
    ["Offset of field: BNBinaryDataNotification::segmentUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, segmentUpdated) - 240usize];
    ["Offset of field: BNBinaryDataNotification::sectionAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, sectionAdded) - 248usize];
    ["Offset of field: BNBinaryDataNotification::sectionRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, sectionRemoved) - 256usize];
    ["Offset of field: BNBinaryDataNotification::sectionUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, sectionUpdated) - 264usize];
    ["Offset of field: BNBinaryDataNotification::componentNameUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, componentNameUpdated) - 272usize];
    ["Offset of field: BNBinaryDataNotification::componentAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, componentAdded) - 280usize];
    ["Offset of field: BNBinaryDataNotification::componentMoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, componentMoved) - 288usize];
    ["Offset of field: BNBinaryDataNotification::componentRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, componentRemoved) - 296usize];
    ["Offset of field: BNBinaryDataNotification::componentFunctionAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, componentFunctionAdded) - 304usize];
    ["Offset of field: BNBinaryDataNotification::componentFunctionRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, componentFunctionRemoved) - 312usize];
    ["Offset of field: BNBinaryDataNotification::componentDataVariableAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, componentDataVariableAdded) - 320usize];
    ["Offset of field: BNBinaryDataNotification::componentDataVariableRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, componentDataVariableRemoved) - 328usize];
    ["Offset of field: BNBinaryDataNotification::externalLibraryAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, externalLibraryAdded) - 336usize];
    ["Offset of field: BNBinaryDataNotification::externalLibraryUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, externalLibraryUpdated) - 344usize];
    ["Offset of field: BNBinaryDataNotification::externalLibraryRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, externalLibraryRemoved) - 352usize];
    ["Offset of field: BNBinaryDataNotification::externalLocationAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, externalLocationAdded) - 360usize];
    ["Offset of field: BNBinaryDataNotification::externalLocationUpdated"]
        [::std::mem::offset_of!(BNBinaryDataNotification, externalLocationUpdated) - 368usize];
    ["Offset of field: BNBinaryDataNotification::externalLocationRemoved"]
        [::std::mem::offset_of!(BNBinaryDataNotification, externalLocationRemoved) - 376usize];
    ["Offset of field: BNBinaryDataNotification::typeArchiveAttached"]
        [::std::mem::offset_of!(BNBinaryDataNotification, typeArchiveAttached) - 384usize];
    ["Offset of field: BNBinaryDataNotification::typeArchiveDetached"]
        [::std::mem::offset_of!(BNBinaryDataNotification, typeArchiveDetached) - 392usize];
    ["Offset of field: BNBinaryDataNotification::typeArchiveConnected"]
        [::std::mem::offset_of!(BNBinaryDataNotification, typeArchiveConnected) - 400usize];
    ["Offset of field: BNBinaryDataNotification::typeArchiveDisconnected"]
        [::std::mem::offset_of!(BNBinaryDataNotification, typeArchiveDisconnected) - 408usize];
    ["Offset of field: BNBinaryDataNotification::undoEntryAdded"]
        [::std::mem::offset_of!(BNBinaryDataNotification, undoEntryAdded) - 416usize];
    ["Offset of field: BNBinaryDataNotification::undoEntryTaken"]
        [::std::mem::offset_of!(BNBinaryDataNotification, undoEntryTaken) - 424usize];
    ["Offset of field: BNBinaryDataNotification::redoEntryTaken"]
        [::std::mem::offset_of!(BNBinaryDataNotification, redoEntryTaken) - 432usize];
    ["Offset of field: BNBinaryDataNotification::rebased"]
        [::std::mem::offset_of!(BNBinaryDataNotification, rebased) - 440usize];
};
impl Default for BNBinaryDataNotification {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNProjectNotification {
    pub context: *mut ::std::os::raw::c_void,
    pub beforeOpenProject: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, project: *mut BNProject) -> bool,
    >,
    pub afterOpenProject: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, project: *mut BNProject),
    >,
    pub beforeCloseProject: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, project: *mut BNProject) -> bool,
    >,
    pub afterCloseProject: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, project: *mut BNProject),
    >,
    pub beforeProjectMetadataWritten: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            key: *mut ::std::os::raw::c_char,
            value: *mut BNMetadata,
        ) -> bool,
    >,
    pub afterProjectMetadataWritten: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            key: *mut ::std::os::raw::c_char,
            value: *mut BNMetadata,
        ),
    >,
    pub beforeProjectFileCreated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFile: *mut BNProjectFile,
        ) -> bool,
    >,
    pub afterProjectFileCreated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFile: *mut BNProjectFile,
        ),
    >,
    pub beforeProjectFileUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFile: *mut BNProjectFile,
        ) -> bool,
    >,
    pub afterProjectFileUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFile: *mut BNProjectFile,
        ),
    >,
    pub beforeProjectFileDeleted: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFile: *mut BNProjectFile,
        ) -> bool,
    >,
    pub afterProjectFileDeleted: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFile: *mut BNProjectFile,
        ),
    >,
    pub beforeProjectFolderCreated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFolder: *mut BNProjectFolder,
        ) -> bool,
    >,
    pub afterProjectFolderCreated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFolder: *mut BNProjectFolder,
        ),
    >,
    pub beforeProjectFolderUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFolder: *mut BNProjectFolder,
        ) -> bool,
    >,
    pub afterProjectFolderUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFolder: *mut BNProjectFolder,
        ),
    >,
    pub beforeProjectFolderDeleted: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFolder: *mut BNProjectFolder,
        ) -> bool,
    >,
    pub afterProjectFolderDeleted: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            project: *mut BNProject,
            projectFolder: *mut BNProjectFolder,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNProjectNotification"][::std::mem::size_of::<BNProjectNotification>() - 152usize];
    ["Alignment of BNProjectNotification"]
        [::std::mem::align_of::<BNProjectNotification>() - 8usize];
    ["Offset of field: BNProjectNotification::context"]
        [::std::mem::offset_of!(BNProjectNotification, context) - 0usize];
    ["Offset of field: BNProjectNotification::beforeOpenProject"]
        [::std::mem::offset_of!(BNProjectNotification, beforeOpenProject) - 8usize];
    ["Offset of field: BNProjectNotification::afterOpenProject"]
        [::std::mem::offset_of!(BNProjectNotification, afterOpenProject) - 16usize];
    ["Offset of field: BNProjectNotification::beforeCloseProject"]
        [::std::mem::offset_of!(BNProjectNotification, beforeCloseProject) - 24usize];
    ["Offset of field: BNProjectNotification::afterCloseProject"]
        [::std::mem::offset_of!(BNProjectNotification, afterCloseProject) - 32usize];
    ["Offset of field: BNProjectNotification::beforeProjectMetadataWritten"]
        [::std::mem::offset_of!(BNProjectNotification, beforeProjectMetadataWritten) - 40usize];
    ["Offset of field: BNProjectNotification::afterProjectMetadataWritten"]
        [::std::mem::offset_of!(BNProjectNotification, afterProjectMetadataWritten) - 48usize];
    ["Offset of field: BNProjectNotification::beforeProjectFileCreated"]
        [::std::mem::offset_of!(BNProjectNotification, beforeProjectFileCreated) - 56usize];
    ["Offset of field: BNProjectNotification::afterProjectFileCreated"]
        [::std::mem::offset_of!(BNProjectNotification, afterProjectFileCreated) - 64usize];
    ["Offset of field: BNProjectNotification::beforeProjectFileUpdated"]
        [::std::mem::offset_of!(BNProjectNotification, beforeProjectFileUpdated) - 72usize];
    ["Offset of field: BNProjectNotification::afterProjectFileUpdated"]
        [::std::mem::offset_of!(BNProjectNotification, afterProjectFileUpdated) - 80usize];
    ["Offset of field: BNProjectNotification::beforeProjectFileDeleted"]
        [::std::mem::offset_of!(BNProjectNotification, beforeProjectFileDeleted) - 88usize];
    ["Offset of field: BNProjectNotification::afterProjectFileDeleted"]
        [::std::mem::offset_of!(BNProjectNotification, afterProjectFileDeleted) - 96usize];
    ["Offset of field: BNProjectNotification::beforeProjectFolderCreated"]
        [::std::mem::offset_of!(BNProjectNotification, beforeProjectFolderCreated) - 104usize];
    ["Offset of field: BNProjectNotification::afterProjectFolderCreated"]
        [::std::mem::offset_of!(BNProjectNotification, afterProjectFolderCreated) - 112usize];
    ["Offset of field: BNProjectNotification::beforeProjectFolderUpdated"]
        [::std::mem::offset_of!(BNProjectNotification, beforeProjectFolderUpdated) - 120usize];
    ["Offset of field: BNProjectNotification::afterProjectFolderUpdated"]
        [::std::mem::offset_of!(BNProjectNotification, afterProjectFolderUpdated) - 128usize];
    ["Offset of field: BNProjectNotification::beforeProjectFolderDeleted"]
        [::std::mem::offset_of!(BNProjectNotification, beforeProjectFolderDeleted) - 136usize];
    ["Offset of field: BNProjectNotification::afterProjectFolderDeleted"]
        [::std::mem::offset_of!(BNProjectNotification, afterProjectFolderDeleted) - 144usize];
};
impl Default for BNProjectNotification {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFileAccessor {
    pub context: *mut ::std::os::raw::c_void,
    pub getLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            dest: *mut ::std::os::raw::c_void,
            offset: u64,
            len: usize,
        ) -> usize,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: usize,
        ) -> usize,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNFileAccessor"][::std::mem::size_of::<BNFileAccessor>() - 32usize];
    ["Alignment of BNFileAccessor"][::std::mem::align_of::<BNFileAccessor>() - 8usize];
    ["Offset of field: BNFileAccessor::context"]
        [::std::mem::offset_of!(BNFileAccessor, context) - 0usize];
    ["Offset of field: BNFileAccessor::getLength"]
        [::std::mem::offset_of!(BNFileAccessor, getLength) - 8usize];
    ["Offset of field: BNFileAccessor::read"]
        [::std::mem::offset_of!(BNFileAccessor, read) - 16usize];
    ["Offset of field: BNFileAccessor::write"]
        [::std::mem::offset_of!(BNFileAccessor, write) - 24usize];
};
impl Default for BNFileAccessor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomBinaryView {
    pub context: *mut ::std::os::raw::c_void,
    pub init:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub freeObject: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub externalRefTaken:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub externalRefReleased:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            dest: *mut ::std::os::raw::c_void,
            offset: u64,
            len: usize,
        ) -> usize,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: usize,
        ) -> usize,
    >,
    pub insert: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: usize,
        ) -> usize,
    >,
    pub remove: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64, len: u64) -> usize,
    >,
    pub getModification: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
        ) -> BNModificationStatus,
    >,
    pub isValidOffset: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetReadable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetWritable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetExecutable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetBackedByFile: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub getNextValidOffset: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> u64,
    >,
    pub getStart:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub getLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub getEntryPoint:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub isExecutable:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getDefaultEndianness: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNEndianness,
    >,
    pub isRelocatable:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getAddressSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub save: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            accessor: *mut BNFileAccessor,
        ) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNCustomBinaryView"][::std::mem::size_of::<BNCustomBinaryView>() - 192usize];
    ["Alignment of BNCustomBinaryView"][::std::mem::align_of::<BNCustomBinaryView>() - 8usize];
    ["Offset of field: BNCustomBinaryView::context"]
        [::std::mem::offset_of!(BNCustomBinaryView, context) - 0usize];
    ["Offset of field: BNCustomBinaryView::init"]
        [::std::mem::offset_of!(BNCustomBinaryView, init) - 8usize];
    ["Offset of field: BNCustomBinaryView::freeObject"]
        [::std::mem::offset_of!(BNCustomBinaryView, freeObject) - 16usize];
    ["Offset of field: BNCustomBinaryView::externalRefTaken"]
        [::std::mem::offset_of!(BNCustomBinaryView, externalRefTaken) - 24usize];
    ["Offset of field: BNCustomBinaryView::externalRefReleased"]
        [::std::mem::offset_of!(BNCustomBinaryView, externalRefReleased) - 32usize];
    ["Offset of field: BNCustomBinaryView::read"]
        [::std::mem::offset_of!(BNCustomBinaryView, read) - 40usize];
    ["Offset of field: BNCustomBinaryView::write"]
        [::std::mem::offset_of!(BNCustomBinaryView, write) - 48usize];
    ["Offset of field: BNCustomBinaryView::insert"]
        [::std::mem::offset_of!(BNCustomBinaryView, insert) - 56usize];
    ["Offset of field: BNCustomBinaryView::remove"]
        [::std::mem::offset_of!(BNCustomBinaryView, remove) - 64usize];
    ["Offset of field: BNCustomBinaryView::getModification"]
        [::std::mem::offset_of!(BNCustomBinaryView, getModification) - 72usize];
    ["Offset of field: BNCustomBinaryView::isValidOffset"]
        [::std::mem::offset_of!(BNCustomBinaryView, isValidOffset) - 80usize];
    ["Offset of field: BNCustomBinaryView::isOffsetReadable"]
        [::std::mem::offset_of!(BNCustomBinaryView, isOffsetReadable) - 88usize];
    ["Offset of field: BNCustomBinaryView::isOffsetWritable"]
        [::std::mem::offset_of!(BNCustomBinaryView, isOffsetWritable) - 96usize];
    ["Offset of field: BNCustomBinaryView::isOffsetExecutable"]
        [::std::mem::offset_of!(BNCustomBinaryView, isOffsetExecutable) - 104usize];
    ["Offset of field: BNCustomBinaryView::isOffsetBackedByFile"]
        [::std::mem::offset_of!(BNCustomBinaryView, isOffsetBackedByFile) - 112usize];
    ["Offset of field: BNCustomBinaryView::getNextValidOffset"]
        [::std::mem::offset_of!(BNCustomBinaryView, getNextValidOffset) - 120usize];
    ["Offset of field: BNCustomBinaryView::getStart"]
        [::std::mem::offset_of!(BNCustomBinaryView, getStart) - 128usize];
    ["Offset of field: BNCustomBinaryView::getLength"]
        [::std::mem::offset_of!(BNCustomBinaryView, getLength) - 136usize];
    ["Offset of field: BNCustomBinaryView::getEntryPoint"]
        [::std::mem::offset_of!(BNCustomBinaryView, getEntryPoint) - 144usize];
    ["Offset of field: BNCustomBinaryView::isExecutable"]
        [::std::mem::offset_of!(BNCustomBinaryView, isExecutable) - 152usize];
    ["Offset of field: BNCustomBinaryView::getDefaultEndianness"]
        [::std::mem::offset_of!(BNCustomBinaryView, getDefaultEndianness) - 160usize];
    ["Offset of field: BNCustomBinaryView::isRelocatable"]
        [::std::mem::offset_of!(BNCustomBinaryView, isRelocatable) - 168usize];
    ["Offset of field: BNCustomBinaryView::getAddressSize"]
        [::std::mem::offset_of!(BNCustomBinaryView, getAddressSize) - 176usize];
    ["Offset of field: BNCustomBinaryView::save"]
        [::std::mem::offset_of!(BNCustomBinaryView, save) - 184usize];
};
impl Default for BNCustomBinaryView {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomBinaryViewType {
    pub context: *mut ::std::os::raw::c_void,
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNBinaryView,
    >,
    pub parse: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNBinaryView,
    >,
    pub isValidForData: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, data: *mut BNBinaryView) -> bool,
    >,
    pub isDeprecated:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub isForceLoadable:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getLoadSettingsForData: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNSettings,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNCustomBinaryViewType"][::std::mem::size_of::<BNCustomBinaryViewType>() - 56usize];
    ["Alignment of BNCustomBinaryViewType"]
        [::std::mem::align_of::<BNCustomBinaryViewType>() - 8usize];
    ["Offset of field: BNCustomBinaryViewType::context"]
        [::std::mem::offset_of!(BNCustomBinaryViewType, context) - 0usize];
    ["Offset of field: BNCustomBinaryViewType::create"]
        [::std::mem::offset_of!(BNCustomBinaryViewType, create) - 8usize];
    ["Offset of field: BNCustomBinaryViewType::parse"]
        [::std::mem::offset_of!(BNCustomBinaryViewType, parse) - 16usize];
    ["Offset of field: BNCustomBinaryViewType::isValidForData"]
        [::std::mem::offset_of!(BNCustomBinaryViewType, isValidForData) - 24usize];
    ["Offset of field: BNCustomBinaryViewType::isDeprecated"]
        [::std::mem::offset_of!(BNCustomBinaryViewType, isDeprecated) - 32usize];
    ["Offset of field: BNCustomBinaryViewType::isForceLoadable"]
        [::std::mem::offset_of!(BNCustomBinaryViewType, isForceLoadable) - 40usize];
    ["Offset of field: BNCustomBinaryViewType::getLoadSettingsForData"]
        [::std::mem::offset_of!(BNCustomBinaryViewType, getLoadSettingsForData) - 48usize];
};
impl Default for BNCustomBinaryViewType {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransformParameterInfo {
    pub name: *mut ::std::os::raw::c_char,
    pub longName: *mut ::std::os::raw::c_char,
    #[doc = " Variable length if zero"]
    pub fixedLength: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTransformParameterInfo"]
        [::std::mem::size_of::<BNTransformParameterInfo>() - 24usize];
    ["Alignment of BNTransformParameterInfo"]
        [::std::mem::align_of::<BNTransformParameterInfo>() - 8usize];
    ["Offset of field: BNTransformParameterInfo::name"]
        [::std::mem::offset_of!(BNTransformParameterInfo, name) - 0usize];
    ["Offset of field: BNTransformParameterInfo::longName"]
        [::std::mem::offset_of!(BNTransformParameterInfo, longName) - 8usize];
    ["Offset of field: BNTransformParameterInfo::fixedLength"]
        [::std::mem::offset_of!(BNTransformParameterInfo, fixedLength) - 16usize];
};
impl Default for BNTransformParameterInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransformParameter {
    pub name: *const ::std::os::raw::c_char,
    pub value: *mut BNDataBuffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTransformParameter"][::std::mem::size_of::<BNTransformParameter>() - 16usize];
    ["Alignment of BNTransformParameter"][::std::mem::align_of::<BNTransformParameter>() - 8usize];
    ["Offset of field: BNTransformParameter::name"]
        [::std::mem::offset_of!(BNTransformParameter, name) - 0usize];
    ["Offset of field: BNTransformParameter::value"]
        [::std::mem::offset_of!(BNTransformParameter, value) - 8usize];
};
impl Default for BNTransformParameter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomTransform {
    pub context: *mut ::std::os::raw::c_void,
    pub getParameters: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            count: *mut usize,
        ) -> *mut BNTransformParameterInfo,
    >,
    pub freeParameters: ::std::option::Option<
        unsafe extern "C" fn(params: *mut BNTransformParameterInfo, count: usize),
    >,
    pub decode: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            input: *mut BNDataBuffer,
            output: *mut BNDataBuffer,
            params: *mut BNTransformParameter,
            paramCount: usize,
        ) -> bool,
    >,
    pub encode: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            input: *mut BNDataBuffer,
            output: *mut BNDataBuffer,
            params: *mut BNTransformParameter,
            paramCount: usize,
        ) -> bool,
    >,
    pub decodeWithContext: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            context: *mut BNTransformContext,
            params: *mut BNTransformParameter,
            paramCount: usize,
        ) -> bool,
    >,
    pub canDecode: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, input: *mut BNBinaryView) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNCustomTransform"][::std::mem::size_of::<BNCustomTransform>() - 56usize];
    ["Alignment of BNCustomTransform"][::std::mem::align_of::<BNCustomTransform>() - 8usize];
    ["Offset of field: BNCustomTransform::context"]
        [::std::mem::offset_of!(BNCustomTransform, context) - 0usize];
    ["Offset of field: BNCustomTransform::getParameters"]
        [::std::mem::offset_of!(BNCustomTransform, getParameters) - 8usize];
    ["Offset of field: BNCustomTransform::freeParameters"]
        [::std::mem::offset_of!(BNCustomTransform, freeParameters) - 16usize];
    ["Offset of field: BNCustomTransform::decode"]
        [::std::mem::offset_of!(BNCustomTransform, decode) - 24usize];
    ["Offset of field: BNCustomTransform::encode"]
        [::std::mem::offset_of!(BNCustomTransform, encode) - 32usize];
    ["Offset of field: BNCustomTransform::decodeWithContext"]
        [::std::mem::offset_of!(BNCustomTransform, decodeWithContext) - 40usize];
    ["Offset of field: BNCustomTransform::canDecode"]
        [::std::mem::offset_of!(BNCustomTransform, canDecode) - 48usize];
};
impl Default for BNCustomTransform {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionInfo {
    pub length: usize,
    pub branchCount: usize,
    pub archTransitionByTargetAddr: bool,
    pub delaySlots: u8,
    pub branchType: [BNBranchType; 3usize],
    pub branchTarget: [u64; 3usize],
    #[doc = " If null, same architecture as instruction"]
    pub branchArch: [*mut BNArchitecture; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNInstructionInfo"][::std::mem::size_of::<BNInstructionInfo>() - 72usize];
    ["Alignment of BNInstructionInfo"][::std::mem::align_of::<BNInstructionInfo>() - 8usize];
    ["Offset of field: BNInstructionInfo::length"]
        [::std::mem::offset_of!(BNInstructionInfo, length) - 0usize];
    ["Offset of field: BNInstructionInfo::branchCount"]
        [::std::mem::offset_of!(BNInstructionInfo, branchCount) - 8usize];
    ["Offset of field: BNInstructionInfo::archTransitionByTargetAddr"]
        [::std::mem::offset_of!(BNInstructionInfo, archTransitionByTargetAddr) - 16usize];
    ["Offset of field: BNInstructionInfo::delaySlots"]
        [::std::mem::offset_of!(BNInstructionInfo, delaySlots) - 17usize];
    ["Offset of field: BNInstructionInfo::branchType"]
        [::std::mem::offset_of!(BNInstructionInfo, branchType) - 18usize];
    ["Offset of field: BNInstructionInfo::branchTarget"]
        [::std::mem::offset_of!(BNInstructionInfo, branchTarget) - 24usize];
    ["Offset of field: BNInstructionInfo::branchArch"]
        [::std::mem::offset_of!(BNInstructionInfo, branchArch) - 48usize];
};
impl Default for BNInstructionInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNRelocationType {
    ELFGlobalRelocationType = 0,
    ELFCopyRelocationType = 1,
    ELFJumpSlotRelocationType = 2,
    StandardRelocationType = 3,
    IgnoredRelocation = 4,
    UnhandledRelocation = 5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRelocationInfo {
    #[doc = " BinaryNinja Relocation Type"]
    pub type_: BNRelocationType,
    #[doc = " PC Relative or Absolute (subtract address from relocation)"]
    pub pcRelative: bool,
    #[doc = " Relative to start of module (Add module base to relocation)"]
    pub baseRelative: bool,
    #[doc = " Base address for this binary view"]
    pub base: u64,
    #[doc = " Size of the data to be written"]
    pub size: usize,
    #[doc = " After addition/subtraction truncate to"]
    pub truncateSize: usize,
    #[doc = " Base type from relocation entry"]
    pub nativeType: u64,
    #[doc = " Addend value from relocation entry"]
    pub addend: usize,
    #[doc = " Addend should be subtracted"]
    pub hasSign: bool,
    #[doc = " Addend should be read from the BinaryView"]
    pub implicitAddend: bool,
    #[doc = " Relocation entry points to external symbol"]
    pub external: bool,
    #[doc = " Index into symbol table"]
    pub symbolIndex: usize,
    #[doc = " Index into the section table"]
    pub sectionIndex: usize,
    #[doc = " Absolute address or segment offset"]
    pub address: u64,
    #[doc = " Target (set automatically)"]
    pub target: u64,
    #[doc = " This relocation is effecting data not code"]
    pub dataRelocation: bool,
    pub relocationDataCache: [u8; 8usize],
    #[doc = " Link to relocation another related relocation"]
    pub prev: *mut BNRelocationInfo,
    #[doc = " Link to relocation another related relocation"]
    pub next: *mut BNRelocationInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNRelocationInfo"][::std::mem::size_of::<BNRelocationInfo>() - 120usize];
    ["Alignment of BNRelocationInfo"][::std::mem::align_of::<BNRelocationInfo>() - 8usize];
    ["Offset of field: BNRelocationInfo::type_"]
        [::std::mem::offset_of!(BNRelocationInfo, type_) - 0usize];
    ["Offset of field: BNRelocationInfo::pcRelative"]
        [::std::mem::offset_of!(BNRelocationInfo, pcRelative) - 1usize];
    ["Offset of field: BNRelocationInfo::baseRelative"]
        [::std::mem::offset_of!(BNRelocationInfo, baseRelative) - 2usize];
    ["Offset of field: BNRelocationInfo::base"]
        [::std::mem::offset_of!(BNRelocationInfo, base) - 8usize];
    ["Offset of field: BNRelocationInfo::size"]
        [::std::mem::offset_of!(BNRelocationInfo, size) - 16usize];
    ["Offset of field: BNRelocationInfo::truncateSize"]
        [::std::mem::offset_of!(BNRelocationInfo, truncateSize) - 24usize];
    ["Offset of field: BNRelocationInfo::nativeType"]
        [::std::mem::offset_of!(BNRelocationInfo, nativeType) - 32usize];
    ["Offset of field: BNRelocationInfo::addend"]
        [::std::mem::offset_of!(BNRelocationInfo, addend) - 40usize];
    ["Offset of field: BNRelocationInfo::hasSign"]
        [::std::mem::offset_of!(BNRelocationInfo, hasSign) - 48usize];
    ["Offset of field: BNRelocationInfo::implicitAddend"]
        [::std::mem::offset_of!(BNRelocationInfo, implicitAddend) - 49usize];
    ["Offset of field: BNRelocationInfo::external"]
        [::std::mem::offset_of!(BNRelocationInfo, external) - 50usize];
    ["Offset of field: BNRelocationInfo::symbolIndex"]
        [::std::mem::offset_of!(BNRelocationInfo, symbolIndex) - 56usize];
    ["Offset of field: BNRelocationInfo::sectionIndex"]
        [::std::mem::offset_of!(BNRelocationInfo, sectionIndex) - 64usize];
    ["Offset of field: BNRelocationInfo::address"]
        [::std::mem::offset_of!(BNRelocationInfo, address) - 72usize];
    ["Offset of field: BNRelocationInfo::target"]
        [::std::mem::offset_of!(BNRelocationInfo, target) - 80usize];
    ["Offset of field: BNRelocationInfo::dataRelocation"]
        [::std::mem::offset_of!(BNRelocationInfo, dataRelocation) - 88usize];
    ["Offset of field: BNRelocationInfo::relocationDataCache"]
        [::std::mem::offset_of!(BNRelocationInfo, relocationDataCache) - 89usize];
    ["Offset of field: BNRelocationInfo::prev"]
        [::std::mem::offset_of!(BNRelocationInfo, prev) - 104usize];
    ["Offset of field: BNRelocationInfo::next"]
        [::std::mem::offset_of!(BNRelocationInfo, next) - 112usize];
};
impl Default for BNRelocationInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionTextToken {
    pub type_: BNInstructionTextTokenType,
    pub text: *mut ::std::os::raw::c_char,
    pub value: u64,
    pub width: u64,
    pub size: usize,
    pub operand: usize,
    pub context: BNInstructionTextTokenContext,
    pub confidence: u8,
    pub address: u64,
    pub typeNames: *mut *mut ::std::os::raw::c_char,
    pub namesCount: usize,
    pub exprIndex: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNInstructionTextToken"][::std::mem::size_of::<BNInstructionTextToken>() - 88usize];
    ["Alignment of BNInstructionTextToken"]
        [::std::mem::align_of::<BNInstructionTextToken>() - 8usize];
    ["Offset of field: BNInstructionTextToken::type_"]
        [::std::mem::offset_of!(BNInstructionTextToken, type_) - 0usize];
    ["Offset of field: BNInstructionTextToken::text"]
        [::std::mem::offset_of!(BNInstructionTextToken, text) - 8usize];
    ["Offset of field: BNInstructionTextToken::value"]
        [::std::mem::offset_of!(BNInstructionTextToken, value) - 16usize];
    ["Offset of field: BNInstructionTextToken::width"]
        [::std::mem::offset_of!(BNInstructionTextToken, width) - 24usize];
    ["Offset of field: BNInstructionTextToken::size"]
        [::std::mem::offset_of!(BNInstructionTextToken, size) - 32usize];
    ["Offset of field: BNInstructionTextToken::operand"]
        [::std::mem::offset_of!(BNInstructionTextToken, operand) - 40usize];
    ["Offset of field: BNInstructionTextToken::context"]
        [::std::mem::offset_of!(BNInstructionTextToken, context) - 48usize];
    ["Offset of field: BNInstructionTextToken::confidence"]
        [::std::mem::offset_of!(BNInstructionTextToken, confidence) - 49usize];
    ["Offset of field: BNInstructionTextToken::address"]
        [::std::mem::offset_of!(BNInstructionTextToken, address) - 56usize];
    ["Offset of field: BNInstructionTextToken::typeNames"]
        [::std::mem::offset_of!(BNInstructionTextToken, typeNames) - 64usize];
    ["Offset of field: BNInstructionTextToken::namesCount"]
        [::std::mem::offset_of!(BNInstructionTextToken, namesCount) - 72usize];
    ["Offset of field: BNInstructionTextToken::exprIndex"]
        [::std::mem::offset_of!(BNInstructionTextToken, exprIndex) - 80usize];
};
impl Default for BNInstructionTextToken {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionTextLine {
    pub tokens: *mut BNInstructionTextToken,
    pub count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNInstructionTextLine"][::std::mem::size_of::<BNInstructionTextLine>() - 16usize];
    ["Alignment of BNInstructionTextLine"]
        [::std::mem::align_of::<BNInstructionTextLine>() - 8usize];
    ["Offset of field: BNInstructionTextLine::tokens"]
        [::std::mem::offset_of!(BNInstructionTextLine, tokens) - 0usize];
    ["Offset of field: BNInstructionTextLine::count"]
        [::std::mem::offset_of!(BNInstructionTextLine, count) - 8usize];
};
impl Default for BNInstructionTextLine {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTypeDefinitionLineType {
    TypedefLineType = 0,
    StructDefinitionLineType = 1,
    StructFieldLineType = 2,
    StructDefinitionEndLineType = 3,
    EnumDefinitionLineType = 4,
    EnumMemberLineType = 5,
    EnumDefinitionEndLineType = 6,
    PaddingLineType = 7,
    UndefinedXrefLineType = 8,
    CollapsedPaddingLineType = 9,
    EmptyLineType = 10,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeDefinitionLine {
    pub lineType: BNTypeDefinitionLineType,
    pub tokens: *mut BNInstructionTextToken,
    pub count: usize,
    pub type_: *mut BNType,
    pub parentType: *mut BNType,
    pub rootType: *mut BNType,
    pub rootTypeName: *mut ::std::os::raw::c_char,
    pub baseType: *mut BNNamedTypeReference,
    pub baseOffset: u64,
    pub offset: u64,
    pub fieldIndex: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeDefinitionLine"][::std::mem::size_of::<BNTypeDefinitionLine>() - 88usize];
    ["Alignment of BNTypeDefinitionLine"][::std::mem::align_of::<BNTypeDefinitionLine>() - 8usize];
    ["Offset of field: BNTypeDefinitionLine::lineType"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, lineType) - 0usize];
    ["Offset of field: BNTypeDefinitionLine::tokens"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, tokens) - 8usize];
    ["Offset of field: BNTypeDefinitionLine::count"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, count) - 16usize];
    ["Offset of field: BNTypeDefinitionLine::type_"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, type_) - 24usize];
    ["Offset of field: BNTypeDefinitionLine::parentType"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, parentType) - 32usize];
    ["Offset of field: BNTypeDefinitionLine::rootType"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, rootType) - 40usize];
    ["Offset of field: BNTypeDefinitionLine::rootTypeName"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, rootTypeName) - 48usize];
    ["Offset of field: BNTypeDefinitionLine::baseType"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, baseType) - 56usize];
    ["Offset of field: BNTypeDefinitionLine::baseOffset"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, baseOffset) - 64usize];
    ["Offset of field: BNTypeDefinitionLine::offset"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, offset) - 72usize];
    ["Offset of field: BNTypeDefinitionLine::fieldIndex"]
        [::std::mem::offset_of!(BNTypeDefinitionLine, fieldIndex) - 80usize];
};
impl Default for BNTypeDefinitionLine {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlagConditionForSemanticClass {
    pub semanticClass: u32,
    pub condition: BNLowLevelILFlagCondition,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNFlagConditionForSemanticClass"]
        [::std::mem::size_of::<BNFlagConditionForSemanticClass>() - 8usize];
    ["Alignment of BNFlagConditionForSemanticClass"]
        [::std::mem::align_of::<BNFlagConditionForSemanticClass>() - 4usize];
    ["Offset of field: BNFlagConditionForSemanticClass::semanticClass"]
        [::std::mem::offset_of!(BNFlagConditionForSemanticClass, semanticClass) - 0usize];
    ["Offset of field: BNFlagConditionForSemanticClass::condition"]
        [::std::mem::offset_of!(BNFlagConditionForSemanticClass, condition) - 4usize];
};
impl Default for BNFlagConditionForSemanticClass {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNameAndType {
    pub name: *mut ::std::os::raw::c_char,
    pub type_: *mut BNType,
    pub typeConfidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNNameAndType"][::std::mem::size_of::<BNNameAndType>() - 24usize];
    ["Alignment of BNNameAndType"][::std::mem::align_of::<BNNameAndType>() - 8usize];
    ["Offset of field: BNNameAndType::name"][::std::mem::offset_of!(BNNameAndType, name) - 0usize];
    ["Offset of field: BNNameAndType::type_"]
        [::std::mem::offset_of!(BNNameAndType, type_) - 8usize];
    ["Offset of field: BNNameAndType::typeConfidence"]
        [::std::mem::offset_of!(BNNameAndType, typeConfidence) - 16usize];
};
impl Default for BNNameAndType {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeWithConfidence {
    pub type_: *mut BNType,
    pub confidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeWithConfidence"][::std::mem::size_of::<BNTypeWithConfidence>() - 16usize];
    ["Alignment of BNTypeWithConfidence"][::std::mem::align_of::<BNTypeWithConfidence>() - 8usize];
    ["Offset of field: BNTypeWithConfidence::type_"]
        [::std::mem::offset_of!(BNTypeWithConfidence, type_) - 0usize];
    ["Offset of field: BNTypeWithConfidence::confidence"]
        [::std::mem::offset_of!(BNTypeWithConfidence, confidence) - 8usize];
};
impl Default for BNTypeWithConfidence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNFunctionAnalysisSkipOverride {
    DefaultFunctionAnalysisSkip = 0,
    NeverSkipFunctionAnalysis = 1,
    AlwaysSkipFunctionAnalysis = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBasicBlockAnalysisContext {
    pub function: *mut BNFunction,
    #[doc = " IN"]
    pub analysisSkipOverride: BNFunctionAnalysisSkipOverride,
    pub guidedAnalysisMode: bool,
    pub triggerGuidedOnInvalidInstruction: bool,
    pub translateTailCalls: bool,
    pub disallowBranchToString: bool,
    pub maxFunctionSize: u64,
    pub indirectBranchesCount: usize,
    pub indirectBranches: *mut BNIndirectBranchInfo,
    pub indirectNoReturnCallsCount: usize,
    pub indirectNoReturnCalls: *mut BNArchitectureAndAddress,
    #[doc = " OUT; can be set directly"]
    pub maxSizeReached: bool,
    #[doc = " IN *and* OUT"]
    pub contextualFunctionReturnCount: usize,
    pub contextualFunctionReturnLocations: *mut BNArchitectureAndAddress,
    pub contextualFunctionReturnValues: *mut bool,
    #[doc = " OUT"]
    pub directRefCount: usize,
    pub directRefSources: *mut BNArchitectureAndAddress,
    pub directRefTargets: *mut u64,
    pub directNoReturnCallsCount: usize,
    pub directNoReturnCalls: *mut BNArchitectureAndAddress,
    pub haltedDisassemblyAddressesCount: usize,
    pub haltedDisassemblyAddresses: *mut BNArchitectureAndAddress,
    pub inlinedUnresolvedIndirectBranchCount: usize,
    pub inlinedUnresolvedIndirectBranches: *mut BNArchitectureAndAddress,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNBasicBlockAnalysisContext"]
        [::std::mem::size_of::<BNBasicBlockAnalysisContext>() - 160usize];
    ["Alignment of BNBasicBlockAnalysisContext"]
        [::std::mem::align_of::<BNBasicBlockAnalysisContext>() - 8usize];
    ["Offset of field: BNBasicBlockAnalysisContext::function"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, function) - 0usize];
    ["Offset of field: BNBasicBlockAnalysisContext::analysisSkipOverride"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, analysisSkipOverride) - 8usize];
    ["Offset of field: BNBasicBlockAnalysisContext::guidedAnalysisMode"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, guidedAnalysisMode) - 9usize];
    ["Offset of field: BNBasicBlockAnalysisContext::triggerGuidedOnInvalidInstruction"][::std::mem::offset_of!(
        BNBasicBlockAnalysisContext,
        triggerGuidedOnInvalidInstruction
    )
        - 10usize];
    ["Offset of field: BNBasicBlockAnalysisContext::translateTailCalls"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, translateTailCalls) - 11usize];
    ["Offset of field: BNBasicBlockAnalysisContext::disallowBranchToString"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, disallowBranchToString) - 12usize];
    ["Offset of field: BNBasicBlockAnalysisContext::maxFunctionSize"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, maxFunctionSize) - 16usize];
    ["Offset of field: BNBasicBlockAnalysisContext::indirectBranchesCount"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, indirectBranchesCount) - 24usize];
    ["Offset of field: BNBasicBlockAnalysisContext::indirectBranches"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, indirectBranches) - 32usize];
    ["Offset of field: BNBasicBlockAnalysisContext::indirectNoReturnCallsCount"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, indirectNoReturnCallsCount) - 40usize];
    ["Offset of field: BNBasicBlockAnalysisContext::indirectNoReturnCalls"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, indirectNoReturnCalls) - 48usize];
    ["Offset of field: BNBasicBlockAnalysisContext::maxSizeReached"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, maxSizeReached) - 56usize];
    ["Offset of field: BNBasicBlockAnalysisContext::contextualFunctionReturnCount"][::std::mem::offset_of!(
        BNBasicBlockAnalysisContext,
        contextualFunctionReturnCount
    ) - 64usize];
    ["Offset of field: BNBasicBlockAnalysisContext::contextualFunctionReturnLocations"][::std::mem::offset_of!(
        BNBasicBlockAnalysisContext,
        contextualFunctionReturnLocations
    )
        - 72usize];
    ["Offset of field: BNBasicBlockAnalysisContext::contextualFunctionReturnValues"][::std::mem::offset_of!(
        BNBasicBlockAnalysisContext,
        contextualFunctionReturnValues
    ) - 80usize];
    ["Offset of field: BNBasicBlockAnalysisContext::directRefCount"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, directRefCount) - 88usize];
    ["Offset of field: BNBasicBlockAnalysisContext::directRefSources"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, directRefSources) - 96usize];
    ["Offset of field: BNBasicBlockAnalysisContext::directRefTargets"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, directRefTargets) - 104usize];
    ["Offset of field: BNBasicBlockAnalysisContext::directNoReturnCallsCount"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, directNoReturnCallsCount) - 112usize];
    ["Offset of field: BNBasicBlockAnalysisContext::directNoReturnCalls"]
        [::std::mem::offset_of!(BNBasicBlockAnalysisContext, directNoReturnCalls) - 120usize];
    ["Offset of field: BNBasicBlockAnalysisContext::haltedDisassemblyAddressesCount"][::std::mem::offset_of!(
        BNBasicBlockAnalysisContext,
        haltedDisassemblyAddressesCount
    ) - 128usize];
    ["Offset of field: BNBasicBlockAnalysisContext::haltedDisassemblyAddresses"][::std::mem::offset_of!(
        BNBasicBlockAnalysisContext,
        haltedDisassemblyAddresses
    ) - 136usize];
    ["Offset of field: BNBasicBlockAnalysisContext::inlinedUnresolvedIndirectBranchCount"][::std::mem::offset_of!(
        BNBasicBlockAnalysisContext,
        inlinedUnresolvedIndirectBranchCount
    )
        - 144usize];
    ["Offset of field: BNBasicBlockAnalysisContext::inlinedUnresolvedIndirectBranches"][::std::mem::offset_of!(
        BNBasicBlockAnalysisContext,
        inlinedUnresolvedIndirectBranches
    )
        - 152usize];
};
impl Default for BNBasicBlockAnalysisContext {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomArchitecture {
    pub context: *mut ::std::os::raw::c_void,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(context: *mut ::std::os::raw::c_void, obj: *mut BNArchitecture),
    >,
    pub getEndianness: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNEndianness,
    >,
    pub getAddressSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getDefaultIntegerSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getInstructionAlignment:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getMaxInstructionLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getOpcodeDisplayLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getAssociatedArchitectureByAddress: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            addr: *mut u64,
        ) -> *mut BNArchitecture,
    >,
    pub getInstructionInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            maxLen: usize,
            result: *mut BNInstructionInfo,
        ) -> bool,
    >,
    pub getInstructionText: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: *mut usize,
            result: *mut *mut BNInstructionTextToken,
            count: *mut usize,
        ) -> bool,
    >,
    pub freeInstructionText: ::std::option::Option<
        unsafe extern "C" fn(tokens: *mut BNInstructionTextToken, count: usize),
    >,
    pub getInstructionLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: *mut usize,
            il: *mut BNLowLevelILFunction,
        ) -> bool,
    >,
    pub analyzeBasicBlocks: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            function: *mut BNFunction,
            context: *mut BNBasicBlockAnalysisContext,
        ),
    >,
    pub getRegisterName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            reg: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFlagName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flag: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFlagWriteTypeName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flags: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getSemanticFlagClassName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semClass: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getSemanticFlagGroupName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFullWidthRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllFlags: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllFlagWriteTypes: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllSemanticFlagClasses: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllSemanticFlagGroups: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getFlagRole: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flag: u32,
            semClass: u32,
        ) -> BNFlagRole,
    >,
    pub getFlagsRequiredForFlagCondition: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            cond: BNLowLevelILFlagCondition,
            semClass: u32,
            count: *mut usize,
        ) -> *mut u32,
    >,
    pub getFlagsRequiredForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            count: *mut usize,
        ) -> *mut u32,
    >,
    pub getFlagConditionsForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            count: *mut usize,
        ) -> *mut BNFlagConditionForSemanticClass,
    >,
    pub freeFlagConditionsForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            conditions: *mut BNFlagConditionForSemanticClass,
            count: usize,
        ),
    >,
    pub getFlagsWrittenByFlagWriteType: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            writeType: u32,
            count: *mut usize,
        ) -> *mut u32,
    >,
    pub getSemanticClassForFlagWriteType: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, writeType: u32) -> u32,
    >,
    pub getFlagWriteLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            op: BNLowLevelILOperation,
            size: usize,
            flagWriteType: u32,
            flag: u32,
            operands: *mut BNRegisterOrConstant,
            operandCount: usize,
            il: *mut BNLowLevelILFunction,
        ) -> usize,
    >,
    pub getFlagConditionLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            cond: BNLowLevelILFlagCondition,
            semClass: u32,
            il: *mut BNLowLevelILFunction,
        ) -> usize,
    >,
    pub getSemanticFlagGroupLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            il: *mut BNLowLevelILFunction,
        ) -> usize,
    >,
    pub freeRegisterList: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, regs: *mut u32, count: usize),
    >,
    pub getRegisterInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            reg: u32,
            result: *mut BNRegisterInfo,
        ),
    >,
    pub getStackPointerRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getLinkRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getGlobalRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getSystemRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getRegisterStackName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            regStack: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getAllRegisterStacks: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getRegisterStackInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            regStack: u32,
            result: *mut BNRegisterStackInfo,
        ),
    >,
    pub getIntrinsicClass: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, intrinsic: u32) -> BNIntrinsicClass,
    >,
    pub getIntrinsicName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getAllIntrinsics: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getIntrinsicInputs: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
            count: *mut usize,
        ) -> *mut BNNameAndType,
    >,
    pub freeNameAndTypeList: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            nt: *mut BNNameAndType,
            count: usize,
        ),
    >,
    pub getIntrinsicOutputs: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
            count: *mut usize,
        ) -> *mut BNTypeWithConfidence,
    >,
    pub freeTypeList: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            types: *mut BNTypeWithConfidence,
            count: usize,
        ),
    >,
    pub canAssemble:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub assemble: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            code: *const ::std::os::raw::c_char,
            addr: u64,
            result: *mut BNDataBuffer,
            errors: *mut *mut ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub isNeverBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub isAlwaysBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub isInvertBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub isSkipAndReturnZeroPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub isSkipAndReturnValuePatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub convertToNop: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub alwaysBranch: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub invertBranch: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub skipAndReturnValue: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: usize,
            value: u64,
        ) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNCustomArchitecture"][::std::mem::size_of::<BNCustomArchitecture>() - 496usize];
    ["Alignment of BNCustomArchitecture"][::std::mem::align_of::<BNCustomArchitecture>() - 8usize];
    ["Offset of field: BNCustomArchitecture::context"]
        [::std::mem::offset_of!(BNCustomArchitecture, context) - 0usize];
    ["Offset of field: BNCustomArchitecture::init"]
        [::std::mem::offset_of!(BNCustomArchitecture, init) - 8usize];
    ["Offset of field: BNCustomArchitecture::getEndianness"]
        [::std::mem::offset_of!(BNCustomArchitecture, getEndianness) - 16usize];
    ["Offset of field: BNCustomArchitecture::getAddressSize"]
        [::std::mem::offset_of!(BNCustomArchitecture, getAddressSize) - 24usize];
    ["Offset of field: BNCustomArchitecture::getDefaultIntegerSize"]
        [::std::mem::offset_of!(BNCustomArchitecture, getDefaultIntegerSize) - 32usize];
    ["Offset of field: BNCustomArchitecture::getInstructionAlignment"]
        [::std::mem::offset_of!(BNCustomArchitecture, getInstructionAlignment) - 40usize];
    ["Offset of field: BNCustomArchitecture::getMaxInstructionLength"]
        [::std::mem::offset_of!(BNCustomArchitecture, getMaxInstructionLength) - 48usize];
    ["Offset of field: BNCustomArchitecture::getOpcodeDisplayLength"]
        [::std::mem::offset_of!(BNCustomArchitecture, getOpcodeDisplayLength) - 56usize];
    ["Offset of field: BNCustomArchitecture::getAssociatedArchitectureByAddress"][::std::mem::offset_of!(
        BNCustomArchitecture,
        getAssociatedArchitectureByAddress
    ) - 64usize];
    ["Offset of field: BNCustomArchitecture::getInstructionInfo"]
        [::std::mem::offset_of!(BNCustomArchitecture, getInstructionInfo) - 72usize];
    ["Offset of field: BNCustomArchitecture::getInstructionText"]
        [::std::mem::offset_of!(BNCustomArchitecture, getInstructionText) - 80usize];
    ["Offset of field: BNCustomArchitecture::freeInstructionText"]
        [::std::mem::offset_of!(BNCustomArchitecture, freeInstructionText) - 88usize];
    ["Offset of field: BNCustomArchitecture::getInstructionLowLevelIL"]
        [::std::mem::offset_of!(BNCustomArchitecture, getInstructionLowLevelIL) - 96usize];
    ["Offset of field: BNCustomArchitecture::analyzeBasicBlocks"]
        [::std::mem::offset_of!(BNCustomArchitecture, analyzeBasicBlocks) - 104usize];
    ["Offset of field: BNCustomArchitecture::getRegisterName"]
        [::std::mem::offset_of!(BNCustomArchitecture, getRegisterName) - 112usize];
    ["Offset of field: BNCustomArchitecture::getFlagName"]
        [::std::mem::offset_of!(BNCustomArchitecture, getFlagName) - 120usize];
    ["Offset of field: BNCustomArchitecture::getFlagWriteTypeName"]
        [::std::mem::offset_of!(BNCustomArchitecture, getFlagWriteTypeName) - 128usize];
    ["Offset of field: BNCustomArchitecture::getSemanticFlagClassName"]
        [::std::mem::offset_of!(BNCustomArchitecture, getSemanticFlagClassName) - 136usize];
    ["Offset of field: BNCustomArchitecture::getSemanticFlagGroupName"]
        [::std::mem::offset_of!(BNCustomArchitecture, getSemanticFlagGroupName) - 144usize];
    ["Offset of field: BNCustomArchitecture::getFullWidthRegisters"]
        [::std::mem::offset_of!(BNCustomArchitecture, getFullWidthRegisters) - 152usize];
    ["Offset of field: BNCustomArchitecture::getAllRegisters"]
        [::std::mem::offset_of!(BNCustomArchitecture, getAllRegisters) - 160usize];
    ["Offset of field: BNCustomArchitecture::getAllFlags"]
        [::std::mem::offset_of!(BNCustomArchitecture, getAllFlags) - 168usize];
    ["Offset of field: BNCustomArchitecture::getAllFlagWriteTypes"]
        [::std::mem::offset_of!(BNCustomArchitecture, getAllFlagWriteTypes) - 176usize];
    ["Offset of field: BNCustomArchitecture::getAllSemanticFlagClasses"]
        [::std::mem::offset_of!(BNCustomArchitecture, getAllSemanticFlagClasses) - 184usize];
    ["Offset of field: BNCustomArchitecture::getAllSemanticFlagGroups"]
        [::std::mem::offset_of!(BNCustomArchitecture, getAllSemanticFlagGroups) - 192usize];
    ["Offset of field: BNCustomArchitecture::getFlagRole"]
        [::std::mem::offset_of!(BNCustomArchitecture, getFlagRole) - 200usize];
    ["Offset of field: BNCustomArchitecture::getFlagsRequiredForFlagCondition"]
        [::std::mem::offset_of!(BNCustomArchitecture, getFlagsRequiredForFlagCondition) - 208usize];
    ["Offset of field: BNCustomArchitecture::getFlagsRequiredForSemanticFlagGroup"][::std::mem::offset_of!(
        BNCustomArchitecture,
        getFlagsRequiredForSemanticFlagGroup
    ) - 216usize];
    ["Offset of field: BNCustomArchitecture::getFlagConditionsForSemanticFlagGroup"][::std::mem::offset_of!(
        BNCustomArchitecture,
        getFlagConditionsForSemanticFlagGroup
    ) - 224usize];
    ["Offset of field: BNCustomArchitecture::freeFlagConditionsForSemanticFlagGroup"][::std::mem::offset_of!(
        BNCustomArchitecture,
        freeFlagConditionsForSemanticFlagGroup
    ) - 232usize];
    ["Offset of field: BNCustomArchitecture::getFlagsWrittenByFlagWriteType"]
        [::std::mem::offset_of!(BNCustomArchitecture, getFlagsWrittenByFlagWriteType) - 240usize];
    ["Offset of field: BNCustomArchitecture::getSemanticClassForFlagWriteType"]
        [::std::mem::offset_of!(BNCustomArchitecture, getSemanticClassForFlagWriteType) - 248usize];
    ["Offset of field: BNCustomArchitecture::getFlagWriteLowLevelIL"]
        [::std::mem::offset_of!(BNCustomArchitecture, getFlagWriteLowLevelIL) - 256usize];
    ["Offset of field: BNCustomArchitecture::getFlagConditionLowLevelIL"]
        [::std::mem::offset_of!(BNCustomArchitecture, getFlagConditionLowLevelIL) - 264usize];
    ["Offset of field: BNCustomArchitecture::getSemanticFlagGroupLowLevelIL"]
        [::std::mem::offset_of!(BNCustomArchitecture, getSemanticFlagGroupLowLevelIL) - 272usize];
    ["Offset of field: BNCustomArchitecture::freeRegisterList"]
        [::std::mem::offset_of!(BNCustomArchitecture, freeRegisterList) - 280usize];
    ["Offset of field: BNCustomArchitecture::getRegisterInfo"]
        [::std::mem::offset_of!(BNCustomArchitecture, getRegisterInfo) - 288usize];
    ["Offset of field: BNCustomArchitecture::getStackPointerRegister"]
        [::std::mem::offset_of!(BNCustomArchitecture, getStackPointerRegister) - 296usize];
    ["Offset of field: BNCustomArchitecture::getLinkRegister"]
        [::std::mem::offset_of!(BNCustomArchitecture, getLinkRegister) - 304usize];
    ["Offset of field: BNCustomArchitecture::getGlobalRegisters"]
        [::std::mem::offset_of!(BNCustomArchitecture, getGlobalRegisters) - 312usize];
    ["Offset of field: BNCustomArchitecture::getSystemRegisters"]
        [::std::mem::offset_of!(BNCustomArchitecture, getSystemRegisters) - 320usize];
    ["Offset of field: BNCustomArchitecture::getRegisterStackName"]
        [::std::mem::offset_of!(BNCustomArchitecture, getRegisterStackName) - 328usize];
    ["Offset of field: BNCustomArchitecture::getAllRegisterStacks"]
        [::std::mem::offset_of!(BNCustomArchitecture, getAllRegisterStacks) - 336usize];
    ["Offset of field: BNCustomArchitecture::getRegisterStackInfo"]
        [::std::mem::offset_of!(BNCustomArchitecture, getRegisterStackInfo) - 344usize];
    ["Offset of field: BNCustomArchitecture::getIntrinsicClass"]
        [::std::mem::offset_of!(BNCustomArchitecture, getIntrinsicClass) - 352usize];
    ["Offset of field: BNCustomArchitecture::getIntrinsicName"]
        [::std::mem::offset_of!(BNCustomArchitecture, getIntrinsicName) - 360usize];
    ["Offset of field: BNCustomArchitecture::getAllIntrinsics"]
        [::std::mem::offset_of!(BNCustomArchitecture, getAllIntrinsics) - 368usize];
    ["Offset of field: BNCustomArchitecture::getIntrinsicInputs"]
        [::std::mem::offset_of!(BNCustomArchitecture, getIntrinsicInputs) - 376usize];
    ["Offset of field: BNCustomArchitecture::freeNameAndTypeList"]
        [::std::mem::offset_of!(BNCustomArchitecture, freeNameAndTypeList) - 384usize];
    ["Offset of field: BNCustomArchitecture::getIntrinsicOutputs"]
        [::std::mem::offset_of!(BNCustomArchitecture, getIntrinsicOutputs) - 392usize];
    ["Offset of field: BNCustomArchitecture::freeTypeList"]
        [::std::mem::offset_of!(BNCustomArchitecture, freeTypeList) - 400usize];
    ["Offset of field: BNCustomArchitecture::canAssemble"]
        [::std::mem::offset_of!(BNCustomArchitecture, canAssemble) - 408usize];
    ["Offset of field: BNCustomArchitecture::assemble"]
        [::std::mem::offset_of!(BNCustomArchitecture, assemble) - 416usize];
    ["Offset of field: BNCustomArchitecture::isNeverBranchPatchAvailable"]
        [::std::mem::offset_of!(BNCustomArchitecture, isNeverBranchPatchAvailable) - 424usize];
    ["Offset of field: BNCustomArchitecture::isAlwaysBranchPatchAvailable"]
        [::std::mem::offset_of!(BNCustomArchitecture, isAlwaysBranchPatchAvailable) - 432usize];
    ["Offset of field: BNCustomArchitecture::isInvertBranchPatchAvailable"]
        [::std::mem::offset_of!(BNCustomArchitecture, isInvertBranchPatchAvailable) - 440usize];
    ["Offset of field: BNCustomArchitecture::isSkipAndReturnZeroPatchAvailable"][::std::mem::offset_of!(
        BNCustomArchitecture,
        isSkipAndReturnZeroPatchAvailable
    ) - 448usize];
    ["Offset of field: BNCustomArchitecture::isSkipAndReturnValuePatchAvailable"][::std::mem::offset_of!(
        BNCustomArchitecture,
        isSkipAndReturnValuePatchAvailable
    ) - 456usize];
    ["Offset of field: BNCustomArchitecture::convertToNop"]
        [::std::mem::offset_of!(BNCustomArchitecture, convertToNop) - 464usize];
    ["Offset of field: BNCustomArchitecture::alwaysBranch"]
        [::std::mem::offset_of!(BNCustomArchitecture, alwaysBranch) - 472usize];
    ["Offset of field: BNCustomArchitecture::invertBranch"]
        [::std::mem::offset_of!(BNCustomArchitecture, invertBranch) - 480usize];
    ["Offset of field: BNCustomArchitecture::skipAndReturnValue"]
        [::std::mem::offset_of!(BNCustomArchitecture, skipAndReturnValue) - 488usize];
};
impl Default for BNCustomArchitecture {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomPlatform {
    pub context: *mut ::std::os::raw::c_void,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, obj: *mut BNPlatform),
    >,
    pub viewInit: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNBinaryView),
    >,
    pub getGlobalRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub freeRegisterList: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, regs: *mut u32, len: usize),
    >,
    pub getGlobalRegisterType: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, reg: u32) -> *mut BNType,
    >,
    pub getAddressSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub adjustTypeParserInput: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            parser: *mut BNTypeParser,
            argumentsIn: *const *const ::std::os::raw::c_char,
            argumentsLenIn: usize,
            sourceFileNamesIn: *const *const ::std::os::raw::c_char,
            sourceFileValuesIn: *const *const ::std::os::raw::c_char,
            sourceFilesLenIn: usize,
            argumentsOut: *mut *mut *mut ::std::os::raw::c_char,
            argumentsLenOut: *mut usize,
            sourceFileNamesOut: *mut *mut *mut ::std::os::raw::c_char,
            sourceFileValuesOut: *mut *mut *mut ::std::os::raw::c_char,
            sourceFilesLenOut: *mut usize,
        ),
    >,
    pub freeTypeParserInput: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            arguments: *mut *mut ::std::os::raw::c_char,
            argumentsLen: usize,
            sourceFileNames: *mut *mut ::std::os::raw::c_char,
            sourceFileValues: *mut *mut ::std::os::raw::c_char,
            sourceFilesLen: usize,
        ),
    >,
    pub getFallbackEnabled:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNCustomPlatform"][::std::mem::size_of::<BNCustomPlatform>() - 80usize];
    ["Alignment of BNCustomPlatform"][::std::mem::align_of::<BNCustomPlatform>() - 8usize];
    ["Offset of field: BNCustomPlatform::context"]
        [::std::mem::offset_of!(BNCustomPlatform, context) - 0usize];
    ["Offset of field: BNCustomPlatform::init"]
        [::std::mem::offset_of!(BNCustomPlatform, init) - 8usize];
    ["Offset of field: BNCustomPlatform::viewInit"]
        [::std::mem::offset_of!(BNCustomPlatform, viewInit) - 16usize];
    ["Offset of field: BNCustomPlatform::getGlobalRegisters"]
        [::std::mem::offset_of!(BNCustomPlatform, getGlobalRegisters) - 24usize];
    ["Offset of field: BNCustomPlatform::freeRegisterList"]
        [::std::mem::offset_of!(BNCustomPlatform, freeRegisterList) - 32usize];
    ["Offset of field: BNCustomPlatform::getGlobalRegisterType"]
        [::std::mem::offset_of!(BNCustomPlatform, getGlobalRegisterType) - 40usize];
    ["Offset of field: BNCustomPlatform::getAddressSize"]
        [::std::mem::offset_of!(BNCustomPlatform, getAddressSize) - 48usize];
    ["Offset of field: BNCustomPlatform::adjustTypeParserInput"]
        [::std::mem::offset_of!(BNCustomPlatform, adjustTypeParserInput) - 56usize];
    ["Offset of field: BNCustomPlatform::freeTypeParserInput"]
        [::std::mem::offset_of!(BNCustomPlatform, freeTypeParserInput) - 64usize];
    ["Offset of field: BNCustomPlatform::getFallbackEnabled"]
        [::std::mem::offset_of!(BNCustomPlatform, getFallbackEnabled) - 72usize];
};
impl Default for BNCustomPlatform {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBasicBlockEdge {
    pub type_: BNBranchType,
    pub target: *mut BNBasicBlock,
    pub backEdge: bool,
    pub fallThrough: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNBasicBlockEdge"][::std::mem::size_of::<BNBasicBlockEdge>() - 24usize];
    ["Alignment of BNBasicBlockEdge"][::std::mem::align_of::<BNBasicBlockEdge>() - 8usize];
    ["Offset of field: BNBasicBlockEdge::type_"]
        [::std::mem::offset_of!(BNBasicBlockEdge, type_) - 0usize];
    ["Offset of field: BNBasicBlockEdge::target"]
        [::std::mem::offset_of!(BNBasicBlockEdge, target) - 8usize];
    ["Offset of field: BNBasicBlockEdge::backEdge"]
        [::std::mem::offset_of!(BNBasicBlockEdge, backEdge) - 16usize];
    ["Offset of field: BNBasicBlockEdge::fallThrough"]
        [::std::mem::offset_of!(BNBasicBlockEdge, fallThrough) - 17usize];
};
impl Default for BNBasicBlockEdge {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPendingBasicBlockEdge {
    pub type_: BNBranchType,
    pub arch: *mut BNArchitecture,
    pub target: u64,
    pub fallThrough: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNPendingBasicBlockEdge"][::std::mem::size_of::<BNPendingBasicBlockEdge>() - 32usize];
    ["Alignment of BNPendingBasicBlockEdge"]
        [::std::mem::align_of::<BNPendingBasicBlockEdge>() - 8usize];
    ["Offset of field: BNPendingBasicBlockEdge::type_"]
        [::std::mem::offset_of!(BNPendingBasicBlockEdge, type_) - 0usize];
    ["Offset of field: BNPendingBasicBlockEdge::arch"]
        [::std::mem::offset_of!(BNPendingBasicBlockEdge, arch) - 8usize];
    ["Offset of field: BNPendingBasicBlockEdge::target"]
        [::std::mem::offset_of!(BNPendingBasicBlockEdge, target) - 16usize];
    ["Offset of field: BNPendingBasicBlockEdge::fallThrough"]
        [::std::mem::offset_of!(BNPendingBasicBlockEdge, fallThrough) - 24usize];
};
impl Default for BNPendingBasicBlockEdge {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BNPoint {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNPoint"][::std::mem::size_of::<BNPoint>() - 8usize];
    ["Alignment of BNPoint"][::std::mem::align_of::<BNPoint>() - 4usize];
    ["Offset of field: BNPoint::x"][::std::mem::offset_of!(BNPoint, x) - 0usize];
    ["Offset of field: BNPoint::y"][::std::mem::offset_of!(BNPoint, y) - 4usize];
};
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNThemeColor {
    #[doc = " Hex dump colors"]
    AddressColor = 0,
    #[doc = " Hex dump colors"]
    ModifiedColor = 1,
    #[doc = " Hex dump colors"]
    InsertedColor = 2,
    #[doc = " Hex dump colors"]
    NotPresentColor = 3,
    #[doc = " Hex dump colors"]
    SelectionColor = 4,
    #[doc = " Hex dump colors"]
    OutlineColor = 5,
    #[doc = " Hex dump colors"]
    BackgroundHighlightDarkColor = 6,
    #[doc = " Hex dump colors"]
    BackgroundHighlightLightColor = 7,
    #[doc = " Hex dump colors"]
    BoldBackgroundHighlightDarkColor = 8,
    #[doc = " Hex dump colors"]
    BoldBackgroundHighlightLightColor = 9,
    #[doc = " Hex dump colors"]
    AlphanumericHighlightColor = 10,
    #[doc = " Hex dump colors"]
    PrintableHighlightColor = 11,
    #[doc = " Graph colors"]
    GraphBackgroundDarkColor = 12,
    #[doc = " Graph colors"]
    GraphBackgroundLightColor = 13,
    #[doc = " Graph colors"]
    GraphNodeDarkColor = 14,
    #[doc = " Graph colors"]
    GraphNodeLightColor = 15,
    #[doc = " Graph colors"]
    GraphNodeOutlineColor = 16,
    #[doc = " Graph colors"]
    GraphNodeShadowColor = 17,
    #[doc = " Graph colors"]
    GraphEntryNodeIndicatorColor = 18,
    #[doc = " Graph colors"]
    GraphExitNodeIndicatorColor = 19,
    #[doc = " Graph colors"]
    GraphExitNoreturnNodeIndicatorColor = 20,
    #[doc = " Graph colors"]
    TrueBranchColor = 21,
    #[doc = " Graph colors"]
    FalseBranchColor = 22,
    #[doc = " Graph colors"]
    UnconditionalBranchColor = 23,
    #[doc = " Graph colors"]
    AltTrueBranchColor = 24,
    #[doc = " Graph colors"]
    AltFalseBranchColor = 25,
    #[doc = " Graph colors"]
    AltUnconditionalBranchColor = 26,
    #[doc = " Disassembly colors"]
    InstructionColor = 27,
    #[doc = " Disassembly colors"]
    RegisterColor = 28,
    #[doc = " Disassembly colors"]
    NumberColor = 29,
    #[doc = " Disassembly colors"]
    CodeSymbolColor = 30,
    #[doc = " Disassembly colors"]
    DataSymbolColor = 31,
    #[doc = " Disassembly colors"]
    LocalVariableColor = 32,
    #[doc = " Disassembly colors"]
    StackVariableColor = 33,
    #[doc = " Disassembly colors"]
    ImportColor = 34,
    #[doc = " Disassembly colors"]
    ExportColor = 35,
    #[doc = " Disassembly colors"]
    InstructionHighlightColor = 36,
    #[doc = " Disassembly colors"]
    RelatedInstructionHighlightColor = 37,
    #[doc = " Disassembly colors"]
    TokenHighlightColor = 38,
    #[doc = " Disassembly colors"]
    TokenSelectionColor = 39,
    #[doc = " Disassembly colors"]
    AnnotationColor = 40,
    #[doc = " Disassembly colors"]
    OpcodeColor = 41,
    #[doc = " Disassembly colors"]
    LinearDisassemblyFunctionHeaderColor = 42,
    #[doc = " Disassembly colors"]
    LinearDisassemblyBlockColor = 43,
    #[doc = " Disassembly colors"]
    LinearDisassemblyNoteColor = 44,
    #[doc = " Disassembly colors"]
    LinearDisassemblySeparatorColor = 45,
    #[doc = " Disassembly colors"]
    LinearDisassemblyCodeFoldColor = 46,
    #[doc = " Disassembly colors"]
    StringColor = 47,
    #[doc = " Disassembly colors"]
    TypeNameColor = 48,
    #[doc = " Disassembly colors"]
    FieldNameColor = 49,
    #[doc = " Disassembly colors"]
    KeywordColor = 50,
    #[doc = " Disassembly colors"]
    UncertainColor = 51,
    #[doc = " Disassembly colors"]
    NameSpaceColor = 52,
    #[doc = " Disassembly colors"]
    NameSpaceSeparatorColor = 53,
    #[doc = " Disassembly colors"]
    GotoLabelColor = 54,
    #[doc = " Disassembly colors"]
    CommentColor = 55,
    #[doc = " Disassembly colors"]
    OperationColor = 56,
    #[doc = " Disassembly colors"]
    BaseStructureNameColor = 57,
    #[doc = " Disassembly colors"]
    IndentationLineColor = 58,
    #[doc = " Disassembly colors"]
    IndentationLineHighlightColor = 59,
    #[doc = " Script console colors"]
    ScriptConsoleOutputColor = 60,
    #[doc = " Script console colors"]
    ScriptConsoleWarningColor = 61,
    #[doc = " Script console colors"]
    ScriptConsoleErrorColor = 62,
    #[doc = " Script console colors"]
    ScriptConsoleEchoColor = 63,
    #[doc = " Highlighting colors"]
    BlueStandardHighlightColor = 64,
    #[doc = " Highlighting colors"]
    GreenStandardHighlightColor = 65,
    #[doc = " Highlighting colors"]
    CyanStandardHighlightColor = 66,
    #[doc = " Highlighting colors"]
    RedStandardHighlightColor = 67,
    #[doc = " Highlighting colors"]
    MagentaStandardHighlightColor = 68,
    #[doc = " Highlighting colors"]
    YellowStandardHighlightColor = 69,
    #[doc = " Highlighting colors"]
    OrangeStandardHighlightColor = 70,
    #[doc = " Highlighting colors"]
    WhiteStandardHighlightColor = 71,
    #[doc = " Highlighting colors"]
    BlackStandardHighlightColor = 72,
    #[doc = " MiniGraph"]
    MiniGraphOverlayColor = 73,
    #[doc = " FeatureMap"]
    FeatureMapBaseColor = 74,
    #[doc = " FeatureMap"]
    FeatureMapNavLineColor = 75,
    #[doc = " FeatureMap"]
    FeatureMapNavHighlightColor = 76,
    #[doc = " FeatureMap"]
    FeatureMapDataVariableColor = 77,
    #[doc = " FeatureMap"]
    FeatureMapAsciiStringColor = 78,
    #[doc = " FeatureMap"]
    FeatureMapUnicodeStringColor = 79,
    #[doc = " FeatureMap"]
    FeatureMapFunctionColor = 80,
    #[doc = " FeatureMap"]
    FeatureMapImportColor = 81,
    #[doc = " FeatureMap"]
    FeatureMapExternColor = 82,
    #[doc = " FeatureMap"]
    FeatureMapLibraryColor = 83,
    #[doc = " Sidebar colors"]
    SidebarBackgroundColor = 84,
    #[doc = " Sidebar colors"]
    SidebarInactiveIconColor = 85,
    #[doc = " Sidebar colors"]
    SidebarHoverIconColor = 86,
    #[doc = " Sidebar colors"]
    SidebarActiveIconColor = 87,
    #[doc = " Sidebar colors"]
    SidebarFocusedIconColor = 88,
    #[doc = " Sidebar colors"]
    SidebarHoverBackgroundColor = 89,
    #[doc = " Sidebar colors"]
    SidebarActiveBackgroundColor = 90,
    #[doc = " Sidebar colors"]
    SidebarFocusedBackgroundColor = 91,
    #[doc = " Sidebar colors"]
    SidebarActiveIndicatorLineColor = 92,
    #[doc = " Deprecated, has no effect (paints as QPalette::Window)"]
    SidebarHeaderBackgroundColor = 93,
    SidebarHeaderTextColor = 94,
    SidebarWidgetBackgroundColor = 95,
    #[doc = " Pane colors"]
    ActivePaneBackgroundColor = 96,
    #[doc = " Pane colors"]
    InactivePaneBackgroundColor = 97,
    #[doc = " Pane colors"]
    FocusedPaneBackgroundColor = 98,
    #[doc = " Tab colors"]
    TabBarTabActiveColor = 99,
    #[doc = " Tab colors"]
    TabBarTabHoverColor = 100,
    #[doc = " Tab colors"]
    TabBarTabInactiveColor = 101,
    #[doc = " Tab colors"]
    TabBarTabBorderColor = 102,
    #[doc = " Tab colors"]
    TabBarTabGlowColor = 103,
    #[doc = " Status colors"]
    StatusBarServerConnectedColor = 104,
    #[doc = " Status colors"]
    StatusBarServerDisconnectedColor = 105,
    #[doc = " Status colors"]
    StatusBarServerWarningColor = 106,
    #[doc = " Status colors"]
    StatusBarProjectColor = 107,
    #[doc = " Brace colors"]
    BraceOption1Color = 108,
    #[doc = " Brace colors"]
    BraceOption2Color = 109,
    #[doc = " Brace colors"]
    BraceOption3Color = 110,
    #[doc = " Brace colors"]
    BraceOption4Color = 111,
    #[doc = " Brace colors"]
    BraceOption5Color = 112,
    #[doc = " Brace colors"]
    BraceOption6Color = 113,
    #[doc = " Type class colors"]
    VoidTypeColor = 114,
    #[doc = " Type class colors"]
    StructureTypeColor = 115,
    #[doc = " Type class colors"]
    EnumerationTypeColor = 116,
    #[doc = " Type class colors"]
    FunctionTypeColor = 117,
    #[doc = " Type class colors"]
    BoolTypeColor = 118,
    #[doc = " Type class colors"]
    IntegerTypeColor = 119,
    #[doc = " Type class colors"]
    FloatTypeColor = 120,
    #[doc = " Type class colors"]
    PointerTypeColor = 121,
    #[doc = " Type class colors"]
    ArrayTypeColor = 122,
    #[doc = " Type class colors"]
    VarArgsTypeColor = 123,
    #[doc = " Type class colors"]
    ValueTypeColor = 124,
    #[doc = " Type class colors"]
    NamedTypeReferenceColor = 125,
    #[doc = " Type class colors"]
    WideCharTypeColor = 126,
}
#[repr(u8)]
#[doc = " The following edge styles map to Qt's Qt::PenStyle enumeration"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNEdgePenStyle {
    #[doc = " no line at all."]
    NoPen = 0,
    #[doc = " A plain line (default)"]
    SolidLine = 1,
    #[doc = " Dashes separated by a few pixels."]
    DashLine = 2,
    #[doc = " Dots separated by a few pixels."]
    DotLine = 3,
    #[doc = " Alternate dots and dashes."]
    DashDotLine = 4,
    #[doc = " One dash, two dots, one dash, two dots."]
    DashDotDotLine = 5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNEdgeStyle {
    pub style: BNEdgePenStyle,
    pub width: usize,
    pub color: BNThemeColor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNEdgeStyle"][::std::mem::size_of::<BNEdgeStyle>() - 24usize];
    ["Alignment of BNEdgeStyle"][::std::mem::align_of::<BNEdgeStyle>() - 8usize];
    ["Offset of field: BNEdgeStyle::style"][::std::mem::offset_of!(BNEdgeStyle, style) - 0usize];
    ["Offset of field: BNEdgeStyle::width"][::std::mem::offset_of!(BNEdgeStyle, width) - 8usize];
    ["Offset of field: BNEdgeStyle::color"][::std::mem::offset_of!(BNEdgeStyle, color) - 16usize];
};
impl Default for BNEdgeStyle {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraphEdge {
    pub type_: BNBranchType,
    pub target: *mut BNFlowGraphNode,
    pub points: *mut BNPoint,
    pub pointCount: usize,
    pub backEdge: bool,
    pub style: BNEdgeStyle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNFlowGraphEdge"][::std::mem::size_of::<BNFlowGraphEdge>() - 64usize];
    ["Alignment of BNFlowGraphEdge"][::std::mem::align_of::<BNFlowGraphEdge>() - 8usize];
    ["Offset of field: BNFlowGraphEdge::type_"]
        [::std::mem::offset_of!(BNFlowGraphEdge, type_) - 0usize];
    ["Offset of field: BNFlowGraphEdge::target"]
        [::std::mem::offset_of!(BNFlowGraphEdge, target) - 8usize];
    ["Offset of field: BNFlowGraphEdge::points"]
        [::std::mem::offset_of!(BNFlowGraphEdge, points) - 16usize];
    ["Offset of field: BNFlowGraphEdge::pointCount"]
        [::std::mem::offset_of!(BNFlowGraphEdge, pointCount) - 24usize];
    ["Offset of field: BNFlowGraphEdge::backEdge"]
        [::std::mem::offset_of!(BNFlowGraphEdge, backEdge) - 32usize];
    ["Offset of field: BNFlowGraphEdge::style"]
        [::std::mem::offset_of!(BNFlowGraphEdge, style) - 40usize];
};
impl Default for BNFlowGraphEdge {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNHighlightColorStyle {
    StandardHighlightColor = 0,
    MixedHighlightColor = 1,
    CustomHighlightColor = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNHighlightStandardColor {
    NoHighlightColor = 0,
    BlueHighlightColor = 1,
    GreenHighlightColor = 2,
    CyanHighlightColor = 3,
    RedHighlightColor = 4,
    MagentaHighlightColor = 5,
    YellowHighlightColor = 6,
    OrangeHighlightColor = 7,
    WhiteHighlightColor = 8,
    BlackHighlightColor = 9,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNHighlightColor {
    pub style: BNHighlightColorStyle,
    pub color: BNHighlightStandardColor,
    pub mixColor: BNHighlightStandardColor,
    pub mix: u8,
    pub r: u8,
    pub g: u8,
    pub b: u8,
    pub alpha: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNHighlightColor"][::std::mem::size_of::<BNHighlightColor>() - 8usize];
    ["Alignment of BNHighlightColor"][::std::mem::align_of::<BNHighlightColor>() - 1usize];
    ["Offset of field: BNHighlightColor::style"]
        [::std::mem::offset_of!(BNHighlightColor, style) - 0usize];
    ["Offset of field: BNHighlightColor::color"]
        [::std::mem::offset_of!(BNHighlightColor, color) - 1usize];
    ["Offset of field: BNHighlightColor::mixColor"]
        [::std::mem::offset_of!(BNHighlightColor, mixColor) - 2usize];
    ["Offset of field: BNHighlightColor::mix"]
        [::std::mem::offset_of!(BNHighlightColor, mix) - 3usize];
    ["Offset of field: BNHighlightColor::r"][::std::mem::offset_of!(BNHighlightColor, r) - 4usize];
    ["Offset of field: BNHighlightColor::g"][::std::mem::offset_of!(BNHighlightColor, g) - 5usize];
    ["Offset of field: BNHighlightColor::b"][::std::mem::offset_of!(BNHighlightColor, b) - 6usize];
    ["Offset of field: BNHighlightColor::alpha"]
        [::std::mem::offset_of!(BNHighlightColor, alpha) - 7usize];
};
impl Default for BNHighlightColor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDisassemblyTextLineTypeInfo {
    pub hasTypeInfo: bool,
    pub parentType: *mut BNType,
    pub fieldIndex: usize,
    pub offset: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDisassemblyTextLineTypeInfo"]
        [::std::mem::size_of::<BNDisassemblyTextLineTypeInfo>() - 32usize];
    ["Alignment of BNDisassemblyTextLineTypeInfo"]
        [::std::mem::align_of::<BNDisassemblyTextLineTypeInfo>() - 8usize];
    ["Offset of field: BNDisassemblyTextLineTypeInfo::hasTypeInfo"]
        [::std::mem::offset_of!(BNDisassemblyTextLineTypeInfo, hasTypeInfo) - 0usize];
    ["Offset of field: BNDisassemblyTextLineTypeInfo::parentType"]
        [::std::mem::offset_of!(BNDisassemblyTextLineTypeInfo, parentType) - 8usize];
    ["Offset of field: BNDisassemblyTextLineTypeInfo::fieldIndex"]
        [::std::mem::offset_of!(BNDisassemblyTextLineTypeInfo, fieldIndex) - 16usize];
    ["Offset of field: BNDisassemblyTextLineTypeInfo::offset"]
        [::std::mem::offset_of!(BNDisassemblyTextLineTypeInfo, offset) - 24usize];
};
impl Default for BNDisassemblyTextLineTypeInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDisassemblyTextLine {
    pub addr: u64,
    pub instrIndex: usize,
    pub tokens: *mut BNInstructionTextToken,
    pub count: usize,
    pub highlight: BNHighlightColor,
    pub tags: *mut *mut BNTag,
    pub tagCount: usize,
    pub typeInfo: BNDisassemblyTextLineTypeInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDisassemblyTextLine"][::std::mem::size_of::<BNDisassemblyTextLine>() - 88usize];
    ["Alignment of BNDisassemblyTextLine"]
        [::std::mem::align_of::<BNDisassemblyTextLine>() - 8usize];
    ["Offset of field: BNDisassemblyTextLine::addr"]
        [::std::mem::offset_of!(BNDisassemblyTextLine, addr) - 0usize];
    ["Offset of field: BNDisassemblyTextLine::instrIndex"]
        [::std::mem::offset_of!(BNDisassemblyTextLine, instrIndex) - 8usize];
    ["Offset of field: BNDisassemblyTextLine::tokens"]
        [::std::mem::offset_of!(BNDisassemblyTextLine, tokens) - 16usize];
    ["Offset of field: BNDisassemblyTextLine::count"]
        [::std::mem::offset_of!(BNDisassemblyTextLine, count) - 24usize];
    ["Offset of field: BNDisassemblyTextLine::highlight"]
        [::std::mem::offset_of!(BNDisassemblyTextLine, highlight) - 32usize];
    ["Offset of field: BNDisassemblyTextLine::tags"]
        [::std::mem::offset_of!(BNDisassemblyTextLine, tags) - 40usize];
    ["Offset of field: BNDisassemblyTextLine::tagCount"]
        [::std::mem::offset_of!(BNDisassemblyTextLine, tagCount) - 48usize];
    ["Offset of field: BNDisassemblyTextLine::typeInfo"]
        [::std::mem::offset_of!(BNDisassemblyTextLine, typeInfo) - 56usize];
};
impl Default for BNDisassemblyTextLine {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLinearDisassemblyLine {
    pub type_: BNLinearDisassemblyLineType,
    pub function: *mut BNFunction,
    pub block: *mut BNBasicBlock,
    pub contents: BNDisassemblyTextLine,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNLinearDisassemblyLine"]
        [::std::mem::size_of::<BNLinearDisassemblyLine>() - 112usize];
    ["Alignment of BNLinearDisassemblyLine"]
        [::std::mem::align_of::<BNLinearDisassemblyLine>() - 8usize];
    ["Offset of field: BNLinearDisassemblyLine::type_"]
        [::std::mem::offset_of!(BNLinearDisassemblyLine, type_) - 0usize];
    ["Offset of field: BNLinearDisassemblyLine::function"]
        [::std::mem::offset_of!(BNLinearDisassemblyLine, function) - 8usize];
    ["Offset of field: BNLinearDisassemblyLine::block"]
        [::std::mem::offset_of!(BNLinearDisassemblyLine, block) - 16usize];
    ["Offset of field: BNLinearDisassemblyLine::contents"]
        [::std::mem::offset_of!(BNLinearDisassemblyLine, contents) - 24usize];
};
impl Default for BNLinearDisassemblyLine {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNReferenceSource {
    pub func: *mut BNFunction,
    pub arch: *mut BNArchitecture,
    pub addr: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNReferenceSource"][::std::mem::size_of::<BNReferenceSource>() - 24usize];
    ["Alignment of BNReferenceSource"][::std::mem::align_of::<BNReferenceSource>() - 8usize];
    ["Offset of field: BNReferenceSource::func"]
        [::std::mem::offset_of!(BNReferenceSource, func) - 0usize];
    ["Offset of field: BNReferenceSource::arch"]
        [::std::mem::offset_of!(BNReferenceSource, arch) - 8usize];
    ["Offset of field: BNReferenceSource::addr"]
        [::std::mem::offset_of!(BNReferenceSource, addr) - 16usize];
};
impl Default for BNReferenceSource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeFieldReference {
    pub func: *mut BNFunction,
    pub arch: *mut BNArchitecture,
    pub addr: u64,
    pub size: usize,
    pub incomingType: BNTypeWithConfidence,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeFieldReference"][::std::mem::size_of::<BNTypeFieldReference>() - 48usize];
    ["Alignment of BNTypeFieldReference"][::std::mem::align_of::<BNTypeFieldReference>() - 8usize];
    ["Offset of field: BNTypeFieldReference::func"]
        [::std::mem::offset_of!(BNTypeFieldReference, func) - 0usize];
    ["Offset of field: BNTypeFieldReference::arch"]
        [::std::mem::offset_of!(BNTypeFieldReference, arch) - 8usize];
    ["Offset of field: BNTypeFieldReference::addr"]
        [::std::mem::offset_of!(BNTypeFieldReference, addr) - 16usize];
    ["Offset of field: BNTypeFieldReference::size"]
        [::std::mem::offset_of!(BNTypeFieldReference, size) - 24usize];
    ["Offset of field: BNTypeFieldReference::incomingType"]
        [::std::mem::offset_of!(BNTypeFieldReference, incomingType) - 32usize];
};
impl Default for BNTypeFieldReference {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNILReferenceSource {
    pub func: *mut BNFunction,
    pub arch: *mut BNArchitecture,
    pub addr: u64,
    pub type_: BNFunctionGraphType,
    pub exprId: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNILReferenceSource"][::std::mem::size_of::<BNILReferenceSource>() - 40usize];
    ["Alignment of BNILReferenceSource"][::std::mem::align_of::<BNILReferenceSource>() - 8usize];
    ["Offset of field: BNILReferenceSource::func"]
        [::std::mem::offset_of!(BNILReferenceSource, func) - 0usize];
    ["Offset of field: BNILReferenceSource::arch"]
        [::std::mem::offset_of!(BNILReferenceSource, arch) - 8usize];
    ["Offset of field: BNILReferenceSource::addr"]
        [::std::mem::offset_of!(BNILReferenceSource, addr) - 16usize];
    ["Offset of field: BNILReferenceSource::type_"]
        [::std::mem::offset_of!(BNILReferenceSource, type_) - 24usize];
    ["Offset of field: BNILReferenceSource::exprId"]
        [::std::mem::offset_of!(BNILReferenceSource, exprId) - 32usize];
};
impl Default for BNILReferenceSource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeFieldReferenceSizeInfo {
    pub offset: u64,
    pub sizes: *mut usize,
    pub count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeFieldReferenceSizeInfo"]
        [::std::mem::size_of::<BNTypeFieldReferenceSizeInfo>() - 24usize];
    ["Alignment of BNTypeFieldReferenceSizeInfo"]
        [::std::mem::align_of::<BNTypeFieldReferenceSizeInfo>() - 8usize];
    ["Offset of field: BNTypeFieldReferenceSizeInfo::offset"]
        [::std::mem::offset_of!(BNTypeFieldReferenceSizeInfo, offset) - 0usize];
    ["Offset of field: BNTypeFieldReferenceSizeInfo::sizes"]
        [::std::mem::offset_of!(BNTypeFieldReferenceSizeInfo, sizes) - 8usize];
    ["Offset of field: BNTypeFieldReferenceSizeInfo::count"]
        [::std::mem::offset_of!(BNTypeFieldReferenceSizeInfo, count) - 16usize];
};
impl Default for BNTypeFieldReferenceSizeInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeFieldReferenceTypeInfo {
    pub offset: u64,
    pub types: *mut BNTypeWithConfidence,
    pub count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeFieldReferenceTypeInfo"]
        [::std::mem::size_of::<BNTypeFieldReferenceTypeInfo>() - 24usize];
    ["Alignment of BNTypeFieldReferenceTypeInfo"]
        [::std::mem::align_of::<BNTypeFieldReferenceTypeInfo>() - 8usize];
    ["Offset of field: BNTypeFieldReferenceTypeInfo::offset"]
        [::std::mem::offset_of!(BNTypeFieldReferenceTypeInfo, offset) - 0usize];
    ["Offset of field: BNTypeFieldReferenceTypeInfo::types"]
        [::std::mem::offset_of!(BNTypeFieldReferenceTypeInfo, types) - 8usize];
    ["Offset of field: BNTypeFieldReferenceTypeInfo::count"]
        [::std::mem::offset_of!(BNTypeFieldReferenceTypeInfo, count) - 16usize];
};
impl Default for BNTypeFieldReferenceTypeInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNVariableReferenceSource {
    pub var: BNVariable,
    pub source: BNILReferenceSource,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNVariableReferenceSource"]
        [::std::mem::size_of::<BNVariableReferenceSource>() - 56usize];
    ["Alignment of BNVariableReferenceSource"]
        [::std::mem::align_of::<BNVariableReferenceSource>() - 8usize];
    ["Offset of field: BNVariableReferenceSource::var"]
        [::std::mem::offset_of!(BNVariableReferenceSource, var) - 0usize];
    ["Offset of field: BNVariableReferenceSource::source"]
        [::std::mem::offset_of!(BNVariableReferenceSource, source) - 16usize];
};
impl Default for BNVariableReferenceSource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[doc = " This describes how a type is referenced"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTypeReferenceType {
    #[doc = " Type A contains type B"]
    DirectTypeReferenceType = 0,
    #[doc = " All other cases, e.g., type A contains a pointer to type B"]
    IndirectTypeReferenceType = 1,
    #[doc = " The nature of the reference is unknown"]
    UnknownTypeReferenceType = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeReferenceSource {
    pub name: BNQualifiedName,
    pub offset: u64,
    pub type_: BNTypeReferenceType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeReferenceSource"][::std::mem::size_of::<BNTypeReferenceSource>() - 40usize];
    ["Alignment of BNTypeReferenceSource"]
        [::std::mem::align_of::<BNTypeReferenceSource>() - 8usize];
    ["Offset of field: BNTypeReferenceSource::name"]
        [::std::mem::offset_of!(BNTypeReferenceSource, name) - 0usize];
    ["Offset of field: BNTypeReferenceSource::offset"]
        [::std::mem::offset_of!(BNTypeReferenceSource, offset) - 24usize];
    ["Offset of field: BNTypeReferenceSource::type_"]
        [::std::mem::offset_of!(BNTypeReferenceSource, type_) - 32usize];
};
impl Default for BNTypeReferenceSource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTagTypeType {
    UserTagType = 0,
    NotificationTagType = 1,
    BookmarksTagType = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTagReferenceType {
    AddressTagReference = 0,
    FunctionTagReference = 1,
    DataTagReference = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTagReference {
    pub refType: BNTagReferenceType,
    pub autoDefined: bool,
    pub tag: *mut BNTag,
    pub arch: *mut BNArchitecture,
    pub func: *mut BNFunction,
    pub addr: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTagReference"][::std::mem::size_of::<BNTagReference>() - 40usize];
    ["Alignment of BNTagReference"][::std::mem::align_of::<BNTagReference>() - 8usize];
    ["Offset of field: BNTagReference::refType"]
        [::std::mem::offset_of!(BNTagReference, refType) - 0usize];
    ["Offset of field: BNTagReference::autoDefined"]
        [::std::mem::offset_of!(BNTagReference, autoDefined) - 1usize];
    ["Offset of field: BNTagReference::tag"][::std::mem::offset_of!(BNTagReference, tag) - 8usize];
    ["Offset of field: BNTagReference::arch"]
        [::std::mem::offset_of!(BNTagReference, arch) - 16usize];
    ["Offset of field: BNTagReference::func"]
        [::std::mem::offset_of!(BNTagReference, func) - 24usize];
    ["Offset of field: BNTagReference::addr"]
        [::std::mem::offset_of!(BNTagReference, addr) - 32usize];
};
impl Default for BNTagReference {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCallingConventionWithConfidence {
    pub convention: *mut BNCallingConvention,
    pub confidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNCallingConventionWithConfidence"]
        [::std::mem::size_of::<BNCallingConventionWithConfidence>() - 16usize];
    ["Alignment of BNCallingConventionWithConfidence"]
        [::std::mem::align_of::<BNCallingConventionWithConfidence>() - 8usize];
    ["Offset of field: BNCallingConventionWithConfidence::convention"]
        [::std::mem::offset_of!(BNCallingConventionWithConfidence, convention) - 0usize];
    ["Offset of field: BNCallingConventionWithConfidence::confidence"]
        [::std::mem::offset_of!(BNCallingConventionWithConfidence, confidence) - 8usize];
};
impl Default for BNCallingConventionWithConfidence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BNBoolWithConfidence {
    pub value: bool,
    pub confidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNBoolWithConfidence"][::std::mem::size_of::<BNBoolWithConfidence>() - 2usize];
    ["Alignment of BNBoolWithConfidence"][::std::mem::align_of::<BNBoolWithConfidence>() - 1usize];
    ["Offset of field: BNBoolWithConfidence::value"]
        [::std::mem::offset_of!(BNBoolWithConfidence, value) - 0usize];
    ["Offset of field: BNBoolWithConfidence::confidence"]
        [::std::mem::offset_of!(BNBoolWithConfidence, confidence) - 1usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BNOffsetWithConfidence {
    pub value: i64,
    pub confidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNOffsetWithConfidence"][::std::mem::size_of::<BNOffsetWithConfidence>() - 16usize];
    ["Alignment of BNOffsetWithConfidence"]
        [::std::mem::align_of::<BNOffsetWithConfidence>() - 8usize];
    ["Offset of field: BNOffsetWithConfidence::value"]
        [::std::mem::offset_of!(BNOffsetWithConfidence, value) - 0usize];
    ["Offset of field: BNOffsetWithConfidence::confidence"]
        [::std::mem::offset_of!(BNOffsetWithConfidence, confidence) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNParameterVariablesWithConfidence {
    pub vars: *mut BNVariable,
    pub count: usize,
    pub confidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNParameterVariablesWithConfidence"]
        [::std::mem::size_of::<BNParameterVariablesWithConfidence>() - 24usize];
    ["Alignment of BNParameterVariablesWithConfidence"]
        [::std::mem::align_of::<BNParameterVariablesWithConfidence>() - 8usize];
    ["Offset of field: BNParameterVariablesWithConfidence::vars"]
        [::std::mem::offset_of!(BNParameterVariablesWithConfidence, vars) - 0usize];
    ["Offset of field: BNParameterVariablesWithConfidence::count"]
        [::std::mem::offset_of!(BNParameterVariablesWithConfidence, count) - 8usize];
    ["Offset of field: BNParameterVariablesWithConfidence::confidence"]
        [::std::mem::offset_of!(BNParameterVariablesWithConfidence, confidence) - 16usize];
};
impl Default for BNParameterVariablesWithConfidence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterSetWithConfidence {
    pub regs: *mut u32,
    pub count: usize,
    pub confidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNRegisterSetWithConfidence"]
        [::std::mem::size_of::<BNRegisterSetWithConfidence>() - 24usize];
    ["Alignment of BNRegisterSetWithConfidence"]
        [::std::mem::align_of::<BNRegisterSetWithConfidence>() - 8usize];
    ["Offset of field: BNRegisterSetWithConfidence::regs"]
        [::std::mem::offset_of!(BNRegisterSetWithConfidence, regs) - 0usize];
    ["Offset of field: BNRegisterSetWithConfidence::count"]
        [::std::mem::offset_of!(BNRegisterSetWithConfidence, count) - 8usize];
    ["Offset of field: BNRegisterSetWithConfidence::confidence"]
        [::std::mem::offset_of!(BNRegisterSetWithConfidence, confidence) - 16usize];
};
impl Default for BNRegisterSetWithConfidence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFunctionParameter {
    pub name: *mut ::std::os::raw::c_char,
    pub type_: *mut BNType,
    pub typeConfidence: u8,
    pub defaultLocation: bool,
    pub location: BNVariable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNFunctionParameter"][::std::mem::size_of::<BNFunctionParameter>() - 40usize];
    ["Alignment of BNFunctionParameter"][::std::mem::align_of::<BNFunctionParameter>() - 8usize];
    ["Offset of field: BNFunctionParameter::name"]
        [::std::mem::offset_of!(BNFunctionParameter, name) - 0usize];
    ["Offset of field: BNFunctionParameter::type_"]
        [::std::mem::offset_of!(BNFunctionParameter, type_) - 8usize];
    ["Offset of field: BNFunctionParameter::typeConfidence"]
        [::std::mem::offset_of!(BNFunctionParameter, typeConfidence) - 16usize];
    ["Offset of field: BNFunctionParameter::defaultLocation"]
        [::std::mem::offset_of!(BNFunctionParameter, defaultLocation) - 17usize];
    ["Offset of field: BNFunctionParameter::location"]
        [::std::mem::offset_of!(BNFunctionParameter, location) - 24usize];
};
impl Default for BNFunctionParameter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNQualifiedNameAndType {
    pub name: BNQualifiedName,
    pub type_: *mut BNType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNQualifiedNameAndType"][::std::mem::size_of::<BNQualifiedNameAndType>() - 32usize];
    ["Alignment of BNQualifiedNameAndType"]
        [::std::mem::align_of::<BNQualifiedNameAndType>() - 8usize];
    ["Offset of field: BNQualifiedNameAndType::name"]
        [::std::mem::offset_of!(BNQualifiedNameAndType, name) - 0usize];
    ["Offset of field: BNQualifiedNameAndType::type_"]
        [::std::mem::offset_of!(BNQualifiedNameAndType, type_) - 24usize];
};
impl Default for BNQualifiedNameAndType {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNQualifiedNameTypeAndId {
    pub name: BNQualifiedName,
    pub id: *mut ::std::os::raw::c_char,
    pub type_: *mut BNType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNQualifiedNameTypeAndId"]
        [::std::mem::size_of::<BNQualifiedNameTypeAndId>() - 40usize];
    ["Alignment of BNQualifiedNameTypeAndId"]
        [::std::mem::align_of::<BNQualifiedNameTypeAndId>() - 8usize];
    ["Offset of field: BNQualifiedNameTypeAndId::name"]
        [::std::mem::offset_of!(BNQualifiedNameTypeAndId, name) - 0usize];
    ["Offset of field: BNQualifiedNameTypeAndId::id"]
        [::std::mem::offset_of!(BNQualifiedNameTypeAndId, id) - 24usize];
    ["Offset of field: BNQualifiedNameTypeAndId::type_"]
        [::std::mem::offset_of!(BNQualifiedNameTypeAndId, type_) - 32usize];
};
impl Default for BNQualifiedNameTypeAndId {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStructureMember {
    pub type_: *mut BNType,
    pub name: *mut ::std::os::raw::c_char,
    pub offset: u64,
    pub typeConfidence: u8,
    pub access: BNMemberAccess,
    pub scope: BNMemberScope,
    pub bitPosition: u8,
    pub bitWidth: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNStructureMember"][::std::mem::size_of::<BNStructureMember>() - 32usize];
    ["Alignment of BNStructureMember"][::std::mem::align_of::<BNStructureMember>() - 8usize];
    ["Offset of field: BNStructureMember::type_"]
        [::std::mem::offset_of!(BNStructureMember, type_) - 0usize];
    ["Offset of field: BNStructureMember::name"]
        [::std::mem::offset_of!(BNStructureMember, name) - 8usize];
    ["Offset of field: BNStructureMember::offset"]
        [::std::mem::offset_of!(BNStructureMember, offset) - 16usize];
    ["Offset of field: BNStructureMember::typeConfidence"]
        [::std::mem::offset_of!(BNStructureMember, typeConfidence) - 24usize];
    ["Offset of field: BNStructureMember::access"]
        [::std::mem::offset_of!(BNStructureMember, access) - 25usize];
    ["Offset of field: BNStructureMember::scope"]
        [::std::mem::offset_of!(BNStructureMember, scope) - 26usize];
    ["Offset of field: BNStructureMember::bitPosition"]
        [::std::mem::offset_of!(BNStructureMember, bitPosition) - 27usize];
    ["Offset of field: BNStructureMember::bitWidth"]
        [::std::mem::offset_of!(BNStructureMember, bitWidth) - 28usize];
};
impl Default for BNStructureMember {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInheritedStructureMember {
    pub base: *mut BNNamedTypeReference,
    pub baseOffset: u64,
    pub member: BNStructureMember,
    pub memberIndex: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNInheritedStructureMember"]
        [::std::mem::size_of::<BNInheritedStructureMember>() - 56usize];
    ["Alignment of BNInheritedStructureMember"]
        [::std::mem::align_of::<BNInheritedStructureMember>() - 8usize];
    ["Offset of field: BNInheritedStructureMember::base"]
        [::std::mem::offset_of!(BNInheritedStructureMember, base) - 0usize];
    ["Offset of field: BNInheritedStructureMember::baseOffset"]
        [::std::mem::offset_of!(BNInheritedStructureMember, baseOffset) - 8usize];
    ["Offset of field: BNInheritedStructureMember::member"]
        [::std::mem::offset_of!(BNInheritedStructureMember, member) - 16usize];
    ["Offset of field: BNInheritedStructureMember::memberIndex"]
        [::std::mem::offset_of!(BNInheritedStructureMember, memberIndex) - 48usize];
};
impl Default for BNInheritedStructureMember {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBaseStructure {
    pub type_: *mut BNNamedTypeReference,
    pub offset: u64,
    pub width: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNBaseStructure"][::std::mem::size_of::<BNBaseStructure>() - 24usize];
    ["Alignment of BNBaseStructure"][::std::mem::align_of::<BNBaseStructure>() - 8usize];
    ["Offset of field: BNBaseStructure::type_"]
        [::std::mem::offset_of!(BNBaseStructure, type_) - 0usize];
    ["Offset of field: BNBaseStructure::offset"]
        [::std::mem::offset_of!(BNBaseStructure, offset) - 8usize];
    ["Offset of field: BNBaseStructure::width"]
        [::std::mem::offset_of!(BNBaseStructure, width) - 16usize];
};
impl Default for BNBaseStructure {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNEnumerationMember {
    pub name: *mut ::std::os::raw::c_char,
    pub value: u64,
    pub isDefault: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNEnumerationMember"][::std::mem::size_of::<BNEnumerationMember>() - 24usize];
    ["Alignment of BNEnumerationMember"][::std::mem::align_of::<BNEnumerationMember>() - 8usize];
    ["Offset of field: BNEnumerationMember::name"]
        [::std::mem::offset_of!(BNEnumerationMember, name) - 0usize];
    ["Offset of field: BNEnumerationMember::value"]
        [::std::mem::offset_of!(BNEnumerationMember, value) - 8usize];
    ["Offset of field: BNEnumerationMember::isDefault"]
        [::std::mem::offset_of!(BNEnumerationMember, isDefault) - 16usize];
};
impl Default for BNEnumerationMember {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFunctionRecognizer {
    pub context: *mut ::std::os::raw::c_void,
    pub recognizeLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
            func: *mut BNFunction,
            il: *mut BNLowLevelILFunction,
        ) -> bool,
    >,
    pub recognizeMediumLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
            func: *mut BNFunction,
            il: *mut BNMediumLevelILFunction,
        ) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNFunctionRecognizer"][::std::mem::size_of::<BNFunctionRecognizer>() - 24usize];
    ["Alignment of BNFunctionRecognizer"][::std::mem::align_of::<BNFunctionRecognizer>() - 8usize];
    ["Offset of field: BNFunctionRecognizer::context"]
        [::std::mem::offset_of!(BNFunctionRecognizer, context) - 0usize];
    ["Offset of field: BNFunctionRecognizer::recognizeLowLevelIL"]
        [::std::mem::offset_of!(BNFunctionRecognizer, recognizeLowLevelIL) - 8usize];
    ["Offset of field: BNFunctionRecognizer::recognizeMediumLevelIL"]
        [::std::mem::offset_of!(BNFunctionRecognizer, recognizeMediumLevelIL) - 16usize];
};
impl Default for BNFunctionRecognizer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomRelocationHandler {
    pub context: *mut ::std::os::raw::c_void,
    pub freeObject: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub getRelocationInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            arch: *mut BNArchitecture,
            result: *mut BNRelocationInfo,
            resultCount: usize,
        ) -> bool,
    >,
    pub applyRelocation: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            arch: *mut BNArchitecture,
            reloc: *mut BNRelocation,
            dest: *mut u8,
            len: usize,
        ) -> bool,
    >,
    pub getOperandForExternalRelocation: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            length: usize,
            il: *mut BNLowLevelILFunction,
            relocation: *mut BNRelocation,
        ) -> usize,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNCustomRelocationHandler"]
        [::std::mem::size_of::<BNCustomRelocationHandler>() - 40usize];
    ["Alignment of BNCustomRelocationHandler"]
        [::std::mem::align_of::<BNCustomRelocationHandler>() - 8usize];
    ["Offset of field: BNCustomRelocationHandler::context"]
        [::std::mem::offset_of!(BNCustomRelocationHandler, context) - 0usize];
    ["Offset of field: BNCustomRelocationHandler::freeObject"]
        [::std::mem::offset_of!(BNCustomRelocationHandler, freeObject) - 8usize];
    ["Offset of field: BNCustomRelocationHandler::getRelocationInfo"]
        [::std::mem::offset_of!(BNCustomRelocationHandler, getRelocationInfo) - 16usize];
    ["Offset of field: BNCustomRelocationHandler::applyRelocation"]
        [::std::mem::offset_of!(BNCustomRelocationHandler, applyRelocation) - 24usize];
    ["Offset of field: BNCustomRelocationHandler::getOperandForExternalRelocation"][::std::mem::offset_of!(
        BNCustomRelocationHandler,
        getOperandForExternalRelocation
    ) - 32usize];
};
impl Default for BNCustomRelocationHandler {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTypeParserOption {
    IncludeSystemTypes = 0,
    BuiltinMacros = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNParsedType {
    pub name: BNQualifiedName,
    pub type_: *mut BNType,
    pub isUser: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNParsedType"][::std::mem::size_of::<BNParsedType>() - 40usize];
    ["Alignment of BNParsedType"][::std::mem::align_of::<BNParsedType>() - 8usize];
    ["Offset of field: BNParsedType::name"][::std::mem::offset_of!(BNParsedType, name) - 0usize];
    ["Offset of field: BNParsedType::type_"][::std::mem::offset_of!(BNParsedType, type_) - 24usize];
    ["Offset of field: BNParsedType::isUser"]
        [::std::mem::offset_of!(BNParsedType, isUser) - 32usize];
};
impl Default for BNParsedType {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeParserResult {
    pub types: *mut BNParsedType,
    pub variables: *mut BNParsedType,
    pub functions: *mut BNParsedType,
    pub typeCount: usize,
    pub variableCount: usize,
    pub functionCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeParserResult"][::std::mem::size_of::<BNTypeParserResult>() - 48usize];
    ["Alignment of BNTypeParserResult"][::std::mem::align_of::<BNTypeParserResult>() - 8usize];
    ["Offset of field: BNTypeParserResult::types"]
        [::std::mem::offset_of!(BNTypeParserResult, types) - 0usize];
    ["Offset of field: BNTypeParserResult::variables"]
        [::std::mem::offset_of!(BNTypeParserResult, variables) - 8usize];
    ["Offset of field: BNTypeParserResult::functions"]
        [::std::mem::offset_of!(BNTypeParserResult, functions) - 16usize];
    ["Offset of field: BNTypeParserResult::typeCount"]
        [::std::mem::offset_of!(BNTypeParserResult, typeCount) - 24usize];
    ["Offset of field: BNTypeParserResult::variableCount"]
        [::std::mem::offset_of!(BNTypeParserResult, variableCount) - 32usize];
    ["Offset of field: BNTypeParserResult::functionCount"]
        [::std::mem::offset_of!(BNTypeParserResult, functionCount) - 40usize];
};
impl Default for BNTypeParserResult {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNTypeParserErrorSeverity {
    IgnoredSeverity = 0,
    NoteSeverity = 1,
    RemarkSeverity = 2,
    WarningSeverity = 3,
    ErrorSeverity = 4,
    FatalSeverity = 5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeParserError {
    pub severity: BNTypeParserErrorSeverity,
    pub message: *mut ::std::os::raw::c_char,
    pub fileName: *mut ::std::os::raw::c_char,
    pub line: u64,
    pub column: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeParserError"][::std::mem::size_of::<BNTypeParserError>() - 40usize];
    ["Alignment of BNTypeParserError"][::std::mem::align_of::<BNTypeParserError>() - 8usize];
    ["Offset of field: BNTypeParserError::severity"]
        [::std::mem::offset_of!(BNTypeParserError, severity) - 0usize];
    ["Offset of field: BNTypeParserError::message"]
        [::std::mem::offset_of!(BNTypeParserError, message) - 8usize];
    ["Offset of field: BNTypeParserError::fileName"]
        [::std::mem::offset_of!(BNTypeParserError, fileName) - 16usize];
    ["Offset of field: BNTypeParserError::line"]
        [::std::mem::offset_of!(BNTypeParserError, line) - 24usize];
    ["Offset of field: BNTypeParserError::column"]
        [::std::mem::offset_of!(BNTypeParserError, column) - 32usize];
};
impl Default for BNTypeParserError {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNQualifiedNameList {
    pub names: *mut BNQualifiedName,
    pub count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNQualifiedNameList"][::std::mem::size_of::<BNQualifiedNameList>() - 16usize];
    ["Alignment of BNQualifiedNameList"][::std::mem::align_of::<BNQualifiedNameList>() - 8usize];
    ["Offset of field: BNQualifiedNameList::names"]
        [::std::mem::offset_of!(BNQualifiedNameList, names) - 0usize];
    ["Offset of field: BNQualifiedNameList::count"]
        [::std::mem::offset_of!(BNQualifiedNameList, count) - 8usize];
};
impl Default for BNQualifiedNameList {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNUpdateResult {
    UpdateFailed = 0,
    UpdateSuccess = 1,
    AlreadyUpToDate = 2,
    UpdateAvailable = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUpdateChannel {
    pub name: *mut ::std::os::raw::c_char,
    pub description: *mut ::std::os::raw::c_char,
    pub latestVersion: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNUpdateChannel"][::std::mem::size_of::<BNUpdateChannel>() - 24usize];
    ["Alignment of BNUpdateChannel"][::std::mem::align_of::<BNUpdateChannel>() - 8usize];
    ["Offset of field: BNUpdateChannel::name"]
        [::std::mem::offset_of!(BNUpdateChannel, name) - 0usize];
    ["Offset of field: BNUpdateChannel::description"]
        [::std::mem::offset_of!(BNUpdateChannel, description) - 8usize];
    ["Offset of field: BNUpdateChannel::latestVersion"]
        [::std::mem::offset_of!(BNUpdateChannel, latestVersion) - 16usize];
};
impl Default for BNUpdateChannel {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNVersionInfo {
    pub major: u32,
    pub minor: u32,
    pub build: u32,
    pub channel: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNVersionInfo"][::std::mem::size_of::<BNVersionInfo>() - 24usize];
    ["Alignment of BNVersionInfo"][::std::mem::align_of::<BNVersionInfo>() - 8usize];
    ["Offset of field: BNVersionInfo::major"]
        [::std::mem::offset_of!(BNVersionInfo, major) - 0usize];
    ["Offset of field: BNVersionInfo::minor"]
        [::std::mem::offset_of!(BNVersionInfo, minor) - 4usize];
    ["Offset of field: BNVersionInfo::build"]
        [::std::mem::offset_of!(BNVersionInfo, build) - 8usize];
    ["Offset of field: BNVersionInfo::channel"]
        [::std::mem::offset_of!(BNVersionInfo, channel) - 16usize];
};
impl Default for BNVersionInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNChangelogEntry {
    pub version: BNVersionInfo,
    pub notes: *mut ::std::os::raw::c_char,
    pub time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNChangelogEntry"][::std::mem::size_of::<BNChangelogEntry>() - 40usize];
    ["Alignment of BNChangelogEntry"][::std::mem::align_of::<BNChangelogEntry>() - 8usize];
    ["Offset of field: BNChangelogEntry::version"]
        [::std::mem::offset_of!(BNChangelogEntry, version) - 0usize];
    ["Offset of field: BNChangelogEntry::notes"]
        [::std::mem::offset_of!(BNChangelogEntry, notes) - 24usize];
    ["Offset of field: BNChangelogEntry::time"]
        [::std::mem::offset_of!(BNChangelogEntry, time) - 32usize];
};
impl Default for BNChangelogEntry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUpdateVersionNew {
    pub version: BNVersionInfo,
    pub name: *mut ::std::os::raw::c_char,
    pub time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNUpdateVersionNew"][::std::mem::size_of::<BNUpdateVersionNew>() - 40usize];
    ["Alignment of BNUpdateVersionNew"][::std::mem::align_of::<BNUpdateVersionNew>() - 8usize];
    ["Offset of field: BNUpdateVersionNew::version"]
        [::std::mem::offset_of!(BNUpdateVersionNew, version) - 0usize];
    ["Offset of field: BNUpdateVersionNew::name"]
        [::std::mem::offset_of!(BNUpdateVersionNew, name) - 24usize];
    ["Offset of field: BNUpdateVersionNew::time"]
        [::std::mem::offset_of!(BNUpdateVersionNew, time) - 32usize];
};
impl Default for BNUpdateVersionNew {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUpdateChannelFullInfo {
    pub versions: *mut BNUpdateVersionNew,
    pub versionCount: u64,
    pub changelogEntries: *mut BNChangelogEntry,
    pub changelogEntryCount: u64,
    pub name: *mut ::std::os::raw::c_char,
    pub desc: *mut ::std::os::raw::c_char,
    pub latestVersion: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNUpdateChannelFullInfo"][::std::mem::size_of::<BNUpdateChannelFullInfo>() - 56usize];
    ["Alignment of BNUpdateChannelFullInfo"]
        [::std::mem::align_of::<BNUpdateChannelFullInfo>() - 8usize];
    ["Offset of field: BNUpdateChannelFullInfo::versions"]
        [::std::mem::offset_of!(BNUpdateChannelFullInfo, versions) - 0usize];
    ["Offset of field: BNUpdateChannelFullInfo::versionCount"]
        [::std::mem::offset_of!(BNUpdateChannelFullInfo, versionCount) - 8usize];
    ["Offset of field: BNUpdateChannelFullInfo::changelogEntries"]
        [::std::mem::offset_of!(BNUpdateChannelFullInfo, changelogEntries) - 16usize];
    ["Offset of field: BNUpdateChannelFullInfo::changelogEntryCount"]
        [::std::mem::offset_of!(BNUpdateChannelFullInfo, changelogEntryCount) - 24usize];
    ["Offset of field: BNUpdateChannelFullInfo::name"]
        [::std::mem::offset_of!(BNUpdateChannelFullInfo, name) - 32usize];
    ["Offset of field: BNUpdateChannelFullInfo::desc"]
        [::std::mem::offset_of!(BNUpdateChannelFullInfo, desc) - 40usize];
    ["Offset of field: BNUpdateChannelFullInfo::latestVersion"]
        [::std::mem::offset_of!(BNUpdateChannelFullInfo, latestVersion) - 48usize];
};
impl Default for BNUpdateChannelFullInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUpdateVersion {
    pub version: *mut ::std::os::raw::c_char,
    pub notes: *mut ::std::os::raw::c_char,
    pub time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNUpdateVersion"][::std::mem::size_of::<BNUpdateVersion>() - 24usize];
    ["Alignment of BNUpdateVersion"][::std::mem::align_of::<BNUpdateVersion>() - 8usize];
    ["Offset of field: BNUpdateVersion::version"]
        [::std::mem::offset_of!(BNUpdateVersion, version) - 0usize];
    ["Offset of field: BNUpdateVersion::notes"]
        [::std::mem::offset_of!(BNUpdateVersion, notes) - 8usize];
    ["Offset of field: BNUpdateVersion::time"]
        [::std::mem::offset_of!(BNUpdateVersion, time) - 16usize];
};
impl Default for BNUpdateVersion {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStringReference {
    pub type_: BNStringType,
    pub start: u64,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNStringReference"][::std::mem::size_of::<BNStringReference>() - 24usize];
    ["Alignment of BNStringReference"][::std::mem::align_of::<BNStringReference>() - 8usize];
    ["Offset of field: BNStringReference::type_"]
        [::std::mem::offset_of!(BNStringReference, type_) - 0usize];
    ["Offset of field: BNStringReference::start"]
        [::std::mem::offset_of!(BNStringReference, start) - 8usize];
    ["Offset of field: BNStringReference::length"]
        [::std::mem::offset_of!(BNStringReference, length) - 16usize];
};
impl Default for BNStringReference {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNPluginCommandType {
    DefaultPluginCommand = 0,
    AddressPluginCommand = 1,
    RangePluginCommand = 2,
    FunctionPluginCommand = 3,
    LowLevelILFunctionPluginCommand = 4,
    LowLevelILInstructionPluginCommand = 5,
    MediumLevelILFunctionPluginCommand = 6,
    MediumLevelILInstructionPluginCommand = 7,
    HighLevelILFunctionPluginCommand = 8,
    HighLevelILInstructionPluginCommand = 9,
    ProjectPluginCommand = 10,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPluginCommand {
    pub name: *mut ::std::os::raw::c_char,
    pub description: *mut ::std::os::raw::c_char,
    pub type_: BNPluginCommandType,
    pub context: *mut ::std::os::raw::c_void,
    pub defaultCommand: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNBinaryView),
    >,
    pub addressCommand: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNBinaryView, addr: u64),
    >,
    pub rangeCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            addr: u64,
            len: u64,
        ),
    >,
    pub functionCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub lowLevelILFunctionCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNLowLevelILFunction,
        ),
    >,
    pub lowLevelILInstructionCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNLowLevelILFunction,
            instr: usize,
        ),
    >,
    pub mediumLevelILFunctionCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNMediumLevelILFunction,
        ),
    >,
    pub mediumLevelILInstructionCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNMediumLevelILFunction,
            instr: usize,
        ),
    >,
    pub highLevelILFunctionCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNHighLevelILFunction,
        ),
    >,
    pub highLevelILInstructionCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNHighLevelILFunction,
            instr: usize,
        ),
    >,
    pub projectCommand: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNProject),
    >,
    pub defaultIsValid: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNBinaryView) -> bool,
    >,
    pub addressIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            addr: u64,
        ) -> bool,
    >,
    pub rangeIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            addr: u64,
            len: u64,
        ) -> bool,
    >,
    pub functionIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ) -> bool,
    >,
    pub lowLevelILFunctionIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNLowLevelILFunction,
        ) -> bool,
    >,
    pub lowLevelILInstructionIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNLowLevelILFunction,
            instr: usize,
        ) -> bool,
    >,
    pub mediumLevelILFunctionIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNMediumLevelILFunction,
        ) -> bool,
    >,
    pub mediumLevelILInstructionIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNMediumLevelILFunction,
            instr: usize,
        ) -> bool,
    >,
    pub highLevelILFunctionIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNHighLevelILFunction,
        ) -> bool,
    >,
    pub highLevelILInstructionIsValid: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNHighLevelILFunction,
            instr: usize,
        ) -> bool,
    >,
    pub projectIsValid: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNProject) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNPluginCommand"][::std::mem::size_of::<BNPluginCommand>() - 208usize];
    ["Alignment of BNPluginCommand"][::std::mem::align_of::<BNPluginCommand>() - 8usize];
    ["Offset of field: BNPluginCommand::name"]
        [::std::mem::offset_of!(BNPluginCommand, name) - 0usize];
    ["Offset of field: BNPluginCommand::description"]
        [::std::mem::offset_of!(BNPluginCommand, description) - 8usize];
    ["Offset of field: BNPluginCommand::type_"]
        [::std::mem::offset_of!(BNPluginCommand, type_) - 16usize];
    ["Offset of field: BNPluginCommand::context"]
        [::std::mem::offset_of!(BNPluginCommand, context) - 24usize];
    ["Offset of field: BNPluginCommand::defaultCommand"]
        [::std::mem::offset_of!(BNPluginCommand, defaultCommand) - 32usize];
    ["Offset of field: BNPluginCommand::addressCommand"]
        [::std::mem::offset_of!(BNPluginCommand, addressCommand) - 40usize];
    ["Offset of field: BNPluginCommand::rangeCommand"]
        [::std::mem::offset_of!(BNPluginCommand, rangeCommand) - 48usize];
    ["Offset of field: BNPluginCommand::functionCommand"]
        [::std::mem::offset_of!(BNPluginCommand, functionCommand) - 56usize];
    ["Offset of field: BNPluginCommand::lowLevelILFunctionCommand"]
        [::std::mem::offset_of!(BNPluginCommand, lowLevelILFunctionCommand) - 64usize];
    ["Offset of field: BNPluginCommand::lowLevelILInstructionCommand"]
        [::std::mem::offset_of!(BNPluginCommand, lowLevelILInstructionCommand) - 72usize];
    ["Offset of field: BNPluginCommand::mediumLevelILFunctionCommand"]
        [::std::mem::offset_of!(BNPluginCommand, mediumLevelILFunctionCommand) - 80usize];
    ["Offset of field: BNPluginCommand::mediumLevelILInstructionCommand"]
        [::std::mem::offset_of!(BNPluginCommand, mediumLevelILInstructionCommand) - 88usize];
    ["Offset of field: BNPluginCommand::highLevelILFunctionCommand"]
        [::std::mem::offset_of!(BNPluginCommand, highLevelILFunctionCommand) - 96usize];
    ["Offset of field: BNPluginCommand::highLevelILInstructionCommand"]
        [::std::mem::offset_of!(BNPluginCommand, highLevelILInstructionCommand) - 104usize];
    ["Offset of field: BNPluginCommand::projectCommand"]
        [::std::mem::offset_of!(BNPluginCommand, projectCommand) - 112usize];
    ["Offset of field: BNPluginCommand::defaultIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, defaultIsValid) - 120usize];
    ["Offset of field: BNPluginCommand::addressIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, addressIsValid) - 128usize];
    ["Offset of field: BNPluginCommand::rangeIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, rangeIsValid) - 136usize];
    ["Offset of field: BNPluginCommand::functionIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, functionIsValid) - 144usize];
    ["Offset of field: BNPluginCommand::lowLevelILFunctionIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, lowLevelILFunctionIsValid) - 152usize];
    ["Offset of field: BNPluginCommand::lowLevelILInstructionIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, lowLevelILInstructionIsValid) - 160usize];
    ["Offset of field: BNPluginCommand::mediumLevelILFunctionIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, mediumLevelILFunctionIsValid) - 168usize];
    ["Offset of field: BNPluginCommand::mediumLevelILInstructionIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, mediumLevelILInstructionIsValid) - 176usize];
    ["Offset of field: BNPluginCommand::highLevelILFunctionIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, highLevelILFunctionIsValid) - 184usize];
    ["Offset of field: BNPluginCommand::highLevelILInstructionIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, highLevelILInstructionIsValid) - 192usize];
    ["Offset of field: BNPluginCommand::projectIsValid"]
        [::std::mem::offset_of!(BNPluginCommand, projectIsValid) - 200usize];
};
impl Default for BNPluginCommand {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomCallingConvention {
    pub context: *mut ::std::os::raw::c_void,
    pub freeObject: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub getCallerSavedRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getCalleeSavedRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getIntegerArgumentRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getFloatArgumentRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub freeRegisterList: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, regs: *mut u32, len: usize),
    >,
    pub areArgumentRegistersSharedIndex:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub isStackReservedForArgumentRegisters:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub isStackAdjustedOnReturn:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub isEligibleForHeuristics:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getIntegerReturnValueRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getHighIntegerReturnValueRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getFloatReturnValueRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getGlobalPointerRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getImplicitlyDefinedRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getIncomingRegisterValue: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            reg: u32,
            func: *mut BNFunction,
            result: *mut BNRegisterValue,
        ),
    >,
    pub getIncomingFlagValue: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flag: u32,
            func: *mut BNFunction,
            result: *mut BNRegisterValue,
        ),
    >,
    pub getIncomingVariableForParameterVariable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            var: *const BNVariable,
            func: *mut BNFunction,
            result: *mut BNVariable,
        ),
    >,
    pub getParameterVariableForIncomingVariable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            var: *const BNVariable,
            func: *mut BNFunction,
            result: *mut BNVariable,
        ),
    >,
    pub areArgumentRegistersUsedForVarArgs:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNCustomCallingConvention"]
        [::std::mem::size_of::<BNCustomCallingConvention>() - 168usize];
    ["Alignment of BNCustomCallingConvention"]
        [::std::mem::align_of::<BNCustomCallingConvention>() - 8usize];
    ["Offset of field: BNCustomCallingConvention::context"]
        [::std::mem::offset_of!(BNCustomCallingConvention, context) - 0usize];
    ["Offset of field: BNCustomCallingConvention::freeObject"]
        [::std::mem::offset_of!(BNCustomCallingConvention, freeObject) - 8usize];
    ["Offset of field: BNCustomCallingConvention::getCallerSavedRegisters"]
        [::std::mem::offset_of!(BNCustomCallingConvention, getCallerSavedRegisters) - 16usize];
    ["Offset of field: BNCustomCallingConvention::getCalleeSavedRegisters"]
        [::std::mem::offset_of!(BNCustomCallingConvention, getCalleeSavedRegisters) - 24usize];
    ["Offset of field: BNCustomCallingConvention::getIntegerArgumentRegisters"]
        [::std::mem::offset_of!(BNCustomCallingConvention, getIntegerArgumentRegisters) - 32usize];
    ["Offset of field: BNCustomCallingConvention::getFloatArgumentRegisters"]
        [::std::mem::offset_of!(BNCustomCallingConvention, getFloatArgumentRegisters) - 40usize];
    ["Offset of field: BNCustomCallingConvention::freeRegisterList"]
        [::std::mem::offset_of!(BNCustomCallingConvention, freeRegisterList) - 48usize];
    ["Offset of field: BNCustomCallingConvention::areArgumentRegistersSharedIndex"][::std::mem::offset_of!(
        BNCustomCallingConvention,
        areArgumentRegistersSharedIndex
    ) - 56usize];
    ["Offset of field: BNCustomCallingConvention::isStackReservedForArgumentRegisters"][::std::mem::offset_of!(
        BNCustomCallingConvention,
        isStackReservedForArgumentRegisters
    )
        - 64usize];
    ["Offset of field: BNCustomCallingConvention::isStackAdjustedOnReturn"]
        [::std::mem::offset_of!(BNCustomCallingConvention, isStackAdjustedOnReturn) - 72usize];
    ["Offset of field: BNCustomCallingConvention::isEligibleForHeuristics"]
        [::std::mem::offset_of!(BNCustomCallingConvention, isEligibleForHeuristics) - 80usize];
    ["Offset of field: BNCustomCallingConvention::getIntegerReturnValueRegister"][::std::mem::offset_of!(
        BNCustomCallingConvention,
        getIntegerReturnValueRegister
    ) - 88usize];
    ["Offset of field: BNCustomCallingConvention::getHighIntegerReturnValueRegister"][::std::mem::offset_of!(
        BNCustomCallingConvention,
        getHighIntegerReturnValueRegister
    ) - 96usize];
    ["Offset of field: BNCustomCallingConvention::getFloatReturnValueRegister"]
        [::std::mem::offset_of!(BNCustomCallingConvention, getFloatReturnValueRegister) - 104usize];
    ["Offset of field: BNCustomCallingConvention::getGlobalPointerRegister"]
        [::std::mem::offset_of!(BNCustomCallingConvention, getGlobalPointerRegister) - 112usize];
    ["Offset of field: BNCustomCallingConvention::getImplicitlyDefinedRegisters"][::std::mem::offset_of!(
        BNCustomCallingConvention,
        getImplicitlyDefinedRegisters
    ) - 120usize];
    ["Offset of field: BNCustomCallingConvention::getIncomingRegisterValue"]
        [::std::mem::offset_of!(BNCustomCallingConvention, getIncomingRegisterValue) - 128usize];
    ["Offset of field: BNCustomCallingConvention::getIncomingFlagValue"]
        [::std::mem::offset_of!(BNCustomCallingConvention, getIncomingFlagValue) - 136usize];
    ["Offset of field: BNCustomCallingConvention::getIncomingVariableForParameterVariable"][::std::mem::offset_of!(
        BNCustomCallingConvention,
        getIncomingVariableForParameterVariable
    )
        - 144usize];
    ["Offset of field: BNCustomCallingConvention::getParameterVariableForIncomingVariable"][::std::mem::offset_of!(
        BNCustomCallingConvention,
        getParameterVariableForIncomingVariable
    )
        - 152usize];
    ["Offset of field: BNCustomCallingConvention::areArgumentRegistersUsedForVarArgs"][::std::mem::offset_of!(
        BNCustomCallingConvention,
        areArgumentRegistersUsedForVarArgs
    )
        - 160usize];
};
impl Default for BNCustomCallingConvention {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNVariableNameAndType {
    pub var: BNVariable,
    pub type_: *mut BNType,
    pub name: *mut ::std::os::raw::c_char,
    pub autoDefined: bool,
    pub typeConfidence: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNVariableNameAndType"][::std::mem::size_of::<BNVariableNameAndType>() - 40usize];
    ["Alignment of BNVariableNameAndType"]
        [::std::mem::align_of::<BNVariableNameAndType>() - 8usize];
    ["Offset of field: BNVariableNameAndType::var"]
        [::std::mem::offset_of!(BNVariableNameAndType, var) - 0usize];
    ["Offset of field: BNVariableNameAndType::type_"]
        [::std::mem::offset_of!(BNVariableNameAndType, type_) - 16usize];
    ["Offset of field: BNVariableNameAndType::name"]
        [::std::mem::offset_of!(BNVariableNameAndType, name) - 24usize];
    ["Offset of field: BNVariableNameAndType::autoDefined"]
        [::std::mem::offset_of!(BNVariableNameAndType, autoDefined) - 32usize];
    ["Offset of field: BNVariableNameAndType::typeConfidence"]
        [::std::mem::offset_of!(BNVariableNameAndType, typeConfidence) - 33usize];
};
impl Default for BNVariableNameAndType {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStackVariableReference {
    pub sourceOperand: u32,
    pub typeConfidence: u8,
    pub type_: *mut BNType,
    pub name: *mut ::std::os::raw::c_char,
    pub varIdentifier: u64,
    pub referencedOffset: i64,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNStackVariableReference"]
        [::std::mem::size_of::<BNStackVariableReference>() - 48usize];
    ["Alignment of BNStackVariableReference"]
        [::std::mem::align_of::<BNStackVariableReference>() - 8usize];
    ["Offset of field: BNStackVariableReference::sourceOperand"]
        [::std::mem::offset_of!(BNStackVariableReference, sourceOperand) - 0usize];
    ["Offset of field: BNStackVariableReference::typeConfidence"]
        [::std::mem::offset_of!(BNStackVariableReference, typeConfidence) - 4usize];
    ["Offset of field: BNStackVariableReference::type_"]
        [::std::mem::offset_of!(BNStackVariableReference, type_) - 8usize];
    ["Offset of field: BNStackVariableReference::name"]
        [::std::mem::offset_of!(BNStackVariableReference, name) - 16usize];
    ["Offset of field: BNStackVariableReference::varIdentifier"]
        [::std::mem::offset_of!(BNStackVariableReference, varIdentifier) - 24usize];
    ["Offset of field: BNStackVariableReference::referencedOffset"]
        [::std::mem::offset_of!(BNStackVariableReference, referencedOffset) - 32usize];
    ["Offset of field: BNStackVariableReference::size"]
        [::std::mem::offset_of!(BNStackVariableReference, size) - 40usize];
};
impl Default for BNStackVariableReference {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNIndirectBranchInfo {
    pub sourceArch: *mut BNArchitecture,
    pub sourceAddr: u64,
    pub destArch: *mut BNArchitecture,
    pub destAddr: u64,
    pub autoDefined: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNIndirectBranchInfo"][::std::mem::size_of::<BNIndirectBranchInfo>() - 40usize];
    ["Alignment of BNIndirectBranchInfo"][::std::mem::align_of::<BNIndirectBranchInfo>() - 8usize];
    ["Offset of field: BNIndirectBranchInfo::sourceArch"]
        [::std::mem::offset_of!(BNIndirectBranchInfo, sourceArch) - 0usize];
    ["Offset of field: BNIndirectBranchInfo::sourceAddr"]
        [::std::mem::offset_of!(BNIndirectBranchInfo, sourceAddr) - 8usize];
    ["Offset of field: BNIndirectBranchInfo::destArch"]
        [::std::mem::offset_of!(BNIndirectBranchInfo, destArch) - 16usize];
    ["Offset of field: BNIndirectBranchInfo::destAddr"]
        [::std::mem::offset_of!(BNIndirectBranchInfo, destAddr) - 24usize];
    ["Offset of field: BNIndirectBranchInfo::autoDefined"]
        [::std::mem::offset_of!(BNIndirectBranchInfo, autoDefined) - 32usize];
};
impl Default for BNIndirectBranchInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNArchitectureAndAddress {
    pub arch: *mut BNArchitecture,
    pub address: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNArchitectureAndAddress"]
        [::std::mem::size_of::<BNArchitectureAndAddress>() - 16usize];
    ["Alignment of BNArchitectureAndAddress"]
        [::std::mem::align_of::<BNArchitectureAndAddress>() - 8usize];
    ["Offset of field: BNArchitectureAndAddress::arch"]
        [::std::mem::offset_of!(BNArchitectureAndAddress, arch) - 0usize];
    ["Offset of field: BNArchitectureAndAddress::address"]
        [::std::mem::offset_of!(BNArchitectureAndAddress, address) - 8usize];
};
impl Default for BNArchitectureAndAddress {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUserVariableValue {
    pub var: BNVariable,
    pub defSite: BNArchitectureAndAddress,
    pub after: bool,
    pub value: BNPossibleValueSet,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNUserVariableValue"][::std::mem::size_of::<BNUserVariableValue>() - 104usize];
    ["Alignment of BNUserVariableValue"][::std::mem::align_of::<BNUserVariableValue>() - 8usize];
    ["Offset of field: BNUserVariableValue::var"]
        [::std::mem::offset_of!(BNUserVariableValue, var) - 0usize];
    ["Offset of field: BNUserVariableValue::defSite"]
        [::std::mem::offset_of!(BNUserVariableValue, defSite) - 16usize];
    ["Offset of field: BNUserVariableValue::after"]
        [::std::mem::offset_of!(BNUserVariableValue, after) - 32usize];
    ["Offset of field: BNUserVariableValue::value"]
        [::std::mem::offset_of!(BNUserVariableValue, value) - 40usize];
};
impl Default for BNUserVariableValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNVariableFieldResolutionInfo {
    pub location: BNArchitectureAndAddress,
    pub var: BNVariable,
    pub info: *mut BNFieldResolutionInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNVariableFieldResolutionInfo"]
        [::std::mem::size_of::<BNVariableFieldResolutionInfo>() - 40usize];
    ["Alignment of BNVariableFieldResolutionInfo"]
        [::std::mem::align_of::<BNVariableFieldResolutionInfo>() - 8usize];
    ["Offset of field: BNVariableFieldResolutionInfo::location"]
        [::std::mem::offset_of!(BNVariableFieldResolutionInfo, location) - 0usize];
    ["Offset of field: BNVariableFieldResolutionInfo::var"]
        [::std::mem::offset_of!(BNVariableFieldResolutionInfo, var) - 16usize];
    ["Offset of field: BNVariableFieldResolutionInfo::info"]
        [::std::mem::offset_of!(BNVariableFieldResolutionInfo, info) - 32usize];
};
impl Default for BNVariableFieldResolutionInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNFunctionUpdateType {
    UserFunctionUpdate = 0,
    FullAutoFunctionUpdate = 1,
    IncrementalAutoFunctionUpdate = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNAnalysisState {
    #[doc = " Entry point before any analysis begins"]
    InitialState = 0,
    #[doc = " Module-level analysis is deferred; On-demand function analysis is permitted"]
    HoldState = 1,
    #[doc = " No active analysis; system is idle and ready"]
    IdleState = 2,
    #[doc = " Context gathering and auxiliary data preparation"]
    DiscoveryState = 3,
    #[doc = " Instruction decoding and control flow discovery"]
    DisassembleState = 4,
    #[doc = " Core semantic and structural analysis"]
    AnalyzeState = 5,
    #[doc = " Supplemental analysis: sweeping, type resolution, and pattern matching"]
    ExtendedAnalyzeState = 6,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNActiveAnalysisInfo {
    pub func: *mut BNFunction,
    pub analysisTime: u64,
    pub updateCount: usize,
    pub submitCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNActiveAnalysisInfo"][::std::mem::size_of::<BNActiveAnalysisInfo>() - 32usize];
    ["Alignment of BNActiveAnalysisInfo"][::std::mem::align_of::<BNActiveAnalysisInfo>() - 8usize];
    ["Offset of field: BNActiveAnalysisInfo::func"]
        [::std::mem::offset_of!(BNActiveAnalysisInfo, func) - 0usize];
    ["Offset of field: BNActiveAnalysisInfo::analysisTime"]
        [::std::mem::offset_of!(BNActiveAnalysisInfo, analysisTime) - 8usize];
    ["Offset of field: BNActiveAnalysisInfo::updateCount"]
        [::std::mem::offset_of!(BNActiveAnalysisInfo, updateCount) - 16usize];
    ["Offset of field: BNActiveAnalysisInfo::submitCount"]
        [::std::mem::offset_of!(BNActiveAnalysisInfo, submitCount) - 24usize];
};
impl Default for BNActiveAnalysisInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNAnalysisInfo {
    pub state: BNAnalysisState,
    pub analysisTime: u64,
    pub activeInfo: *mut BNActiveAnalysisInfo,
    pub count: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNAnalysisInfo"][::std::mem::size_of::<BNAnalysisInfo>() - 32usize];
    ["Alignment of BNAnalysisInfo"][::std::mem::align_of::<BNAnalysisInfo>() - 8usize];
    ["Offset of field: BNAnalysisInfo::state"]
        [::std::mem::offset_of!(BNAnalysisInfo, state) - 0usize];
    ["Offset of field: BNAnalysisInfo::analysisTime"]
        [::std::mem::offset_of!(BNAnalysisInfo, analysisTime) - 8usize];
    ["Offset of field: BNAnalysisInfo::activeInfo"]
        [::std::mem::offset_of!(BNAnalysisInfo, activeInfo) - 16usize];
    ["Offset of field: BNAnalysisInfo::count"]
        [::std::mem::offset_of!(BNAnalysisInfo, count) - 24usize];
};
impl Default for BNAnalysisInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNAnalysisProgress {
    pub state: BNAnalysisState,
    pub count: usize,
    pub total: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNAnalysisProgress"][::std::mem::size_of::<BNAnalysisProgress>() - 24usize];
    ["Alignment of BNAnalysisProgress"][::std::mem::align_of::<BNAnalysisProgress>() - 8usize];
    ["Offset of field: BNAnalysisProgress::state"]
        [::std::mem::offset_of!(BNAnalysisProgress, state) - 0usize];
    ["Offset of field: BNAnalysisProgress::count"]
        [::std::mem::offset_of!(BNAnalysisProgress, count) - 8usize];
    ["Offset of field: BNAnalysisProgress::total"]
        [::std::mem::offset_of!(BNAnalysisProgress, total) - 16usize];
};
impl Default for BNAnalysisProgress {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNAnalysisMode {
    FullAnalysisMode = 0,
    IntermediateAnalysisMode = 1,
    BasicAnalysisMode = 2,
    ControlFlowAnalysisMode = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNAnalysisParameters {
    pub maxAnalysisTime: u64,
    pub maxFunctionSize: u64,
    pub maxFunctionAnalysisTime: u64,
    pub maxFunctionUpdateCount: usize,
    pub maxFunctionSubmitCount: usize,
    pub suppressNewAutoFunctionAnalysis: bool,
    pub mode: BNAnalysisMode,
    pub alwaysAnalyzeIndirectBranches: bool,
    pub advancedAnalysisCacheSize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNAnalysisParameters"][::std::mem::size_of::<BNAnalysisParameters>() - 56usize];
    ["Alignment of BNAnalysisParameters"][::std::mem::align_of::<BNAnalysisParameters>() - 8usize];
    ["Offset of field: BNAnalysisParameters::maxAnalysisTime"]
        [::std::mem::offset_of!(BNAnalysisParameters, maxAnalysisTime) - 0usize];
    ["Offset of field: BNAnalysisParameters::maxFunctionSize"]
        [::std::mem::offset_of!(BNAnalysisParameters, maxFunctionSize) - 8usize];
    ["Offset of field: BNAnalysisParameters::maxFunctionAnalysisTime"]
        [::std::mem::offset_of!(BNAnalysisParameters, maxFunctionAnalysisTime) - 16usize];
    ["Offset of field: BNAnalysisParameters::maxFunctionUpdateCount"]
        [::std::mem::offset_of!(BNAnalysisParameters, maxFunctionUpdateCount) - 24usize];
    ["Offset of field: BNAnalysisParameters::maxFunctionSubmitCount"]
        [::std::mem::offset_of!(BNAnalysisParameters, maxFunctionSubmitCount) - 32usize];
    ["Offset of field: BNAnalysisParameters::suppressNewAutoFunctionAnalysis"]
        [::std::mem::offset_of!(BNAnalysisParameters, suppressNewAutoFunctionAnalysis) - 40usize];
    ["Offset of field: BNAnalysisParameters::mode"]
        [::std::mem::offset_of!(BNAnalysisParameters, mode) - 41usize];
    ["Offset of field: BNAnalysisParameters::alwaysAnalyzeIndirectBranches"]
        [::std::mem::offset_of!(BNAnalysisParameters, alwaysAnalyzeIndirectBranches) - 42usize];
    ["Offset of field: BNAnalysisParameters::advancedAnalysisCacheSize"]
        [::std::mem::offset_of!(BNAnalysisParameters, advancedAnalysisCacheSize) - 48usize];
};
impl Default for BNAnalysisParameters {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadInstanceResponse {
    pub statusCode: u16,
    pub headerCount: u64,
    pub headerKeys: *mut *mut ::std::os::raw::c_char,
    pub headerValues: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDownloadInstanceResponse"]
        [::std::mem::size_of::<BNDownloadInstanceResponse>() - 32usize];
    ["Alignment of BNDownloadInstanceResponse"]
        [::std::mem::align_of::<BNDownloadInstanceResponse>() - 8usize];
    ["Offset of field: BNDownloadInstanceResponse::statusCode"]
        [::std::mem::offset_of!(BNDownloadInstanceResponse, statusCode) - 0usize];
    ["Offset of field: BNDownloadInstanceResponse::headerCount"]
        [::std::mem::offset_of!(BNDownloadInstanceResponse, headerCount) - 8usize];
    ["Offset of field: BNDownloadInstanceResponse::headerKeys"]
        [::std::mem::offset_of!(BNDownloadInstanceResponse, headerKeys) - 16usize];
    ["Offset of field: BNDownloadInstanceResponse::headerValues"]
        [::std::mem::offset_of!(BNDownloadInstanceResponse, headerValues) - 24usize];
};
impl Default for BNDownloadInstanceResponse {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadInstanceInputOutputCallbacks {
    pub readCallback: ::std::option::Option<
        unsafe extern "C" fn(data: *mut u8, len: u64, ctxt: *mut ::std::os::raw::c_void) -> i64,
    >,
    pub readContext: *mut ::std::os::raw::c_void,
    pub writeCallback: ::std::option::Option<
        unsafe extern "C" fn(data: *mut u8, len: u64, ctxt: *mut ::std::os::raw::c_void) -> u64,
    >,
    pub writeContext: *mut ::std::os::raw::c_void,
    pub progressCallback: BNProgressFunction,
    pub progressContext: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDownloadInstanceInputOutputCallbacks"]
        [::std::mem::size_of::<BNDownloadInstanceInputOutputCallbacks>() - 48usize];
    ["Alignment of BNDownloadInstanceInputOutputCallbacks"]
        [::std::mem::align_of::<BNDownloadInstanceInputOutputCallbacks>() - 8usize];
    ["Offset of field: BNDownloadInstanceInputOutputCallbacks::readCallback"]
        [::std::mem::offset_of!(BNDownloadInstanceInputOutputCallbacks, readCallback) - 0usize];
    ["Offset of field: BNDownloadInstanceInputOutputCallbacks::readContext"]
        [::std::mem::offset_of!(BNDownloadInstanceInputOutputCallbacks, readContext) - 8usize];
    ["Offset of field: BNDownloadInstanceInputOutputCallbacks::writeCallback"]
        [::std::mem::offset_of!(BNDownloadInstanceInputOutputCallbacks, writeCallback) - 16usize];
    ["Offset of field: BNDownloadInstanceInputOutputCallbacks::writeContext"]
        [::std::mem::offset_of!(BNDownloadInstanceInputOutputCallbacks, writeContext) - 24usize];
    ["Offset of field: BNDownloadInstanceInputOutputCallbacks::progressCallback"][::std::mem::offset_of!(
        BNDownloadInstanceInputOutputCallbacks,
        progressCallback
    ) - 32usize];
    ["Offset of field: BNDownloadInstanceInputOutputCallbacks::progressContext"]
        [::std::mem::offset_of!(BNDownloadInstanceInputOutputCallbacks, progressContext) - 40usize];
};
impl Default for BNDownloadInstanceInputOutputCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadInstanceOutputCallbacks {
    pub writeCallback: ::std::option::Option<
        unsafe extern "C" fn(data: *mut u8, len: u64, ctxt: *mut ::std::os::raw::c_void) -> u64,
    >,
    pub writeContext: *mut ::std::os::raw::c_void,
    pub progressCallback: BNProgressFunction,
    pub progressContext: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDownloadInstanceOutputCallbacks"]
        [::std::mem::size_of::<BNDownloadInstanceOutputCallbacks>() - 32usize];
    ["Alignment of BNDownloadInstanceOutputCallbacks"]
        [::std::mem::align_of::<BNDownloadInstanceOutputCallbacks>() - 8usize];
    ["Offset of field: BNDownloadInstanceOutputCallbacks::writeCallback"]
        [::std::mem::offset_of!(BNDownloadInstanceOutputCallbacks, writeCallback) - 0usize];
    ["Offset of field: BNDownloadInstanceOutputCallbacks::writeContext"]
        [::std::mem::offset_of!(BNDownloadInstanceOutputCallbacks, writeContext) - 8usize];
    ["Offset of field: BNDownloadInstanceOutputCallbacks::progressCallback"]
        [::std::mem::offset_of!(BNDownloadInstanceOutputCallbacks, progressCallback) - 16usize];
    ["Offset of field: BNDownloadInstanceOutputCallbacks::progressContext"]
        [::std::mem::offset_of!(BNDownloadInstanceOutputCallbacks, progressContext) - 24usize];
};
impl Default for BNDownloadInstanceOutputCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadInstanceCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub destroyInstance:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub performRequest: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            url: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub performCustomRequest: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            method: *const ::std::os::raw::c_char,
            url: *const ::std::os::raw::c_char,
            headerCount: u64,
            headerKeys: *const *const ::std::os::raw::c_char,
            headerValues: *const *const ::std::os::raw::c_char,
            response: *mut *mut BNDownloadInstanceResponse,
        ) -> ::std::os::raw::c_int,
    >,
    pub freeResponse: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            response: *mut BNDownloadInstanceResponse,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDownloadInstanceCallbacks"]
        [::std::mem::size_of::<BNDownloadInstanceCallbacks>() - 40usize];
    ["Alignment of BNDownloadInstanceCallbacks"]
        [::std::mem::align_of::<BNDownloadInstanceCallbacks>() - 8usize];
    ["Offset of field: BNDownloadInstanceCallbacks::context"]
        [::std::mem::offset_of!(BNDownloadInstanceCallbacks, context) - 0usize];
    ["Offset of field: BNDownloadInstanceCallbacks::destroyInstance"]
        [::std::mem::offset_of!(BNDownloadInstanceCallbacks, destroyInstance) - 8usize];
    ["Offset of field: BNDownloadInstanceCallbacks::performRequest"]
        [::std::mem::offset_of!(BNDownloadInstanceCallbacks, performRequest) - 16usize];
    ["Offset of field: BNDownloadInstanceCallbacks::performCustomRequest"]
        [::std::mem::offset_of!(BNDownloadInstanceCallbacks, performCustomRequest) - 24usize];
    ["Offset of field: BNDownloadInstanceCallbacks::freeResponse"]
        [::std::mem::offset_of!(BNDownloadInstanceCallbacks, freeResponse) - 32usize];
};
impl Default for BNDownloadInstanceCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadProviderCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub createInstance: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> *mut BNDownloadInstance,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNDownloadProviderCallbacks"]
        [::std::mem::size_of::<BNDownloadProviderCallbacks>() - 16usize];
    ["Alignment of BNDownloadProviderCallbacks"]
        [::std::mem::align_of::<BNDownloadProviderCallbacks>() - 8usize];
    ["Offset of field: BNDownloadProviderCallbacks::context"]
        [::std::mem::offset_of!(BNDownloadProviderCallbacks, context) - 0usize];
    ["Offset of field: BNDownloadProviderCallbacks::createInstance"]
        [::std::mem::offset_of!(BNDownloadProviderCallbacks, createInstance) - 8usize];
};
impl Default for BNDownloadProviderCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNWebsocketClientOutputCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub connectedCallback:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub disconnectedCallback:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub errorCallback: ::std::option::Option<
        unsafe extern "C" fn(msg: *const ::std::os::raw::c_char, ctxt: *mut ::std::os::raw::c_void),
    >,
    pub readCallback: ::std::option::Option<
        unsafe extern "C" fn(data: *mut u8, len: u64, ctxt: *mut ::std::os::raw::c_void) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNWebsocketClientOutputCallbacks"]
        [::std::mem::size_of::<BNWebsocketClientOutputCallbacks>() - 40usize];
    ["Alignment of BNWebsocketClientOutputCallbacks"]
        [::std::mem::align_of::<BNWebsocketClientOutputCallbacks>() - 8usize];
    ["Offset of field: BNWebsocketClientOutputCallbacks::context"]
        [::std::mem::offset_of!(BNWebsocketClientOutputCallbacks, context) - 0usize];
    ["Offset of field: BNWebsocketClientOutputCallbacks::connectedCallback"]
        [::std::mem::offset_of!(BNWebsocketClientOutputCallbacks, connectedCallback) - 8usize];
    ["Offset of field: BNWebsocketClientOutputCallbacks::disconnectedCallback"]
        [::std::mem::offset_of!(BNWebsocketClientOutputCallbacks, disconnectedCallback) - 16usize];
    ["Offset of field: BNWebsocketClientOutputCallbacks::errorCallback"]
        [::std::mem::offset_of!(BNWebsocketClientOutputCallbacks, errorCallback) - 24usize];
    ["Offset of field: BNWebsocketClientOutputCallbacks::readCallback"]
        [::std::mem::offset_of!(BNWebsocketClientOutputCallbacks, readCallback) - 32usize];
};
impl Default for BNWebsocketClientOutputCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNWebsocketClientCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub destroyClient:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub connect: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            host: *const ::std::os::raw::c_char,
            headerCount: u64,
            headerKeys: *const *const ::std::os::raw::c_char,
            headerValues: *const *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(data: *const u8, len: u64, ctxt: *mut ::std::os::raw::c_void) -> bool,
    >,
    pub disconnect:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNWebsocketClientCallbacks"]
        [::std::mem::size_of::<BNWebsocketClientCallbacks>() - 40usize];
    ["Alignment of BNWebsocketClientCallbacks"]
        [::std::mem::align_of::<BNWebsocketClientCallbacks>() - 8usize];
    ["Offset of field: BNWebsocketClientCallbacks::context"]
        [::std::mem::offset_of!(BNWebsocketClientCallbacks, context) - 0usize];
    ["Offset of field: BNWebsocketClientCallbacks::destroyClient"]
        [::std::mem::offset_of!(BNWebsocketClientCallbacks, destroyClient) - 8usize];
    ["Offset of field: BNWebsocketClientCallbacks::connect"]
        [::std::mem::offset_of!(BNWebsocketClientCallbacks, connect) - 16usize];
    ["Offset of field: BNWebsocketClientCallbacks::write"]
        [::std::mem::offset_of!(BNWebsocketClientCallbacks, write) - 24usize];
    ["Offset of field: BNWebsocketClientCallbacks::disconnect"]
        [::std::mem::offset_of!(BNWebsocketClientCallbacks, disconnect) - 32usize];
};
impl Default for BNWebsocketClientCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNWebsocketProviderCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub createClient: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> *mut BNWebsocketClient,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNWebsocketProviderCallbacks"]
        [::std::mem::size_of::<BNWebsocketProviderCallbacks>() - 16usize];
    ["Alignment of BNWebsocketProviderCallbacks"]
        [::std::mem::align_of::<BNWebsocketProviderCallbacks>() - 8usize];
    ["Offset of field: BNWebsocketProviderCallbacks::context"]
        [::std::mem::offset_of!(BNWebsocketProviderCallbacks, context) - 0usize];
    ["Offset of field: BNWebsocketProviderCallbacks::createClient"]
        [::std::mem::offset_of!(BNWebsocketProviderCallbacks, createClient) - 8usize];
};
impl Default for BNWebsocketProviderCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNFindFlag {
    FindCaseSensitive = 0,
    FindCaseInsensitive = 1,
    FindIgnoreWhitespace = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNScriptingProviderInputReadyState {
    NotReadyForInput = 0,
    ReadyForScriptExecution = 1,
    ReadyForScriptProgramInput = 2,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BNScriptingProviderExecuteResult {
    InvalidScriptInput = 0,
    IncompleteScriptInput = 1,
    SuccessfulScriptExecution = 2,
    ScriptExecutionCancelled = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNScriptingInstanceCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub destroyInstance:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub externalRefTaken:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub externalRefReleased:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub executeScriptInput: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            input: *const ::std::os::raw::c_char,
        ) -> BNScriptingProviderExecuteResult,
    >,
    pub executeScriptInputFromFilename: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            input: *const ::std::os::raw::c_char,
        ) -> BNScriptingProviderExecuteResult,
    >,
    pub cancelScriptInput:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub releaseBinaryView: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNBinaryView),
    >,
    pub setCurrentBinaryView: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNBinaryView),
    >,
    pub setCurrentFunction: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, func: *mut BNFunction),
    >,
    pub setCurrentBasicBlock: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, block: *mut BNBasicBlock),
    >,
    pub setCurrentAddress:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, addr: u64)>,
    pub setCurrentSelection: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, begin: u64, end: u64),
    >,
    pub completeInput: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            text: *const ::std::os::raw::c_char,
            state: u64,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub stop: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNScriptingInstanceCallbacks"]
        [::std::mem::size_of::<BNScriptingInstanceCallbacks>() - 120usize];
    ["Alignment of BNScriptingInstanceCallbacks"]
        [::std::mem::align_of::<BNScriptingInstanceCallbacks>() - 8usize];
    ["Offset of field: BNScriptingInstanceCallbacks::context"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, context) - 0usize];
    ["Offset of field: BNScriptingInstanceCallbacks::destroyInstance"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, destroyInstance) - 8usize];
    ["Offset of field: BNScriptingInstanceCallbacks::externalRefTaken"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, externalRefTaken) - 16usize];
    ["Offset of field: BNScriptingInstanceCallbacks::externalRefReleased"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, externalRefReleased) - 24usize];
    ["Offset of field: BNScriptingInstanceCallbacks::executeScriptInput"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, executeScriptInput) - 32usize];
    ["Offset of field: BNScriptingInstanceCallbacks::executeScriptInputFromFilename"][::std::mem::offset_of!(
        BNScriptingInstanceCallbacks,
        executeScriptInputFromFilename
    ) - 40usize];
    ["Offset of field: BNScriptingInstanceCallbacks::cancelScriptInput"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, cancelScriptInput) - 48usize];
    ["Offset of field: BNScriptingInstanceCallbacks::releaseBinaryView"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, releaseBinaryView) - 56usize];
    ["Offset of field: BNScriptingInstanceCallbacks::setCurrentBinaryView"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, setCurrentBinaryView) - 64usize];
    ["Offset of field: BNScriptingInstanceCallbacks::setCurrentFunction"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, setCurrentFunction) - 72usize];
    ["Offset of field: BNScriptingInstanceCallbacks::setCurrentBasicBlock"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, setCurrentBasicBlock) - 80usize];
    ["Offset of field: BNScriptingInstanceCallbacks::setCurrentAddress"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, setCurrentAddress) - 88usize];
    ["Offset of field: BNScriptingInstanceCallbacks::setCurrentSelection"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, setCurrentSelection) - 96usize];
    ["Offset of field: BNScriptingInstanceCallbacks::completeInput"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, completeInput) - 104usize];
    ["Offset of field: BNScriptingInstanceCallbacks::stop"]
        [::std::mem::offset_of!(BNScriptingInstanceCallbacks, stop) - 112usize];
};
impl Default for BNScriptingInstanceCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNScriptingProviderCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub createInstance: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> *mut BNScriptingInstance,
    >,
    pub loadModule: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            repoPath: *const ::std::os::raw::c_char,
            pluginPath: *const ::std::os::raw::c_char,
            force: bool,
        ) -> bool,
    >,
    pub installModules: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            modules: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNScriptingProviderCallbacks"]
        [::std::mem::size_of::<BNScriptingProviderCallbacks>() - 32usize];
    ["Alignment of BNScriptingProviderCallbacks"]
        [::std::mem::align_of::<BNScriptingProviderCallbacks>() - 8usize];
    ["Offset of field: BNScriptingProviderCallbacks::context"]
        [::std::mem::offset_of!(BNScriptingProviderCallbacks, context) - 0usize];
    ["Offset of field: BNScriptingProviderCallbacks::createInstance"]
        [::std::mem::offset_of!(BNScriptingProviderCallbacks, createInstance) - 8usize];
    ["Offset of field: BNScriptingProviderCallbacks::loadModule"]
        [::std::mem::offset_of!(BNScriptingProviderCallbacks, loadModule) - 16usize];
    ["Offset of field: BNScriptingProviderCallbacks::installModules"]
        [::std::mem::offset_of!(BNScriptingProviderCallbacks, installModules) - 24usize];
};
impl Default for BNScriptingProviderCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNScriptingOutputListener {
    pub context: *mut ::std::os::raw::c_void,
    pub output: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            text: *const ::std::os::raw::c_char,
        ),
    >,
    pub warning: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            text: *const ::std::os::raw::c_char,
        ),
    >,
    pub error: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            text: *const ::std::os::raw::c_char,
        ),
    >,
    pub inputReadyStateChanged: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            state: BNScriptingProviderInputReadyState,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNScriptingOutputListener"]
        [::std::mem::size_of::<BNScriptingOutputListener>() - 40usize];
    ["Alignment of BNScriptingOutputListener"]
        [::std::mem::align_of::<BNScriptingOutputListener>() - 8usize];
    ["Offset of field: BNScriptingOutputListener::context"]
        [::std::mem::offset_of!(BNScriptingOutputListener, context) - 0usize];
    ["Offset of field: BNScriptingOutputListener::output"]
        [::std::mem::offset_of!(BNScriptingOutputListener, output) - 8usize];
    ["Offset of field: BNScriptingOutputListener::warning"]
        [::std::mem::offset_of!(BNScriptingOutputListener, warning) - 16usize];
    ["Offset of field: BNScriptingOutputListener::error"]
        [::std::mem::offset_of!(BNScriptingOutputListener, error) - 24usize];
    ["Offset of field: BNScriptingOutputListener::inputReadyStateChanged"]
        [::std::mem::offset_of!(BNScriptingOutputListener, inputReadyStateChanged) - 32usize];
};
impl Default for BNScriptingOutputListener {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMainThreadCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub addAction: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, action: *mut BNMainThreadAction),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNMainThreadCallbacks"][::std::mem::size_of::<BNMainThreadCallbacks>() - 16usize];
    ["Alignment of BNMainThreadCallbacks"]
        [::std::mem::align_of::<BNMainThreadCallbacks>() - 8usize];
    ["Offset of field: BNMainThreadCallbacks::context"]
        [::std::mem::offset_of!(BNMainThreadCallbacks, context) - 0usize];
    ["Offset of field: BNMainThreadCallbacks::addAction"]
        [::std::mem::offset_of!(BNMainThreadCallbacks, addAction) - 8usize];
};
impl Default for BNMainThreadCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BNTypeParserCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub getOptionText: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            option: BNTypeParserOption,
            value: *const ::std::os::raw::c_char,
            result: *mut *mut ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub preprocessSource: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            source: *const ::std::os::raw::c_char,
            fileName: *const ::std::os::raw::c_char,
            platform: *mut BNPlatform,
            existingTypes: *mut BNTypeContainer,
            options: *const *const ::std::os::raw::c_char,
            optionCount: usize,
            includeDirs: *const *const ::std::os::raw::c_char,
            includeDirCount: usize,
            output: *mut *mut ::std::os::raw::c_char,
            errors: *mut *mut BNTypeParserError,
            errorCount: *mut usize,
        ) -> bool,
    >,
    pub parseTypesFromSource: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            source: *const ::std::os::raw::c_char,
            fileName: *const ::std::os::raw::c_char,
            platform: *mut BNPlatform,
            existingTypes: *mut BNTypeContainer,
            options: *const *const ::std::os::raw::c_char,
            optionCount: usize,
            includeDirs: *const *const ::std::os::raw::c_char,
            includeDirCount: usize,
            autoTypeSource: *const ::std::os::raw::c_char,
            result: *mut BNTypeParserResult,
            errors: *mut *mut BNTypeParserError,
            errorCount: *mut usize,
        ) -> bool,
    >,
    pub parseTypeString: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            source: *const ::std::os::raw::c_char,
            platform: *mut BNPlatform,
            existingTypes: *mut BNTypeContainer,
            result: *mut BNQualifiedNameAndType,
            errors: *mut *mut BNTypeParserError,
            errorCount: *mut usize,
        ) -> bool,
    >,
    pub freeString: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            string: *mut ::std::os::raw::c_char,
        ),
    >,
    pub freeResult: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, result: *mut BNTypeParserResult),
    >,
    pub freeErrorList: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            errors: *mut BNTypeParserError,
            errorCount: usize,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BNTypeParserCallbacks"][::std::mem::size_of::<BNTypeParserCallbacks>() - 64usize];
    ["Alignment of BNTypeParserCallbacks"]
        [::std::mem::align_of::<BNTypeParserCallbacks>() - 8usize];
    ["Offset of field: BNTypeParserCallbacks::context"]
        [::std::mem::offset_of!(BNTypeParserCallbacks, context) - 0usize];
    ["Offset of field: BNTypeParserCallbacks::getOptionText"]
        [::std::mem::offset_of!(BNTypeParserCallbacks, getOptionText) - 8usize];
    ["Offset of field: BNTypeParserCallbacks::preprocessSource"]
        [::std::mem::offset_of!(BNTypeParserCallbacks, preprocessSource) - 16usize];
    ["Offset of field: BNTypeParserCallbacks::parseTypesFromSource"]
        [::std::mem::offset_of!(BNTypeParserCallbacks, parseTypesFromSource) - 24usize];
    ["Offset of field: BNTypeParserCallbacks::parseTypeString"]
        [::std::mem::offset_of!(BNTypeParserCallbacks, parseTypeString) - 32usize];
    ["Offset of field: BNTypeParserCallbacks::freeString"]
        [::std::mem::offset_of!(BNTypeParserCallbacks, freeString) - 40usize];
    ["Offset of field: BNTypeParserCallbacks::freeResult"]
        [::std::mem::offset_of!(BNTypeParserCallbacks, freeResult) - 48usize];
    ["Offset of field: BNTypeParserCallbacks::freeErrorList"]
        [::std::mem::offset_of!(BNTypeParserCallbacks, freeErrorList) - 56usize];
};
impl Default for BNTypeParserCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypePrinterCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub getTypeTokens: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            type_: *mut BNType,
            platform: *mut BNPlatform,
            name: *mut BNQualifiedName,
            baseConfidence: u8,
            escaping: BNTokenEscapingType,
            result: *mut *mut BNInstructionTextToken,
            resultCount: *mut usize,
        ) -> bool,
    >,
    pub getTypeTokensBeforeName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            type_: *mut BNType,
            platform: *mut BNPlatform,
            baseConfidence: u8,
            parentType: *mut BNType,
            escaping: BNTokenEscapingType,
            result: *mut *mut BNInstructionTextToken,
            resultCount: *mut usize,
        ) -> bool,
    >,
